In [83]:
import time
import json
import openai
import re
import sqlite3
import sqlglot
from textwrap import dedent
import pandas as pd
import numpy as np

from os import path
from openai.api_requestor import error

In [476]:
def get_schema(db_id):
    PATH = 'spider/database/'
    
    path_to_file   = PATH + db_id + '/schema.sql'
    path_to_file_2 = PATH + db_id + '/' + db_id + '.sqlite'
    
    if path.exists(path_to_file):
        x = open(path_to_file, 'r').read()
        # Remove comment lines
        # x = re.sub(r"^/\*.*\n", '', x, flags=re.MULTILINE)
        x = re.sub(r'^--.*(\n|$)', '', x, flags=re.MULTILINE)
        x = re.sub(r',\s*--.*(\n|$)', ',\n', x, flags=re.MULTILINE)
        # x = re.sub(r'^/\*.*\*/', '', x)
        x = re.sub(r'/\*.*?\*/', '', x, flags=re.DOTALL)
        
        x = re.sub(r'CREATE TABLE \t', 'CREATE TABLE ', x)
        
        arr = x.split(';')
        create_tables = []
        for i, stmt in enumerate(arr):
            stmt = stmt.strip()
            if stmt.lower().startswith('create'):
                create_tables.append(stmt.replace('IF NOT EXISTS ', '').replace('\n', ''))
        return ';'.join(create_tables)
      
    elif path.exists(path_to_file_2):
        # Connect to the sqlite file
        conn = sqlite3.connect(path_to_file_2)

        # Read the schema of the twitter_1.sqlite file into a dataframe
        df_conn = pd.read_sql_query("SELECT sql FROM sqlite_master WHERE type='table';", conn)

        # Close the connection
        conn.close()
        
        create_tables = []
        for idx, row in df_conn.iterrows():
            row['sql'] = re.sub(r'--.*$', '', row['sql'], flags=re.MULTILINE)
            #row['sql'] = re.sub(r',\s*--.*(\n|$)', ',\n', row['sql'], flags=re.MULTILINE)
            #row['sql'] = re.sub(r'^\s*--.*(\n|$)', '\n', row['sql'], flags=re.MULTILINE)
            row['sql'] = row['sql'].strip()
            if row['sql'].lower().startswith('create'):
                create_tables.append(row['sql'].replace('IF NOT EXISTS ', '').replace('\n', ''))
        return ';'.join(create_tables)
    
    else: return None
    
def few_shot_prompt(x):
    return dedent(f'''
        Convert text to SQL.
        
        DDL:
        ```
        {x['schema-1']}
        ```
        Question:
        """{x['question-1']}"""
        Answer:
        {x['completion-1']}
        
        DDL:
        {x['schema-2']}
        Question:
        """{x['question-2']}"""
        Answer:
        {x['completion-2']}
        
        DDL:
        ```
        {x['schema']}
        ```
        Question:
        """{x['question']}"""
        Answer:
        ''')

# From OpenAI: The completion should start with a whitespace character (` `). 
# This tends to produce better results due to the tokenization we use.
def open_ai_completion(x):
    return f" {x['query']}\n" 

def call_raw_model(row, engine="text-davinci-003", stop=None, max_tokens=1000):
    while True:
        try:
            prompt = row["open_ai_prompt"]

            # Duber's parameters
            completions = openai.Completion.create(
                engine=engine,
                prompt=prompt,
                temperature=0.3,
                max_tokens=max_tokens,
                best_of=1,
                frequency_penalty=0,
                presence_penalty=0,
                stop=stop
            )

            print(completions.choices[0].text)
            # raise Exception()
            return completions.choices[0].text

        except error.RateLimitError:
            print('RateLimitError')
            time.sleep(15)
            continue
        
        except error.InvalidRequestError:
            print('InvalidRequestError: too many tokens')
            break
            
        except error.APIError:
            print('APIError')
            time.sleep(15)
            continue
            
        except error.Timeout:
            print('TimeoutError')
            time.sleep(1)
            continue
            
        except error.APIConnectionError:
            print('APIConnectionError')
            time.sleep(1)
            continue
            
def execution(row, query_type):
    PATH = 'spider/database/'
    db_id = row['db_id']
    
    query = row[query_type]

    # Connect to the SQLite database file
    conn = sqlite3.connect(PATH + db_id + '/' + db_id + '.sqlite')

    # Create a cursor object
    cursor = conn.cursor()

    # Execute a SELECT statement
    try:
        cursor.execute(query)
    except:
        return "invalid SQL"

    # Fetch the results
    results = cursor.fetchall()

    # Loop through the results and print them
    # for result in results:
    #     print(result)

    # Close the cursor and connection
    cursor.close()
    conn.close()
    
    return results

# Random Examples

In [ ]:
def get_examples(x):
    examples = np.random.randint(0,len(df),2)
    for i in range(len(examples)):
        row = df.loc[examples[i]]
        x['question-' + str(i+1)]   = row['question']
        x['schema-' + str(i+1)]     = row['schema']
        x['completion-' + str(i+1)] = row['query']
        
    return x[['schema-1', 'question-1', 'completion-1', 'schema-2', 'question-2', 'completion-2']]

In [5]:
df = pd.read_json('spider/train_spider.json')

# Set schema
df['schema'] = df.apply(lambda x: get_schema(x['db_id']), axis=1)
df['schema'] = df['schema'].apply(lambda x: re.sub('(?i) REFERENCES.*?(;|$)', ';', x)) 
df['schema'] = df['schema'].apply(lambda x: re.sub('NOT NULL', '', x))

# Select the examples to show the model
df[['schema-1', 'question-1', 'completion-1', 'schema-2', 'question-2', 'completion-2']] = df.apply(lambda x: get_examples(x), axis=1)
df['open_ai_prompt'] = df.apply(lambda x: few_shot_prompt(x), axis=1)


# Set Open AI prompt and completion
df['open_ai_completion'] = df.apply(lambda x: open_ai_completion(x), axis=1)

In [6]:
df.columns

Index(['db_id', 'query', 'query_toks', 'query_toks_no_value', 'question',
       'question_toks', 'sql', 'schema', 'schema-1', 'question-1',
       'completion-1', 'schema-2', 'question-2', 'completion-2',
       'open_ai_prompt', 'open_ai_completion'],
      dtype='object')

In [7]:
print(df.loc[0]['open_ai_prompt'])

Convert text to SQL.

DDL:
```
CREATE TABLE "county" ("County_Id" int,"County_name" text,"Population" real,"Zip_code" text,PRIMARY KEY ("County_Id"));CREATE TABLE "party" ("Party_ID" int,"Year" real,"Party" text,"Governor" text,"Lieutenant_Governor" text,"Comptroller" text,"Attorney_General" text,"US_Senate" text,PRIMARY KEY ("Party_ID"));CREATE TABLE "election" ("Election_ID" int,"Counties_Represented" text,"District" int,"Delegate" text,"Party" int,"First_Elected" real,"Committee" text,PRIMARY KEY ("Election_ID"),FOREIGN KEY (`Party`);
```
Question:
"""Who are the lieutenant governor and comptroller from the democratic party?"""
Answer:
SELECT Lieutenant_Governor ,  Comptroller FROM party WHERE Party  =  "Democratic"

DDL:
CREATE TABLE "list" ( 	"LastName" TEXT, 	"FirstName" TEXT, 	"Grade" INTEGER, 	"Classroom" INTEGER,	PRIMARY KEY(LastName, FirstName));CREATE TABLE "teachers" ( 	"LastName" TEXT, 	"FirstName" TEXT, 	"Classroom" INTEGER,	PRIMARY KEY(LastName, FirstName))
Question:
"""For each grade 0 classroom, return the classroom number and the count of students."""
Answer:
SELECT classroom ,  count(*) FROM list WHERE grade  =  "0" GROUP BY classroom

DDL:
```
CREATE TABLE "department" ("Department_ID" int,"Name" text,"Creation" text,"Ranking" int,"Budget_in_Billions" real,"Num_Employees" real,PRIMARY KEY ("Department_ID"));CREATE TABLE "head" ("head_ID" int,"name" text,"born_state" text,"age" real,PRIMARY KEY ("head_ID"));CREATE TABLE "management" ("department_ID" int,"head_ID" int,"temporary_acting" text,PRIMARY KEY ("Department_ID","head_ID"),FOREIGN KEY ("Department_ID");
```
Question:
"""How many heads of the departments are older than 56 ?"""
Answer:

In [8]:
tmp = df.sample(100)
tmp['model_response'] = ''

data = []
for idx, row in tmp.iterrows():
    print(idx)
    if row['model_response'] != '':
        print('already completed')
        data.append(row['model_response'])
        continue
    
    print(row['open_ai_completion'])
    new_response = call_raw_model(row)
    data.append(new_response)
    tmp.loc[idx,'model_response'] = new_response

4447
 SELECT T1.name FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend IN (SELECT name FROM Person WHERE age  >  40) EXCEPT SELECT T1.name FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend IN (SELECT name FROM Person WHERE age  <  30)

SELECT name FROM Person WHERE age > 40 AND NOT EXISTS (SELECT * FROM PersonFriend WHERE name = Person.name AND friend < 30)
6700
 SELECT T1.lesson_id FROM Lessons AS T1 JOIN Staff AS T2 ON T1.staff_id = T2.staff_id WHERE T2.first_name = "Janessa" AND T2.last_name = "Sawayn" AND nickname LIKE "%s%";

InvalidRequestError: too many tokens
1395
 SELECT max(capacity) ,  avg(capacity) ,  building FROM classroom GROUP BY building

SELECT building, MAX(capacity) as max_capacity, AVG(capacity) as avg_capacity FROM classroom GROUP BY building
1650
 SELECT count(*) FROM artist

SELECT COUNT(*) FROM artist
4922
 SELECT t3.headquartered_city ,  count(*) FROM store AS t1 JOIN store_district AS t2 ON t1.store_id  =  t2.store_id JOIN district AS t3 ON t2.district_id  =  t3.district_id GROUP BY t3.headquartered_city

SELECT Headquartered_City, COUNT(Store_ID) AS Number_of_Stores
FROM district
INNER JOIN store_district
ON district.District_ID = store_district.District_ID
INNER JOIN store
ON store_district.Store_ID = store.Store_ID
GROUP BY Headquartered_City;
1156
 SELECT T2.Name FROM body_builder AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID

SELECT Name FROM people INNER JOIN body_builder ON people.People_ID = body_builder.People_ID
1526
 SELECT count(*) FROM claims_processing_stages

SELECT COUNT(DISTINCT Claim_Stage_ID) FROM Claims_Processing_Stages
494
 SELECT age ,  count(*) FROM Student GROUP BY age

SELECT T1.Age, COUNT(*) FROM Student AS T1 JOIN Has_Allergy AS T2 ON T1.StuID  =  T2.StuID GROUP BY T1.Age
2725
 SELECT T2.region_name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T3.number_deaths  >=  10

SELECT t2.Region_name FROM affected_region AS t1 JOIN region AS t2 ON t1.Region_id  =  t2.Region_id JOIN storm AS t3 ON t3.Storm_ID  =  t1.Storm_ID WHERE t3.Number_Deaths  >=  10
5850
 SELECT transaction_id FROM TRANSACTIONS WHERE transaction_type_code  =  'PUR'

InvalidRequestError: too many tokens
796
 SELECT membership_card FROM member WHERE address  =  'Hartford' INTERSECT SELECT membership_card FROM member WHERE address  =  'Waterbury'

SELECT DISTINCT m.Membership_card
FROM member m
JOIN happy_hour_member hhm
ON m.Member_ID = hhm.Member_ID
WHERE m.Address IN ('Hartford', 'Waterbury')
6766
 SELECT activity_name FROM Activity

SELECT activity_name FROM Activity;
5562
 SELECT t3.characteristic_name FROM products AS t1 JOIN product_characteristics AS t2 ON t1.product_id  =  t2.product_id JOIN CHARACTERISTICS AS t3 ON t2.characteristic_id  =  t3.characteristic_id WHERE t1.product_name  =  "sesame" AND t3.characteristic_type_code  =  "Grade"

SELECT c.characteristic_name, pc.product_characteristic_value
FROM Characteristics c
INNER JOIN Product_Characteristics pc ON c.characteristic_id = pc.characteristic_id
INNER JOIN Products p ON pc.product_id = p.product_id
WHERE p.product_name = 'sesame' AND c.characteristic_type_code = 'Grade'
967
 SELECT T1.name ,  T1.trade_name FROM medicine AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.medicine_id  =  T1.id WHERE interaction_type  =  'inhibitor' INTERSECT SELECT T1.name ,  T1.trade_name FROM medicine AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.medicine_id  =  T1.id WHERE interaction_type  =  'activitor'

SELECT T1.name, T1.Trade_Name FROM medicine AS T1 JOIN medicine_enzyme_interaction AS T2 ON T1.id  =  T2.medicine_id WHERE T2.interaction_type  =  'inhibitor' OR T2.interaction_type  =  'activitor' GROUP BY T1.id HAVING count(*)  >  1
351
 SELECT name ,  distance FROM Aircraft WHERE aid  =  12

InvalidRequestError: too many tokens
1877
 SELECT Name FROM wrestler WHERE Wrestler_ID NOT IN (SELECT Wrestler_ID FROM elimination)

SELECT Name FROM wrestler WHERE Wrestler_ID NOT IN (SELECT Wrestler_ID FROM Elimination)
4767
 SELECT product_id FROM Order_Items GROUP BY product_id HAVING count(*)  >  3 UNION SELECT product_id FROM Product_Suppliers GROUP BY product_id HAVING sum(total_amount_purchased)  >  80000

SELECT DISTINCT t1.product_id FROM Order_Items AS t1 JOIN Product_Suppliers AS t2 ON t1.product_id = t2.product_id WHERE t1.order_id IN (SELECT order_id FROM Order_Items GROUP BY order_id HAVING COUNT(*) > 3) OR t2.total_amount_purchased > 80000;
923
 SELECT t1.customer_name FROM customers AS t1 JOIN first_notification_of_loss AS t2 ON t1.customer_id  =  t2.customer_id JOIN services AS t3 ON t2.service_id  =  t3.service_id WHERE t3.service_name  =  "Close a policy" INTERSECT SELECT t1.customer_name FROM customers AS t1 JOIN first_notification_of_loss AS t2 ON t1.customer_id  =  t2.customer_id JOIN services AS t3 ON t2.service_id  =  t3.service_id WHERE t3.service_name  =  "New policy application"

SELECT t1.Customer_name FROM Customers AS t1 JOIN Customers_Policies AS t2 ON t1.Customer_ID  =  t2.Customer_ID JOIN First_Notification_of_Loss AS t3 ON t2.Policy_ID  =  t3.Policy_ID JOIN Services AS t4 ON t3.Service_ID  =  t4.Service_ID WHERE t4.Service_name  IN  ("Close a policy", "New policy application") GROUP BY t1.Customer_name HAVING COUNT(*)  =  2
3206
 SELECT count(*) ,  dept_code FROM CLASS AS T1 JOIN course AS T2 ON T1.crs_code  =  T2.crs_code GROUP BY dept_code

SELECT DEPT_CODE, COUNT(*) FROM CLASS
INNER JOIN COURSE ON CLASS.CRS_CODE = COURSE.CRS_CODE
GROUP BY DEPT_CODE
2381
 SELECT T2.faculty FROM campuses AS T1 JOIN faculty AS T2 ON T1.id  =  t2.campus JOIN degrees AS T3 ON T1.id  =  t3.campus AND t2.year  =  t3.year WHERE t2.year  =  2002 ORDER BY t3.degrees DESC LIMIT 1

SELECT SUM(Faculty) FROM faculty WHERE Campus  =  (SELECT Campus FROM degrees WHERE Year  =  2002 ORDER BY Degrees DESC LIMIT 1)
2678
 SELECT T3.Party_Theme ,  T2.Name FROM party_host AS T1 JOIN HOST AS T2 ON T1.Host_ID  =  T2.Host_ID JOIN party AS T3 ON T1.Party_ID  =  T3.Party_ID

SELECT Party_Theme, Name FROM party INNER JOIN party_host ON party.Party_ID = party_host.Party_ID INNER JOIN host ON party_host.Host_ID = host.Host_ID;
685
 SELECT customer_first_name ,  customer_last_name FROM Customers EXCEPT SELECT T1.customer_first_name ,  T1.customer_last_name FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id

SELECT customer_first_name, customer_last_name FROM Customers AS T1 LEFT JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.account_id  IS  NULL
3835
 SELECT T1.date_of_enrolment ,  T1.date_of_completion FROM Student_Course_Enrolment AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id WHERE T2.family_name  =  "Zieme" AND T2.personal_name  =  "Bernie"

SELECT T1.date_of_enrolment, T1.date_of_completion FROM Student_Course_Enrolment AS T1 JOIN Students AS T2 ON T1.student_id = T2.student_id WHERE T2.family_name = 'Zieme' AND T2.personal_name = 'Bernie';
5416
 SELECT card_number ,  name ,  hometown FROM member ORDER BY LEVEL DESC

SELECT Card_Number, Name, Hometown FROM member ORDER BY Level DESC;
244
 SELECT Duration FROM actor ORDER BY Age DESC LIMIT 1

SELECT MAX(T2.duration) FROM musical AS T1 JOIN actor AS T2 ON T1.musical_ID = T2.musical_ID
884
 SELECT BirthDate FROM EMPLOYEE WHERE City  =  "Edmonton"

SELECT BirthDate FROM Employee WHERE City = 'Edmonton'
951
 SELECT T1.id ,  T1.Name ,  T1.FDA_approved FROM medicine AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.medicine_id  =  T1.id GROUP BY T1.id ORDER BY count(*) DESC

SELECT medicine.id, medicine.name, medicine.FDA_approved FROM medicine INNER JOIN medicine_enzyme_interaction ON medicine.id = medicine_enzyme_interaction.medicine_id GROUP BY medicine.id ORDER BY COUNT(*) DESC
1397
 SELECT title FROM course GROUP BY title HAVING count(*)  >  1

SELECT title FROM course WHERE dept_name IN (SELECT dept_name FROM course GROUP BY dept_name HAVING COUNT(*) > 1)
4986
 SELECT count(*) ,  cName FROM tryout GROUP BY cName ORDER BY count(*) DESC

SELECT cName, COUNT(pID) as count FROM Tryout GROUP BY cName ORDER BY count DESC
4329
 SELECT T2.organisation_id ,  T2.organisation_details FROM Grants AS T1 JOIN Organisations AS T2 ON T1.organisation_id  =  T2.organisation_id GROUP BY T2.organisation_id HAVING sum(T1.grant_amount)  >  6000

SELECT o.organisation_id, o.organisation_details FROM organisations o INNER JOIN grants g ON o.organisation_id = g.organisation_id WHERE g.grant_amount > 6000;
5915
 SELECT T1.Museum_Details ,  T2.Opening_Hours FROM MUSEUMS AS T1 JOIN TOURIST_ATTRACTIONS AS T2 ON T1.Museum_ID  =  T2.Tourist_Attraction_ID

SELECT Museum_Details, Opening_Hours FROM Museums
2276
 SELECT T2.Name FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID WHERE T1.Investor != "Rachel Elnaugh"

SELECT Name FROM people p INNER JOIN entrepreneur e ON p.People_ID = e.People_ID WHERE e.Investor != "Rachel Elnaugh"
5717
 SELECT fname ,  lname FROM student WHERE city_code != 'HKG' ORDER BY age

SELECT Fname, Lname FROM Student WHERE city_code != 'HKG' ORDER BY Age ASC
4983
 SELECT DISTINCT cName FROM tryout ORDER BY cName

SELECT cName FROM Tryout ORDER BY cName ASC
5353
 SELECT problem_log_id FROM problem_log ORDER BY log_entry_date DESC LIMIT 1

SELECT problem_log_id FROM Problem_Log ORDER BY log_entry_date DESC LIMIT 1
5733
 SELECT fname ,  lname FROM student WHERE major != (SELECT major FROM student GROUP BY major ORDER BY count(*) DESC LIMIT 1)

SELECT Fname, Lname FROM Student WHERE Major != (SELECT MAX(Major) FROM Student)
5741
 SELECT count(*) ,  T3.dorm_name FROM student AS T1 JOIN lives_in AS T2 ON T1.stuid  =  T2.stuid JOIN dorm AS T3 ON T3.dormid  =  T2.dormid WHERE T1.age  >  20 GROUP BY T3.dorm_name

SELECT T1.dorm_name, COUNT(T2.StuID) AS num_students FROM Dorm AS T1 JOIN Lives_in AS T2 ON T1.dormid = T2.dormid JOIN Student AS T3 ON T2.stuid = T3.StuID WHERE T3.Age > 20 GROUP BY T1.dorm_name
414
 SELECT T1.flno FROM Flight AS T1 JOIN Aircraft AS T2 ON T1.aid  =  T2.aid WHERE T2.name  =  "Airbus A340-300"

SELECT flno FROM flight JOIN aircraft ON flight.aid  =  aircraft.aid WHERE aircraft.name  =  'Airbus A340-300'
762
 SELECT count(*) FROM race

SELECT COUNT(*) FROM race
5166
 SELECT avg(Order_Quantity) FROM Invoices WHERE payment_method_code  =  "MasterCard"

InvalidRequestError: too many tokens
1130
 SELECT T1.Name ,  T2.Height FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID

InvalidRequestError: too many tokens
6288
 SELECT T1.city FROM city AS T1 JOIN temperature AS T2 ON T1.city_id  =  T2.city_id WHERE T2.Mar  <  T2.Jul OR T2.Mar  >  T2.Oct

SELECT City FROM city c INNER JOIN temperature t ON c.City_ID = t.City_ID WHERE t.Mar < t.Jul OR t.Mar > t.Oct
2758
 SELECT T2.Delegate ,  T1.County_name FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District

SELECT Delegate, County_name FROM county c INNER JOIN election e ON c.County_Id = e.Counties_Represented
5111
 SELECT Product_Name FROM PRODUCTS ORDER BY Product_Price DESC LIMIT 1

InvalidRequestError: too many tokens
2004
 SELECT DISTINCT main_industry FROM company

InvalidRequestError: too many tokens
6384
 SELECT pilot FROM flight GROUP BY pilot ORDER BY count(*) DESC LIMIT 1

SELECT T3.Pilot, COUNT(T3.Pilot) AS Num_Flights FROM airport AS T1 JOIN flight AS T2 ON T1.id = T2.airport_id JOIN operate_company AS T3 ON T2.company_id = T3.id GROUP BY T3.Pilot ORDER BY Num_Flights DESC LIMIT 1
4432
 SELECT count(*) FROM Person WHERE age  >  (SELECT max(age) FROM person WHERE job  =  'engineer')

SELECT COUNT(*) FROM Person WHERE age > (SELECT MAX(age) FROM Person WHERE job = 'Engineer')
5902
 SELECT Other_Details FROM LOCATIONS WHERE Location_Name  =  "UK Gallery"

InvalidRequestError: too many tokens
6595
 SELECT avg(price) FROM wine WHERE Appelation NOT IN (SELECT T1.Appelation FROM APPELLATIONS AS T1 JOIN WINE AS T2 ON T1.Appelation  =  T2.Appelation WHERE T1.County  =  'Sonoma')

SELECT AVG(Price) FROM wine WHERE Appelation NOT IN (SELECT Appelation FROM appellations WHERE County = 'Sonoma')
2791
 SELECT T2.Party FROM election AS T1 JOIN party AS T2 ON T1.Party  =  T2.Party_ID GROUP BY T1.Party ORDER BY COUNT(*) DESC LIMIT 1

SELECT Party, COUNT(*) AS Num_Delegates FROM election JOIN party ON election.Party = party.Party_ID GROUP BY Party ORDER BY Num_Delegates DESC LIMIT 1
2697
 SELECT region_name FROM region WHERE region_name != 'Denmark'

InvalidRequestError: too many tokens
3889
 SELECT count(*) FROM Settlements

SELECT COUNT(*) FROM Settlements
680
 SELECT customer_id ,  count(*) FROM Accounts GROUP BY customer_id ORDER BY count(*) DESC LIMIT 1

SELECT T1.customer_id, COUNT(T2.account_id) FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id ORDER BY COUNT(T2.account_id) DESC LIMIT 1
6561
 SELECT DISTINCT Name FROM WINE ORDER BY price

InvalidRequestError: too many tokens
6676
 SELECT count(*) FROM Lessons AS T1 JOIN Customers AS T2 ON T1.customer_id  = T2.customer_id WHERE T2.first_name = "Rylan" AND T2.last_name = "Goodwin" AND T1.lesson_status_code = "Completed";

SELECT count(*) FROM Lessons WHERE customer_id IN (SELECT customer_id FROM Customers WHERE first_name = 'Rylan' AND last_name = 'Goodwin') AND lesson_status_code = 'Completed'
3732
 SELECT OWNER FROM channel ORDER BY rating_in_percent DESC LIMIT 1

SELECT Owner FROM channel WHERE Rating_in_percent = (SELECT MAX(Rating_in_percent) FROM channel)
4975
 SELECT cName ,  enr FROM College WHERE enr  >  10000 AND state = "LA"

SELECT cName, enr FROM College WHERE enr > 10000 AND state = 'LA';
5289
 SELECT founder FROM manufacturers WHERE name LIKE 'S%'

SELECT Founder FROM Manufacturers WHERE Name LIKE 'S%'
2197
 SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  >  (SELECT min(duration) FROM pitstops WHERE raceid  =  841)

SELECT DISTINCT T1.driverId FROM pitStops AS T1 JOIN pitStops AS T2 ON T1.raceId  =  T2.raceId WHERE T1.duration > T2.duration AND T2.raceId  =  841
5688
 SELECT avg(student_capacity) ,  sum(student_capacity) FROM dorm WHERE gender  =  'X'

SELECT AVG(student_capacity), SUM(student_capacity) FROM Dorm WHERE gender = 'X'
113
 SELECT city ,  max(lat) FROM station GROUP BY city

SELECT city, MAX(lat) FROM station GROUP BY city
6035
 SELECT StuID FROM Student EXCEPT SELECT StuID FROM Plays_games

SELECT StuID FROM Student WHERE StuID NOT IN (SELECT StuID FROM Plays_Games)
3131
 SELECT T1.engineer_id ,  T1.first_name ,  T1.last_name FROM Maintenance_Engineers AS T1 JOIN Engineer_Visits AS T2 GROUP BY T1.engineer_id ORDER BY count(*) DESC LIMIT 1

SELECT e.engineer_id, e.first_name, e.last_name
FROM Maintenance_Engineers e
INNER JOIN Engineer_Visits v ON e.engineer_id = v.engineer_id
GROUP BY e.engineer_id
ORDER BY COUNT(*) DESC
LIMIT 1;
4146
 SELECT Title FROM film WHERE Film_ID NOT IN (SELECT Film_ID FROM film_market_estimation)

SELECT Title FROM film WHERE Film_ID NOT IN (SELECT Film_ID FROM film_market_estimation)
2979
 SELECT T2.name FROM film AS T1 JOIN LANGUAGE AS T2 ON T1.language_id  =  T2.language_id WHERE T1.title  =  'AIRPORT POLLOCK'

InvalidRequestError: too many tokens
4828
 SELECT Name FROM pilot ORDER BY Age DESC

InvalidRequestError: too many tokens
4552
 SELECT avg(Profits_billion) FROM Companies

SELECT AVG(t2.profits_billion) FROM Office_locations AS t1 JOIN Companies AS t2 ON t1.company_id  =  t2.id
3263
 SELECT emp_fname ,  emp_lname FROM employee ORDER BY emp_dob LIMIT 1

SELECT EMP_FNAME, EMP_LNAME FROM EMPLOYEE WHERE EMP_HIREDATE = (SELECT MIN(EMP_HIREDATE) FROM EMPLOYEE)
1811
 SELECT T3.balance FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid JOIN savings AS T3 ON T1.custid  =  T3.custid ORDER BY T2.balance DESC LIMIT 1

SELECT S.balance FROM SAVINGS S JOIN CHECKING C ON S.custid = C.custid WHERE C.balance = (SELECT MAX(balance) FROM CHECKING)
471
 SELECT StuID FROM Student WHERE Sex  =  'M'

SELECT StuID FROM Student WHERE Sex = 'M'
3186
 SELECT crs_credit ,  crs_description FROM course WHERE crs_code  =  'CIS-220'

SELECT CRS_DESCRIPTION, CRS_CREDIT FROM COURSE WHERE CRS_CODE = 'CIS-220';
3038
 SELECT cust_name FROM customer EXCEPT SELECT cust_name FROM customer WHERE acc_type  =  'saving'

InvalidRequestError: too many tokens
6022
 SELECT StuID FROM Student EXCEPT SELECT StuID FROM Sportsinfo

SELECT StuID FROM Student WHERE StuID NOT IN (SELECT StuID FROM SportsInfo)
2540
 SELECT Crime_rate FROM county_public_safety ORDER BY Police_officers ASC

SELECT Name, Crime_rate FROM county_public_safety ORDER BY Police_officers ASC
4017
 SELECT TYPE ,  avg(Tonnage) FROM ship GROUP BY TYPE

SELECT T2.Type, AVG(T2.Tonnage) FROM mission AS T1 JOIN ship AS T2 ON T1.Ship_ID  =  T2.Ship_ID GROUP BY T2.Type
913
 SELECT DISTINCT t3.policy_type_code FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id JOIN available_policies AS t3 ON t2.policy_id  =  t3.policy_id WHERE t1.customer_name  =  (SELECT t1.customer_name FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id GROUP BY t1.customer_name ORDER BY count(*) DESC LIMIT 1)

SELECT policy_type_code FROM Available_Policies WHERE Customer_Phone IN (SELECT Customer_Phone FROM Available_Policies GROUP BY Customer_Phone ORDER BY COUNT(*) DESC LIMIT 1)
6159
 SELECT Song FROM volume WHERE Weeks_on_Top  >  1

SELECT Song FROM volume WHERE Weeks_on_Top > 1
1103
 SELECT College FROM match_season GROUP BY College HAVING count(*)  >=  2 ORDER BY College DESC

SELECT college FROM match_season GROUP BY college HAVING COUNT(*)  >=  2 ORDER BY college DESC
4381
 SELECT T1.outcome_description FROM Research_outcomes AS T1 JOIN Project_outcomes AS T2 ON T1.outcome_code  =  T2.outcome_code JOIN Projects AS T3 ON T2.project_id  =  T3.project_id WHERE T3.project_details  =  'sint'

SELECT outcome_description FROM Research_Outcomes JOIN Projects ON Projects.project_id = Research_Outcomes.project_id WHERE Projects.project_details = 'sint'
3979
 SELECT T3.name FROM physician AS T1 JOIN trained_in AS T2 ON T1.employeeid  =  T2.physician JOIN procedures AS T3 ON T3.code  =  T2.treatment WHERE T1.name  =  "John Wen"

InvalidRequestError: too many tokens
6162
 SELECT Song FROM volume ORDER BY Song

SELECT T1.song FROM Volume AS T1 ORDER BY T1.song ASC
4944
 SELECT sum(enr) FROM College

InvalidRequestError: too many tokens
6936
 SELECT DISTINCT invoice_details FROM invoices WHERE invoice_date < "1989-09-03" OR invoice_date > "2007-12-25"

SELECT DISTINCT invoice_details FROM Invoices WHERE invoice_date < '1989-09-03' OR invoice_date > '2007-12-25'
3924
 SELECT patient FROM stay WHERE room  =  111 ORDER BY staystart DESC LIMIT 1

SELECT T1.Patient FROM Stay AS T1 JOIN Room AS T2 ON T1.Room  =  T2.RoomNumber WHERE T2.RoomNumber  =  111 ORDER BY T1.StayEnd DESC LIMIT 1
4885
 SELECT T1.Location ,  T2.Nickname FROM school AS T1 JOIN school_details AS T2 ON T1.School_ID  =  T2.School_ID

InvalidRequestError: too many tokens
2080
 SELECT event_name FROM party_events GROUP BY event_name HAVING count(*)  >  2

SELECT Event_Name FROM party_events
GROUP BY Event_Name
HAVING COUNT(Event_Name) > 2;
3157
 SELECT local_authority ,  services FROM station

SELECT network_name, services, local_authority FROM station
4821
 SELECT T2.Location ,  T1.Aircraft FROM aircraft AS T1 JOIN MATCH AS T2 ON T1.Aircraft_ID  =  T2.Winning_Aircraft

InvalidRequestError: too many tokens
446
 SELECT allergy ,  allergytype FROM Allergy_type

SELECT Allergy, AllergyType FROM Allergy_Type
1851
 SELECT DISTINCT Reign FROM wrestler WHERE LOCATION != "Tokyo , Japan"

SELECT DISTINCT Reign FROM wrestler WHERE Location != 'Tokyo, Japan'
1924
 SELECT DISTINCT TYPE FROM institution

SELECT DISTINCT Type FROM Institution;
4569
 SELECT Industry ,  COUNT(*) FROM Companies GROUP BY Industry

SELECT Industry, COUNT(*) FROM Companies GROUP BY Industry;
475
 SELECT StuID FROM Student WHERE age  >  20

InvalidRequestError: too many tokens
508
 SELECT StuID FROM Student EXCEPT SELECT StuID FROM Has_allergy

InvalidRequestError: too many tokens
2485
 SELECT DISTINCT title FROM Movie EXCEPT SELECT T2.title FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID WHERE T3.name  =  'Chris Jackson'

SELECT title FROM Movie WHERE mID NOT IN (SELECT mID FROM Rating INNER JOIN Reviewer ON Rating.rID = Reviewer.rID WHERE name = 'Chris Jackson')
1493
 SELECT Venue FROM debate ORDER BY Num_of_Audience ASC

SELECT Venue FROM debate ORDER BY Num_of_Audience ASC
849
 SELECT T2.FirstName ,  T2.LastName FROM CUSTOMER AS T1 JOIN EMPLOYEE AS T2 ON T1.SupportRepId  =  T2.EmployeeId WHERE T1.FirstName  =  "Leonie"

InvalidRequestError: too many tokens
1553
 SELECT T1.account_id ,  T1.date_account_opened ,  T1.account_name ,  T1.other_account_details FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.customer_first_name  =  'Meaghan'

SELECT account_id, account_name, other_account_details FROM Accounts INNER JOIN Customers ON Accounts.customer_id = Customers.customer_id WHERE customer_first_name = 'Meaghan'
103
 SELECT * FROM student_course_registrations WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)

SELECT T1.student_details FROM Students AS T1 LEFT JOIN Student_Course_Attendance AS T2 ON T1.student_id = T2.student_id LEFT JOIN Student_Course_Registrations AS T3 ON T1.student_id = T3.student_id WHERE T2.student_id IS NULL AND T3.student_id IS NOT NULL
4952
 SELECT count(*) FROM College WHERE enr  >  15000

SELECT COUNT(*) FROM College WHERE enr > 15000

In [9]:
tmp['model_response']

4447    SELECT name FROM Person WHERE age > 40 AND NOT...
6700                                                 None
1395    SELECT building, MAX(capacity) as max_capacity...
1650                          SELECT COUNT(*) FROM artist
4922    SELECT Headquartered_City, COUNT(Store_ID) AS ...
                              ...
1493    SELECT Venue FROM debate ORDER BY Num_of_Audie...
849                                                  None
1553    SELECT account_id, account_name, other_account...
103     SELECT T1.student_details FROM Students AS T1 ...
4952       SELECT COUNT(*) FROM College WHERE enr > 15000
Name: model_response, Length: 100, dtype: object

In [12]:
len(tmp[tmp['model_response'].isna()])

20

In [62]:
df_rand['open_ai_execution'] = df_rand.apply(lambda x: execution(x, 'open_ai_completion'), axis=1)
df_rand['model_response_execution'] = df_rand.apply(lambda x: execution(x, 'model_response'), axis=1)
df_rand['execution_accuracy'] = np.where(df_rand['open_ai_execution'] == df_rand['model_response_execution'], 1, 0)
df_rand[~df_rand['model_response'].isna()]['execution_accuracy'].mean()

0.5625

In [11]:
i = 0
print(tmp[~tmp['model_response'].isna()].iloc[i]['open_ai_prompt'])
print(tmp[~tmp['model_response'].isna()].iloc[i]['open_ai_completion'])
print(tmp[~tmp['model_response'].isna()].iloc[i]['model_response'])

Convert text to SQL.

DDL:
```
create table Student (        StuID        INTEGER PRIMARY KEY,        LName        VARCHAR(12),        Fname        VARCHAR(12),        Age      INTEGER,        Sex      VARCHAR(1),        Major        INTEGER,        Advisor      INTEGER,        city_code    VARCHAR(3) );create table Video_Games (       GameID           INTEGER PRIMARY KEY,       GName            VARCHAR(40),       GType            VARCHAR(40));create table Plays_Games (       StuID                INTEGER,       GameID            INTEGER,       Hours_Played      INTEGER,       FOREIGN KEY(GameID);create table SportsInfo (  StuID INTEGER,  SportName VARCHAR(32),  HoursPerWeek INTEGER,  GamesPlayed INTEGER,  OnScholarship VARCHAR(1),  FOREIGN KEY(StuID);
```
Question:
"""What are the names of all video games that are collectible cards?"""
Answer:
SELECT gname FROM Video_games WHERE gtype  =  "Collectible card game"

DDL:
CREATE TABLE "film" ("Film_ID" int,"Rank_in_series" int,"Number_in_season" int,"Title" text,"Directed_by" text,"Original_air_date" text,"Production_code" text,PRIMARY KEY ("Film_ID"));CREATE TABLE "cinema" ("Cinema_ID" int,"Name" text,"Openning_year" int,"Capacity" int,"Location" text,PRIMARY KEY ("Cinema_ID"));CREATE TABLE "schedule" ("Cinema_ID" int,"Film_ID" int,"Date" text,"Show_times_per_day" int,"Price" float,PRIMARY KEY ("Cinema_ID","Film_ID"),FOREIGN KEY (`Film_ID`);
Question:
"""List all directors along with the number of films directed by each director."""
Answer:
SELECT directed_by ,  count(*) FROM film GROUP BY directed_by

DDL:
```
CREATE TABLE Person (  name varchar(20) PRIMARY KEY,  age INTEGER,  city TEXT,  gender TEXT,  job TEXT);CREATE TABLE PersonFriend (  name varchar(20),  friend varchar(20),  year INTEGER,  FOREIGN KEY (name);
```
Question:
"""What are the names of the people who are older 40 but no friends under age 30?"""
Answer:

 SELECT T1.name FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend IN (SELECT name FROM Person WHERE age  >  40) EXCEPT SELECT T1.name FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend IN (SELECT name FROM Person WHERE age  <  30)

SELECT name FROM Person WHERE age > 40 AND NOT EXISTS (SELECT * FROM PersonFriend WHERE name = Person.name AND friend < 30)

In [13]:
df_rand = tmp.copy()

In [69]:
df_rand[~df_rand['model_response'].isna()]['model_response']

4447    SELECT name FROM Person WHERE age > 40 AND NOT...
1395    SELECT building, MAX(capacity) as max_capacity...
1650                          SELECT COUNT(*) FROM artist
4922    SELECT Headquartered_City, COUNT(Store_ID) AS ...
1156    SELECT Name FROM people INNER JOIN body_builde...
                              ...
2485    SELECT title FROM Movie WHERE mID NOT IN (SELE...
1493    SELECT Venue FROM debate ORDER BY Num_of_Audie...
1553    SELECT account_id, account_name, other_account...
103     SELECT T1.student_details FROM Students AS T1 ...
4952       SELECT COUNT(*) FROM College WHERE enr > 15000
Name: model_response, Length: 80, dtype: object

# Examples from the same db
70% accuracy (69/98 - 2 had too many tokens) (max_tokens = 2000 and best_of=3)  
70% accuracy (70/100) (max_tokens = 1000 and best_of=1)  
With 2 examples, 2 out of 100 prompts have too many tokens

In [351]:
def get_db_examples(x, df):
    db_id = x['db_id']
    tmp = df[df['db_id'] == db_id].copy()
    # Remove the row x from the dataframe tmp
    tmp = tmp[~tmp.index.isin([x.index])]
    
    if len(tmp) < 2:
        print('not enough examples in db')
        return None
    
    # x = {}
    n_examples = 2
    examples = np.random.randint(0,len(tmp),n_examples)
    for i in range(n_examples):
        row_ex = tmp.iloc[examples[i]]
        x['question-' + str(i+1)]   = row_ex['question']
        x['completion-' + str(i+1)] = row_ex['query']

    return x[['question-1', 'completion-1', 'question-2', 'completion-2']]

def same_db_prompt(x):
    return dedent(f'''
        Convert text to SQL.
        
        DDL:
        ```
        {x['schema']}
        ```
        Question:
        """{x['question-1']}"""
        Answer:
        {x['completion-1']}

        Question:
        """{x['question-2']}"""
        Answer:
        {x['completion-2']}
        
        Question:
        """{x['question']}"""
        Answer:
        ''')

In [354]:
df = pd.read_json('spider/train_spider.json')

# Set schema
df['schema'] = df.apply(lambda x: get_schema(x['db_id']), axis=1)
# df['schema'] = df['schema'].apply(lambda x: re.sub('(?i) REFERENCES.*?(;|$)', ';', x)) 
df['schema'] = df['schema'].apply(lambda x: re.sub(r'\s+references\s+.*?[,;)]', '', x)) 
df['schema'] = df['schema'].apply(lambda x: re.sub('NOT NULL', '', x))
df['schema'] = df['schema'].apply(lambda x: re.sub(r',\s*(PRIMARY KEY|FOREIGN KEY).*?(;|$)', ');', x, 
                                                   flags=re.IGNORECASE))
df['schema'] = df['schema'].apply(lambda x: x.replace('`', '"'))
df['schema'] = df['schema'].apply(lambda x: re.sub(r'"(\w+)"', r'\1', x))
df['schema'] = df['schema'].apply(lambda x: x.replace('AUTOINCREMENT', ''))
df['schema'] = df['schema'].apply(lambda x: x.replace('UNSIGNED', ''))
df['schema'] = df['schema'].apply(lambda x: x.replace(' BIT', ' BOOLEAN'))
df['schema'] = df['schema'].apply(lambda x: x.replace('YEAR DEFAULT NULL', 'SMALLINT'))
df['schema'] = df['schema'].apply(lambda x: x.replace('MEDIUMINT', 'SMALLINT'))
df['schema'] = df['schema'].apply(lambda x: x.replace('character varchar', 'varchar'))
df['schema'] = df['schema'].apply(lambda x: re.sub(r'PRIMARY KEY,', ',', x))

# Select the examples to show the model
df[['question-1', 'completion-1', 'question-2', 'completion-2']] =\
    df.apply(lambda x: get_db_examples(x, df), axis=1)
df['open_ai_prompt'] = df.apply(lambda x: same_db_prompt(x), axis=1)
df['open_ai_completion'] = df.apply(lambda x: open_ai_completion(x), axis=1)

In [355]:
# check all the DDLs are valid SQL
for i in range(df.shape[0]):
    print(i)
    sqlglot.transpile(df.iloc[i]['schema'], read='sqlite')

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
141
142
143
144
145
146
147
148
149
150
151
152
153
154
155
156
157
158
159
160
161
162
163
164
165
166
167
168
169
170
171
172
173
174
175
176
177
178
179
180
181
182
183
184
185
186
187
188
189
190
191
192
193
194
195
196
197
198
199
200
201
202
203
204
205
206
207
208
209
210
211
212
213
214
215
216
217
218
219
220
221
222
223
224
225
226
227
228
229
230
231
232
233
234
235
236
237
238
239
240
241
242
243
244
245
246
247
248
249
250
251
252
253
254
255
256
257
258
259
260
261
262
263
264
265
266
267
268
269
270
271
272
273
274
275
276
277
278
279
280
281
282
283
284
285
286
287
288
289
290
291
292
293
294
295
296
297
298
299
300
301
302
303
304
305
306
307
308
309
310
311
312
313
314
315
316
317
318
319
320
321
322
323
324
325
326
327
328
329
330
331
332
333
334
335
336
337
338
339
340
341
342
343
344
345
346
347
348
349
350
351
352
353
354
355
356
357
358
359
360
361
362
363
364
365
366
367
368
369
370
371
372
373
374
375
376
377
378
379
380
381
382
383
384
385
386
387
388
389
390
391
392
393
394
395
396
397
398
399
400
401
402
403
404
405
406
407
408
409
410
411
412
413
414
415
416
417
418
419
420
421
422
423
424
425
426
427
428
429
430
431
432
433
434
435
436
437
438
439
440
441
442
443
444
445
446
447
448
449
450
451
452
453
454
455
456
457
458
459
460
461
462
463
464
465
466
467
468
469
470
471
472
473
474
475
476
477
478
479
480
481
482
483
484
485
486
487
488
489
490
491
492
493
494
495
496
497
498
499
500
501
502
503
504
505
506
507
508
509
510
511
512
513
514
515
516
517
518
519
520
521
522
523
524
525
526
527
528
529
530
531
532
533
534
535
536
537
538
539
540
541
542
543
544
545
546
547
548
549
550
551
552
553
554
555
556
557
558
559
560
561
562
563
564
565
566
567
568
569
570
571
572
573
574
575
576
577
578
579
580
581
582
583
584
585
586
587
588
589
590
591
592
593
594
595
596
597
598
599
600
601
602
603
604
605
606
607
608
609
610
611
612
613
614
615
616
617
618
619
620
621
622
623
624
625
626
627
628
629
630
631
632
633
634
635
636
637
638
639
640
641
642
643
644
645
646
647
648
649
650
651
652
653
654
655
656
657
658
659
660
661
662
663
664
665
666
667
668
669
670
671
672
673
674
675
676
677
678
679
680
681
682
683
684
685
686
687
688
689
690
691
692
693
694
695
696
697
698
699
700
701
702
703
704
705
706
707
708
709
710
711
712
713
714
715
716
717
718
719
720
721
722
723
724
725
726
727
728
729
730
731
732
733
734
735
736
737
738
739
740
741
742
743
744
745
746
747
748
749
750
751
752
753
754
755
756
757
758
759
760
761
762
763
764
765
766
767
768
769
770
771
772
773
774
775
776
777
778
779
780
781
782
783
784
785
786
787
788
789
790
791
792
793
794
795
796
797
798
799
800
801
802
803
804
805
806
807
808
809
810
811
812
813
814
815
816
817
818
819
820
821
822
823
824
825
826
827
828
829
830
831
832
833
834
835
836
837
838
839
840
841
842
843
844
845
846
847
848
849
850
851
852
853
854
855
856
857
858
859
860
861
862
863
864
865
866
867
868
869
870
871
872
873
874
875
876
877
878
879
880
881
882
883
884
885
886
887
888
889
890
891
892
893
894
895
896
897
898
899
900
901
902
903
904
905
906
907
908
909
910
911
912
913
914
915
916
917
918
919
920
921
922
923
924
925
926
927
928
929
930
931
932
933
934
935
936
937
938
939
940
941
942
943
944
945
946
947
948
949
950
951
952
953
954
955
956
957
958
959
960
961
962
963
964
965
966
967
968
969
970
971
972
973
974
975
976
977
978
979
980
981
982
983
984
985
986
987
988
989
990
991
992
993
994
995
996
997
998
999
1000
1001
1002
1003
1004
1005
1006
1007
1008
1009
1010
1011
1012
1013
1014
1015
1016
1017
1018
1019
1020
1021
1022
1023
1024
1025
1026
1027
1028
1029
1030
1031
1032
1033
1034
1035
1036
1037
1038
1039
1040
1041
1042
1043
1044
1045
1046
1047
1048
1049
1050
1051
1052
1053
1054
1055
1056
1057
1058
1059
1060
1061
1062
1063
1064
1065
1066
1067
1068
1069
1070
1071
1072
1073
1074
1075
1076
1077
1078
1079
1080
1081
1082
1083
1084
1085
1086
1087
1088
1089
1090
1091
1092
1093
1094
1095
1096
1097
1098
1099
1100
1101
1102
1103
1104
1105
1106
1107
1108
1109
1110
1111
1112
1113
1114
1115
1116
1117
1118
1119
1120
1121
1122
1123
1124
1125
1126
1127
1128
1129
1130
1131
1132
1133
1134
1135
1136
1137
1138
1139
1140
1141
1142
1143
1144
1145
1146
1147
1148
1149
1150
1151
1152
1153
1154
1155
1156
1157
1158
1159
1160
1161
1162
1163
1164
1165
1166
1167
1168
1169
1170
1171
1172
1173
1174
1175
1176
1177
1178
1179
1180
1181
1182
1183
1184
1185
1186
1187
1188
1189
1190
1191
1192
1193
1194
1195
1196
1197
1198
1199
1200
1201
1202
1203
1204
1205
1206
1207
1208
1209
1210
1211
1212
1213
1214
1215
1216
1217
1218
1219
1220
1221
1222
1223
1224
1225
1226
1227
1228
1229
1230
1231
1232
1233
1234
1235
1236
1237
1238
1239
1240
1241
1242
1243
1244
1245
1246
1247
1248
1249
1250
1251
1252
1253
1254
1255
1256
1257
1258
1259
1260
1261
1262
1263
1264
1265
1266
1267
1268
1269
1270
1271
1272
1273
1274
1275
1276
1277
1278
1279
1280
1281
1282
1283
1284
1285
1286
1287
1288
1289
1290
1291
1292
1293
1294
1295
1296
1297
1298
1299
1300
1301
1302
1303
1304
1305
1306
1307
1308
1309
1310
1311
1312
1313
1314
1315
1316
1317
1318
1319
1320
1321
1322
1323
1324
1325
1326
1327
1328
1329
1330
1331
1332
1333
1334
1335
1336
1337
1338
1339
1340
1341
1342
1343
1344
1345
1346
1347
1348
1349
1350
1351
1352
1353
1354
1355
1356
1357
1358
1359
1360
1361
1362
1363
1364
1365
1366
1367
1368
1369
1370
1371
1372
1373
1374
1375
1376
1377
1378
1379
1380
1381
1382
1383
1384
1385
1386
1387
1388
1389
1390
1391
1392
1393
1394
1395
1396
1397
1398
1399
1400
1401
1402
1403
1404
1405
1406
1407
1408
1409
1410
1411
1412
1413
1414
1415
1416
1417
1418
1419
1420
1421
1422
1423
1424
1425
1426
1427
1428
1429
1430
1431
1432
1433
1434
1435
1436
1437
1438
1439
1440
1441
1442
1443
1444
1445
1446
1447
1448
1449
1450
1451
1452
1453
1454
1455
1456
1457
1458
1459
1460
1461
1462
1463
1464
1465
1466
1467
1468
1469
1470
1471
1472
1473
1474
1475
1476
1477
1478
1479
1480
1481
1482
1483
1484
1485
1486
1487
1488
1489
1490
1491
1492
1493
1494
1495
1496
1497
1498
1499
1500
1501
1502
1503
1504
1505
1506
1507
1508
1509
1510
1511
1512
1513
1514
1515
1516
1517
1518
1519
1520
1521
1522
1523
1524
1525
1526
1527
1528
1529
1530
1531
1532
1533
1534
1535
1536
1537
1538
1539
1540
1541
1542
1543
1544
1545
1546
1547
1548
1549
1550
1551
1552
1553
1554
1555
1556
1557
1558
1559
1560
1561
1562
1563
1564
1565
1566
1567
1568
1569
1570
1571
1572
1573
1574
1575
1576
1577
1578
1579
1580
1581
1582
1583
1584
1585
1586
1587
1588
1589
1590
1591
1592
1593
1594
1595
1596
1597
1598
1599
1600
1601
1602
1603
1604
1605
1606
1607
1608
1609
1610
1611
1612
1613
1614
1615
1616
1617
1618
1619
1620
1621
1622
1623
1624
1625
1626
1627
1628
1629
1630
1631
1632
1633
1634
1635
1636
1637
1638
1639
1640
1641
1642
1643
1644
1645
1646
1647
1648
1649
1650
1651
1652
1653
1654
1655
1656
1657
1658
1659
1660
1661
1662
1663
1664
1665
1666
1667
1668
1669
1670
1671
1672
1673
1674
1675
1676
1677
1678
1679
1680
1681
1682
1683
1684
1685
1686
1687
1688
1689
1690
1691
1692
1693
1694
1695
1696
1697
1698
1699
1700
1701
1702
1703
1704
1705
1706
1707
1708
1709
1710
1711
1712
1713
1714
1715
1716
1717
1718
1719
1720
1721
1722
1723
1724
1725
1726
1727
1728
1729
1730
1731
1732
1733
1734
1735
1736
1737
1738
1739
1740
1741
1742
1743
1744
1745
1746
1747
1748
1749
1750
1751
1752
1753
1754
1755
1756
1757
1758
1759
1760
1761
1762
1763
1764
1765
1766
1767
1768
1769
1770
1771
1772
1773
1774
1775
1776
1777
1778
1779
1780
1781
1782
1783
1784
1785
1786
1787
1788
1789
1790
1791
1792
1793
1794
1795
1796
1797
1798
1799
1800
1801
1802
1803
1804
1805
1806
1807
1808
1809
1810
1811
1812
1813
1814
1815
1816
1817
1818
1819
1820
1821
1822
1823
1824
1825
1826
1827
1828
1829
1830
1831
1832
1833
1834
1835
1836
1837
1838
1839
1840
1841
1842
1843
1844
1845
1846
1847
1848
1849
1850
1851
1852
1853
1854
1855
1856
1857
1858
1859
1860
1861
1862
1863
1864
1865
1866
1867
1868
1869
1870
1871
1872
1873
1874
1875
1876
1877
1878
1879
1880
1881
1882
1883
1884
1885
1886
1887
1888
1889
1890
1891
1892
1893
1894
1895
1896
1897
1898
1899
1900
1901
1902
1903
1904
1905
1906
1907
1908
1909
1910
1911
1912
1913
1914
1915
1916
1917
1918
1919
1920
1921
1922
1923
1924
1925
1926
1927
1928
1929
1930
1931
1932
1933
1934
1935
1936
1937
1938
1939
1940
1941
1942
1943
1944
1945
1946
1947
1948
1949
1950
1951
1952
1953
1954
1955
1956
1957
1958
1959
1960
1961
1962
1963
1964
1965
1966
1967
1968
1969
1970
1971
1972
1973
1974
1975
1976
1977
1978
1979
1980
1981
1982
1983
1984
1985
1986
1987
1988
1989
1990
1991
1992
1993
1994
1995
1996
1997
1998
1999
2000
2001
2002
2003
2004
2005
2006
2007
2008
2009
2010
2011
2012
2013
2014
2015
2016
2017
2018
2019
2020
2021
2022
2023
2024
2025
2026
2027
2028
2029
2030
2031
2032
2033
2034
2035
2036
2037
2038

2039
2040
2041
2042
2043
2044
2045
2046
2047
2048
2049
2050
2051
2052
2053
2054
2055
2056
2057
2058
2059
2060
2061
2062
2063
2064
2065
2066
2067
2068
2069
2070
2071
2072
2073
2074
2075
2076
2077
2078
2079
2080
2081
2082
2083
2084
2085
2086
2087
2088
2089
2090
2091
2092
2093
2094
2095
2096
2097
2098
2099
2100
2101
2102
2103
2104
2105
2106
2107
2108
2109
2110
2111
2112
2113
2114
2115
2116
2117
2118
2119
2120
2121
2122
2123
2124
2125
2126
2127
2128
2129
2130
2131
2132
2133
2134
2135
2136
2137
2138
2139
2140
2141
2142
2143
2144
2145
2146
2147
2148
2149
2150
2151
2152
2153
2154
2155
2156
2157
2158
2159
2160
2161
2162
2163
2164
2165
2166
2167
2168
2169
2170
2171
2172
2173
2174
2175
2176
2177
2178
2179
2180
2181
2182
2183
2184
2185
2186
2187
2188
2189
2190
2191
2192
2193
2194
2195
2196
2197
2198
2199
2200
2201
2202
2203
2204
2205
2206
2207
2208
2209
2210
2211
2212
2213
2214
2215
2216
2217
2218
2219
2220
2221
2222
2223
2224
2225
2226
2227
2228
2229
2230
2231
2232
2233
2234
2235
2236
2237
2238
2239
2240
2241
2242
2243
2244
2245
2246
2247
2248
2249
2250
2251
2252
2253
2254
2255
2256
2257
2258
2259
2260
2261
2262
2263
2264
2265
2266
2267
2268
2269
2270
2271
2272
2273
2274
2275
2276
2277
2278
2279
2280
2281
2282
2283
2284
2285
2286
2287
2288
2289
2290
2291
2292
2293
2294
2295
2296
2297
2298
2299
2300
2301
2302
2303
2304
2305
2306
2307
2308
2309
2310
2311
2312
2313
2314
2315
2316
2317
2318
2319
2320
2321
2322
2323
2324
2325
2326
2327
2328
2329
2330
2331
2332
2333
2334
2335
2336
2337
2338
2339
2340
2341
2342
2343
2344
2345
2346
2347
2348
2349
2350
2351
2352
2353
2354
2355
2356
2357
2358
2359
2360
2361
2362
2363
2364
2365
2366
2367
2368
2369
2370
2371
2372
2373
2374
2375
2376
2377
2378
2379
2380
2381
2382
2383
2384
2385
2386
2387
2388
2389
2390
2391
2392
2393
2394
2395
2396
2397
2398
2399
2400
2401
2402
2403
2404
2405
2406
2407
2408
2409
2410
2411
2412
2413
2414
2415
2416
2417
2418
2419
2420
2421
2422
2423
2424
2425
2426
2427
2428
2429
2430
2431
2432
2433
2434
2435
2436
2437
2438
2439
2440
2441
2442
2443
2444
2445
2446
2447
2448
2449
2450
2451
2452
2453
2454
2455
2456
2457
2458
2459
2460
2461
2462
2463
2464
2465
2466
2467
2468
2469
2470
2471
2472
2473
2474
2475
2476
2477
2478
2479
2480
2481
2482
2483
2484
2485
2486
2487
2488
2489
2490
2491
2492
2493
2494
2495
2496
2497
2498
2499
2500
2501
2502
2503
2504
2505
2506
2507
2508
2509
2510
2511
2512
2513
2514
2515
2516
2517
2518
2519
2520
2521
2522
2523
2524
2525
2526
2527
2528
2529
2530
2531
2532
2533
2534
2535
2536
2537
2538
2539
2540
2541
2542
2543
2544
2545
2546
2547
2548
2549
2550
2551
2552
2553
2554
2555
2556
2557
2558
2559
2560
2561
2562
2563
2564
2565
2566
2567
2568
2569
2570
2571
2572
2573
2574
2575
2576
2577
2578
2579
2580
2581
2582
2583
2584
2585
2586
2587
2588
2589
2590
2591
2592
2593
2594
2595
2596
2597
2598
2599
2600
2601
2602
2603
2604
2605
2606
2607
2608
2609
2610
2611
2612
2613
2614
2615
2616
2617
2618
2619
2620
2621
2622
2623
2624
2625
2626
2627
2628
2629
2630
2631
2632
2633
2634
2635
2636
2637
2638
2639
2640
2641
2642
2643
2644
2645
2646
2647
2648
2649
2650
2651
2652
2653
2654
2655
2656
2657
2658
2659
2660
2661
2662
2663
2664
2665
2666
2667
2668
2669
2670
2671
2672
2673
2674
2675
2676
2677
2678
2679
2680
2681
2682
2683
2684
2685
2686
2687
2688
2689
2690
2691
2692
2693
2694
2695
2696
2697
2698
2699
2700
2701
2702
2703
2704
2705
2706
2707
2708
2709
2710
2711
2712
2713
2714
2715
2716
2717
2718
2719
2720
2721
2722
2723
2724
2725
2726
2727
2728
2729
2730
2731
2732
2733
2734
2735
2736
2737
2738
2739
2740
2741
2742
2743
2744
2745
2746
2747
2748
2749
2750
2751
2752
2753
2754
2755
2756
2757
2758
2759
2760
2761
2762
2763
2764
2765
2766
2767
2768
2769
2770
2771
2772
2773
2774
2775
2776
2777
2778
2779
2780
2781
2782
2783
2784
2785
2786
2787
2788
2789
2790
2791
2792
2793
2794
2795
2796
2797
2798
2799
2800
2801
2802
2803
2804
2805
2806
2807
2808
2809
2810
2811
2812
2813
2814
2815
2816
2817
2818
2819
2820
2821
2822
2823
2824
2825
2826
2827
2828
2829
2830
2831
2832
2833
2834
2835
2836
2837
2838
2839
2840
2841
2842
2843
2844
2845
2846
2847
2848
2849
2850
2851
2852
2853
2854
2855
2856
2857
2858
2859
2860
2861
2862
2863
2864
2865
2866
2867
2868
2869
2870
2871
2872
2873
2874
2875
2876
2877
2878
2879
2880
2881
2882
2883
2884
2885
2886
2887
2888
2889
2890
2891
2892
2893
2894
2895
2896
2897
2898
2899
2900
2901
2902
2903
2904
2905
2906
2907
2908
2909
2910
2911
2912
2913
2914
2915
2916
2917
2918
2919
2920
2921
2922
2923
2924
2925
2926
2927
2928
2929
2930
2931
2932
2933
2934
2935
2936
2937
2938
2939
2940
2941
2942
2943
2944
2945
2946
2947
2948
2949
2950
2951
2952
2953
2954
2955
2956
2957
2958
2959
2960
2961
2962
2963
2964
2965
2966
2967
2968
2969
2970
2971
2972
2973
2974
2975
2976
2977
2978
2979
2980
2981
2982
2983
2984
2985
2986
2987
2988
2989
2990
2991
2992
2993
2994
2995
2996
2997
2998
2999
3000
3001
3002
3003
3004
3005
3006
3007
3008
3009
3010
3011
3012
3013
3014
3015
3016
3017
3018
3019
3020
3021
3022
3023
3024
3025
3026
3027
3028
3029
3030
3031
3032
3033
3034
3035
3036
3037
3038
3039
3040
3041
3042
3043
3044
3045
3046
3047
3048
3049
3050
3051
3052
3053
3054
3055
3056
3057
3058
3059
3060
3061
3062
3063
3064
3065
3066
3067
3068
3069
3070
3071
3072
3073
3074
3075
3076
3077
3078
3079
3080
3081
3082
3083
3084
3085
3086
3087
3088
3089
3090
3091
3092
3093
3094
3095
3096
3097
3098
3099
3100
3101
3102
3103
3104
3105
3106
3107
3108
3109
3110
3111
3112
3113
3114
3115
3116
3117
3118
3119
3120
3121
3122
3123
3124
3125
3126
3127
3128
3129
3130
3131
3132
3133
3134
3135
3136
3137
3138
3139
3140
3141
3142
3143
3144
3145
3146
3147
3148
3149
3150
3151
3152
3153
3154
3155
3156
3157
3158
3159
3160
3161
3162
3163
3164
3165
3166
3167
3168
3169
3170
3171
3172
3173
3174
3175
3176
3177
3178
3179
3180
3181
3182
3183
3184
3185
3186
3187
3188
3189
3190
3191
3192
3193
3194
3195
3196
3197
3198
3199
3200
3201
3202
3203
3204
3205
3206
3207
3208
3209
3210
3211
3212
3213
3214
3215
3216
3217
3218
3219
3220
3221
3222
3223
3224
3225
3226
3227
3228
3229
3230
3231
3232
3233
3234
3235
3236
3237
3238
3239
3240
3241
3242
3243
3244
3245
3246
3247
3248
3249
3250
3251
3252
3253
3254
3255
3256
3257
3258
3259
3260
3261
3262
3263
3264
3265
3266
3267
3268
3269
3270
3271
3272
3273
3274
3275
3276
3277
3278
3279
3280
3281
3282
3283
3284
3285
3286
3287
3288
3289
3290
3291
3292
3293
3294
3295
3296
3297
3298
3299
3300
3301
3302
3303
3304
3305
3306
3307
3308
3309
3310
3311
3312
3313
3314
3315
3316
3317
3318
3319
3320
3321
3322
3323
3324
3325
3326
3327
3328
3329
3330
3331
3332
3333
3334
3335
3336
3337
3338
3339
3340
3341
3342
3343
3344
3345
3346
3347
3348
3349
3350
3351
3352
3353
3354
3355
3356
3357
3358
3359
3360
3361
3362
3363
3364
3365
3366
3367
3368
3369
3370
3371
3372
3373
3374
3375
3376
3377
3378
3379
3380
3381
3382
3383
3384
3385
3386
3387
3388
3389
3390
3391
3392
3393
3394
3395
3396
3397
3398
3399
3400
3401
3402
3403
3404
3405
3406
3407
3408
3409
3410
3411
3412
3413
3414
3415
3416
3417
3418
3419
3420
3421
3422
3423
3424
3425
3426
3427
3428
3429
3430
3431
3432
3433
3434
3435
3436
3437
3438
3439
3440
3441
3442
3443
3444
3445
3446
3447
3448
3449
3450
3451
3452
3453
3454
3455
3456
3457
3458
3459
3460
3461
3462
3463
3464
3465
3466
3467
3468
3469
3470
3471
3472
3473
3474
3475
3476
3477
3478
3479
3480
3481
3482
3483
3484
3485
3486
3487
3488
3489
3490
3491
3492
3493
3494
3495
3496
3497
3498
3499
3500
3501
3502
3503
3504
3505
3506
3507
3508
3509
3510
3511
3512
3513
3514
3515
3516
3517
3518
3519
3520
3521
3522
3523
3524
3525
3526
3527
3528
3529
3530
3531
3532
3533
3534
3535
3536
3537
3538
3539
3540
3541
3542
3543
3544
3545
3546
3547
3548
3549
3550
3551
3552
3553
3554
3555
3556
3557
3558
3559
3560
3561
3562
3563
3564
3565
3566
3567
3568
3569
3570
3571
3572
3573
3574
3575
3576
3577
3578
3579
3580
3581
3582
3583
3584
3585
3586
3587
3588
3589
3590
3591
3592
3593
3594
3595
3596
3597
3598
3599
3600
3601
3602
3603
3604
3605
3606
3607
3608
3609
3610
3611
3612
3613
3614
3615
3616
3617
3618
3619
3620
3621
3622
3623
3624
3625
3626
3627
3628
3629
3630
3631
3632
3633
3634
3635
3636
3637
3638
3639
3640
3641
3642
3643
3644
3645
3646
3647
3648
3649
3650
3651
3652
3653
3654
3655
3656
3657
3658
3659
3660
3661
3662
3663
3664
3665
3666
3667
3668
3669
3670
3671
3672
3673
3674
3675
3676
3677
3678

3679
3680
3681
3682
3683
3684
3685
3686
3687
3688
3689
3690
3691
3692
3693
3694
3695
3696
3697
3698
3699
3700
3701
3702
3703
3704
3705
3706
3707
3708
3709
3710
3711
3712
3713
3714
3715
3716
3717
3718
3719
3720
3721
3722
3723
3724
3725
3726
3727
3728
3729
3730
3731
3732
3733
3734
3735
3736
3737
3738
3739
3740
3741
3742
3743
3744
3745
3746
3747
3748
3749
3750
3751
3752
3753
3754
3755
3756
3757
3758
3759
3760
3761
3762
3763
3764
3765
3766
3767
3768
3769
3770
3771
3772
3773
3774
3775
3776
3777
3778
3779
3780
3781
3782
3783
3784
3785
3786
3787
3788
3789
3790
3791
3792
3793
3794
3795
3796
3797
3798
3799
3800
3801
3802
3803
3804
3805
3806
3807
3808
3809
3810
3811
3812
3813
3814
3815
3816
3817
3818
3819
3820
3821
3822
3823
3824
3825
3826
3827
3828
3829
3830
3831
3832
3833
3834
3835
3836
3837
3838
3839
3840
3841
3842
3843
3844
3845
3846
3847
3848
3849
3850
3851
3852
3853
3854
3855
3856
3857
3858
3859
3860
3861
3862
3863
3864
3865
3866
3867
3868
3869
3870
3871
3872
3873
3874
3875
3876
3877
3878
3879
3880
3881
3882
3883
3884
3885
3886
3887
3888
3889
3890
3891
3892
3893
3894
3895
3896
3897
3898
3899
3900
3901
3902
3903
3904
3905
3906
3907
3908
3909
3910
3911
3912
3913
3914
3915
3916
3917
3918
3919
3920
3921
3922
3923
3924
3925
3926
3927
3928
3929
3930
3931
3932
3933
3934
3935
3936
3937
3938
3939
3940
3941
3942
3943
3944
3945
3946
3947
3948
3949
3950
3951
3952
3953
3954
3955
3956
3957
3958
3959
3960
3961
3962
3963
3964
3965
3966
3967
3968
3969
3970
3971
3972
3973
3974
3975
3976
3977
3978
3979
3980
3981
3982
3983
3984
3985
3986
3987
3988
3989
3990
3991
3992
3993
3994
3995
3996
3997
3998
3999
4000
4001
4002
4003
4004
4005
4006
4007
4008
4009
4010
4011
4012
4013
4014
4015
4016
4017
4018
4019
4020
4021
4022
4023
4024
4025
4026
4027
4028
4029
4030
4031
4032
4033
4034
4035
4036
4037
4038
4039
4040
4041
4042
4043
4044
4045
4046
4047
4048
4049
4050
4051
4052
4053
4054
4055
4056
4057
4058
4059
4060
4061
4062
4063
4064
4065
4066
4067
4068
4069
4070
4071
4072
4073
4074
4075
4076
4077
4078
4079
4080
4081
4082
4083
4084
4085
4086
4087
4088
4089
4090
4091
4092
4093
4094
4095
4096
4097
4098
4099
4100
4101
4102
4103
4104
4105
4106
4107
4108
4109
4110
4111
4112
4113
4114
4115
4116
4117
4118
4119
4120
4121
4122
4123
4124
4125
4126
4127
4128
4129
4130
4131
4132
4133
4134
4135
4136
4137
4138
4139
4140
4141
4142
4143
4144
4145
4146
4147
4148
4149
4150
4151
4152
4153
4154
4155
4156
4157
4158
4159
4160
4161
4162
4163
4164
4165
4166
4167
4168
4169
4170
4171
4172
4173
4174
4175
4176
4177
4178
4179
4180
4181
4182
4183
4184
4185
4186
4187
4188
4189
4190
4191
4192
4193
4194
4195
4196
4197
4198
4199
4200
4201
4202
4203
4204
4205
4206
4207
4208
4209
4210
4211
4212
4213
4214
4215
4216
4217
4218
4219
4220
4221
4222
4223
4224
4225
4226
4227
4228
4229
4230
4231
4232
4233
4234
4235
4236
4237
4238
4239
4240
4241
4242
4243
4244
4245
4246
4247
4248
4249
4250
4251
4252
4253
4254
4255
4256
4257
4258
4259
4260
4261
4262
4263
4264
4265
4266
4267
4268
4269
4270
4271
4272
4273
4274
4275
4276
4277
4278
4279
4280
4281
4282
4283
4284
4285
4286
4287
4288
4289
4290
4291
4292
4293
4294
4295
4296
4297
4298
4299
4300
4301
4302
4303
4304
4305
4306
4307
4308
4309
4310
4311
4312
4313
4314
4315
4316
4317
4318
4319
4320
4321
4322
4323
4324
4325
4326
4327
4328
4329
4330
4331
4332
4333
4334
4335
4336
4337
4338
4339
4340
4341
4342
4343
4344
4345
4346
4347
4348
4349
4350
4351
4352
4353
4354
4355
4356
4357
4358
4359
4360
4361
4362
4363
4364
4365
4366
4367
4368
4369
4370
4371
4372
4373
4374
4375
4376
4377
4378
4379
4380
4381
4382
4383
4384
4385
4386
4387
4388
4389
4390
4391
4392
4393
4394
4395
4396
4397
4398
4399
4400
4401
4402
4403
4404
4405
4406
4407
4408
4409
4410
4411
4412
4413
4414
4415
4416
4417
4418
4419
4420
4421
4422
4423
4424
4425
4426
4427
4428
4429
4430
4431
4432
4433
4434
4435
4436
4437
4438
4439
4440
4441
4442
4443
4444
4445
4446
4447
4448
4449
4450
4451
4452
4453
4454
4455
4456
4457
4458
4459
4460
4461
4462
4463
4464
4465
4466
4467
4468
4469
4470
4471
4472
4473
4474
4475
4476
4477
4478
4479
4480
4481
4482
4483
4484
4485
4486
4487
4488
4489
4490
4491
4492
4493
4494
4495
4496
4497
4498
4499
4500
4501
4502
4503
4504
4505
4506
4507
4508
4509
4510
4511
4512
4513
4514
4515
4516
4517
4518
4519
4520
4521
4522
4523
4524
4525
4526
4527
4528
4529
4530
4531
4532
4533
4534
4535
4536
4537
4538
4539
4540
4541
4542
4543
4544
4545
4546
4547
4548
4549
4550
4551
4552
4553
4554
4555
4556
4557
4558
4559
4560
4561
4562
4563
4564
4565
4566
4567
4568
4569
4570
4571
4572
4573
4574
4575
4576
4577
4578
4579
4580
4581
4582
4583
4584
4585
4586
4587
4588
4589
4590
4591
4592
4593
4594
4595
4596
4597
4598
4599
4600
4601
4602
4603
4604
4605
4606
4607
4608
4609
4610
4611
4612
4613
4614
4615
4616
4617
4618
4619
4620
4621
4622
4623
4624
4625
4626
4627
4628
4629
4630
4631
4632
4633
4634
4635
4636
4637
4638
4639
4640
4641
4642
4643
4644
4645
4646
4647
4648
4649
4650
4651
4652
4653
4654
4655
4656
4657
4658
4659
4660
4661
4662
4663
4664
4665
4666
4667
4668
4669
4670
4671
4672
4673
4674
4675
4676
4677
4678
4679
4680
4681
4682
4683
4684
4685
4686
4687
4688
4689
4690
4691
4692
4693
4694
4695
4696
4697
4698
4699
4700
4701
4702
4703
4704
4705
4706
4707
4708
4709
4710
4711
4712
4713
4714
4715
4716
4717
4718
4719
4720
4721
4722
4723
4724
4725
4726
4727
4728
4729
4730
4731
4732
4733
4734
4735
4736
4737
4738
4739
4740
4741
4742
4743
4744
4745
4746
4747
4748
4749
4750
4751
4752
4753
4754
4755
4756
4757
4758
4759
4760
4761
4762
4763
4764
4765
4766
4767
4768
4769
4770
4771
4772
4773
4774
4775
4776
4777
4778
4779
4780
4781
4782
4783
4784
4785
4786
4787
4788
4789
4790
4791
4792
4793
4794
4795
4796
4797
4798
4799
4800
4801
4802
4803
4804
4805
4806
4807
4808
4809
4810
4811
4812
4813
4814
4815
4816
4817
4818
4819
4820
4821
4822
4823
4824
4825
4826
4827
4828
4829
4830
4831
4832
4833
4834
4835
4836
4837
4838
4839
4840
4841
4842
4843
4844
4845
4846
4847
4848
4849
4850
4851
4852
4853
4854
4855
4856
4857
4858
4859
4860
4861
4862
4863
4864
4865
4866
4867
4868
4869
4870
4871
4872
4873
4874
4875
4876
4877
4878
4879
4880
4881
4882
4883
4884
4885
4886
4887
4888
4889
4890
4891
4892
4893
4894
4895
4896
4897
4898
4899
4900
4901
4902
4903
4904
4905
4906
4907
4908
4909
4910
4911
4912
4913
4914
4915
4916
4917
4918
4919
4920
4921
4922
4923
4924
4925
4926
4927
4928
4929
4930
4931
4932
4933
4934
4935
4936
4937
4938
4939
4940
4941
4942
4943
4944
4945
4946
4947
4948
4949
4950
4951
4952
4953
4954
4955
4956
4957
4958
4959
4960
4961
4962
4963
4964
4965
4966
4967
4968
4969
4970
4971
4972
4973
4974
4975
4976
4977
4978
4979
4980
4981
4982
4983
4984
4985
4986
4987
4988
4989
4990
4991
4992
4993
4994
4995
4996
4997
4998
4999
5000
5001
5002
5003
5004
5005
5006
5007
5008
5009
5010
5011
5012
5013
5014
5015
5016
5017
5018
5019
5020
5021
5022
5023
5024
5025
5026
5027
5028
5029
5030
5031
5032
5033
5034
5035
5036
5037
5038
5039
5040
5041
5042
5043
5044
5045
5046
5047
5048
5049
5050
5051
5052
5053
5054
5055
5056
5057
5058
5059
5060
5061
5062
5063
5064
5065
5066
5067
5068
5069
5070
5071
5072
5073
5074
5075
5076
5077
5078
5079
5080
5081
5082
5083
5084
5085
5086
5087
5088
5089
5090
5091
5092
5093
5094
5095
5096
5097
5098
5099
5100
5101
5102
5103
5104
5105
5106
5107
5108
5109
5110
5111
5112
5113
5114
5115
5116
5117
5118
5119
5120
5121
5122
5123
5124
5125
5126
5127
5128
5129
5130
5131
5132
5133
5134
5135
5136
5137
5138
5139
5140
5141
5142
5143
5144
5145
5146
5147
5148
5149
5150
5151
5152
5153
5154
5155
5156
5157
5158
5159
5160
5161
5162
5163
5164
5165
5166
5167
5168
5169
5170
5171
5172
5173
5174
5175
5176
5177
5178
5179
5180
5181
5182
5183
5184
5185
5186
5187
5188
5189
5190
5191
5192
5193
5194
5195
5196
5197
5198
5199
5200
5201
5202
5203
5204
5205
5206
5207
5208
5209
5210
5211
5212
5213
5214
5215
5216
5217
5218
5219
5220
5221
5222
5223
5224
5225
5226
5227
5228
5229
5230
5231
5232
5233
5234
5235
5236
5237
5238
5239
5240
5241
5242
5243
5244
5245
5246
5247
5248
5249
5250
5251
5252
5253
5254
5255
5256
5257
5258
5259
5260
5261
5262
5263
5264
5265
5266
5267
5268
5269
5270
5271
5272
5273
5274
5275
5276
5277
5278
5279
5280
5281
5282
5283
5284
5285
5286
5287
5288
5289
5290
5291
5292
5293
5294
5295
5296
5297
5298
5299
5300
5301
5302
5303
5304
5305
5306
5307
5308
5309
5310
5311
5312
5313
5314
5315
5316
5317
5318
5319
5320
5321
5322
5323
5324
5325
5326
5327
5328
5329
5330
5331
5332
5333
5334
5335
5336
5337
5338
5339
5340
5341
5342
5343
5344
5345
5346
5347
5348
5349
5350
5351
5352
5353
5354
5355
5356
5357
5358
5359
5360
5361
5362
5363
5364
5365
5366
5367
5368
5369
5370
5371
5372
5373
5374
5375
5376
5377
5378
5379
5380
5381
5382
5383
5384
5385
5386
5387
5388
5389
5390
5391
5392
5393
5394
5395
5396
5397
5398
5399
5400
5401
5402
5403
5404
5405
5406
5407
5408
5409
5410
5411
5412
5413
5414
5415
5416
5417
5418
5419
5420
5421
5422
5423
5424
5425
5426
5427
5428
5429
5430
5431
5432
5433
5434
5435
5436
5437
5438
5439
5440
5441
5442
5443
5444
5445
5446
5447
5448
5449
5450
5451
5452
5453
5454
5455
5456
5457
5458
5459
5460
5461
5462
5463
5464
5465
5466
5467
5468
5469
5470
5471
5472
5473
5474
5475
5476
5477
5478
5479
5480
5481
5482
5483
5484
5485
5486
5487
5488
5489
5490
5491
5492
5493
5494
5495
5496
5497
5498
5499
5500
5501
5502
5503
5504
5505
5506
5507
5508
5509
5510
5511
5512
5513
5514
5515
5516

5517
5518
5519
5520
5521
5522
5523
5524
5525
5526
5527
5528
5529
5530
5531
5532
5533
5534
5535
5536
5537
5538
5539
5540
5541
5542
5543
5544
5545
5546
5547
5548
5549
5550
5551
5552
5553
5554
5555
5556
5557
5558
5559
5560
5561
5562
5563
5564
5565
5566
5567
5568
5569
5570
5571
5572
5573
5574
5575
5576
5577
5578
5579
5580
5581
5582
5583
5584
5585
5586
5587
5588
5589
5590
5591
5592
5593
5594
5595
5596
5597
5598
5599
5600
5601
5602
5603
5604
5605
5606
5607
5608
5609
5610
5611
5612
5613
5614
5615
5616
5617
5618
5619
5620
5621
5622
5623
5624
5625
5626
5627
5628
5629
5630
5631
5632
5633
5634
5635
5636
5637
5638
5639
5640
5641
5642
5643
5644
5645
5646
5647
5648
5649
5650
5651
5652
5653
5654
5655
5656
5657
5658
5659
5660
5661
5662
5663
5664
5665
5666
5667
5668
5669
5670
5671
5672
5673
5674
5675
5676
5677
5678
5679
5680
5681
5682
5683
5684
5685
5686
5687
5688
5689
5690
5691
5692
5693
5694
5695
5696
5697
5698
5699
5700
5701
5702
5703
5704
5705
5706
5707
5708
5709
5710
5711
5712
5713
5714
5715
5716
5717
5718
5719
5720
5721
5722
5723
5724
5725
5726
5727
5728
5729
5730
5731
5732
5733
5734
5735
5736
5737
5738
5739
5740
5741
5742
5743
5744
5745
5746
5747
5748
5749
5750
5751
5752
5753
5754
5755
5756
5757
5758
5759
5760
5761
5762
5763
5764
5765
5766
5767
5768
5769
5770
5771
5772
5773
5774
5775
5776
5777
5778
5779
5780
5781
5782
5783
5784
5785
5786
5787
5788
5789
5790
5791
5792
5793
5794
5795
5796
5797
5798
5799
5800
5801
5802
5803
5804
5805
5806
5807
5808
5809
5810
5811
5812
5813
5814
5815
5816
5817
5818
5819
5820
5821
5822
5823
5824
5825
5826
5827
5828
5829
5830
5831
5832
5833
5834
5835
5836
5837
5838
5839
5840
5841
5842
5843
5844
5845
5846
5847
5848
5849
5850
5851
5852
5853
5854
5855
5856
5857
5858
5859
5860
5861
5862
5863
5864
5865
5866
5867
5868
5869
5870
5871
5872
5873
5874
5875
5876
5877
5878
5879
5880
5881
5882
5883
5884
5885
5886
5887
5888
5889
5890
5891
5892
5893
5894
5895
5896
5897
5898
5899
5900
5901
5902
5903
5904
5905
5906
5907
5908
5909
5910
5911
5912
5913
5914
5915
5916
5917
5918
5919
5920
5921
5922
5923
5924
5925
5926
5927
5928
5929
5930
5931
5932
5933
5934
5935
5936
5937
5938
5939
5940
5941
5942
5943
5944
5945
5946
5947
5948
5949
5950
5951
5952
5953
5954
5955
5956
5957
5958
5959
5960
5961
5962
5963
5964
5965
5966
5967
5968
5969
5970
5971
5972
5973
5974
5975
5976
5977
5978
5979
5980
5981
5982
5983
5984
5985
5986
5987
5988
5989
5990
5991
5992
5993
5994
5995
5996
5997
5998
5999
6000
6001
6002
6003
6004
6005
6006
6007
6008
6009
6010
6011
6012
6013
6014
6015
6016
6017
6018
6019
6020
6021
6022
6023
6024
6025
6026
6027
6028
6029
6030
6031
6032
6033
6034
6035
6036
6037
6038
6039
6040
6041
6042
6043
6044
6045
6046
6047
6048
6049
6050
6051
6052
6053
6054
6055
6056
6057
6058
6059
6060
6061
6062
6063
6064
6065
6066
6067
6068
6069
6070
6071
6072
6073
6074
6075
6076
6077
6078
6079
6080
6081
6082
6083
6084
6085
6086
6087
6088
6089
6090
6091
6092
6093
6094
6095
6096
6097
6098
6099
6100
6101
6102
6103
6104
6105
6106
6107
6108
6109
6110
6111
6112
6113
6114
6115
6116
6117
6118
6119
6120
6121
6122
6123
6124
6125
6126
6127
6128
6129
6130
6131
6132
6133
6134
6135
6136
6137
6138
6139
6140
6141
6142
6143
6144
6145
6146
6147
6148
6149
6150
6151
6152
6153
6154
6155
6156
6157
6158
6159
6160
6161
6162
6163
6164
6165
6166
6167
6168
6169
6170
6171
6172
6173
6174
6175
6176
6177
6178
6179
6180
6181
6182
6183
6184
6185
6186
6187
6188
6189
6190
6191
6192
6193
6194
6195
6196
6197
6198
6199
6200
6201
6202
6203
6204
6205
6206
6207
6208
6209
6210
6211
6212
6213
6214
6215
6216
6217
6218
6219
6220
6221
6222
6223
6224
6225
6226
6227
6228
6229
6230
6231
6232
6233
6234
6235
6236
6237
6238
6239
6240
6241
6242
6243
6244
6245
6246
6247
6248
6249
6250
6251
6252
6253
6254
6255
6256
6257
6258
6259
6260
6261
6262
6263
6264
6265
6266
6267
6268
6269
6270
6271
6272
6273
6274
6275
6276
6277
6278
6279
6280
6281
6282
6283
6284
6285
6286
6287
6288
6289
6290
6291
6292
6293
6294
6295
6296
6297
6298
6299
6300
6301
6302
6303
6304
6305
6306
6307
6308
6309
6310
6311
6312
6313
6314
6315
6316
6317
6318
6319
6320
6321
6322
6323
6324
6325
6326
6327
6328
6329
6330
6331
6332
6333
6334
6335
6336
6337
6338
6339
6340
6341
6342
6343
6344
6345
6346
6347
6348
6349
6350
6351
6352
6353
6354
6355
6356
6357
6358
6359
6360
6361
6362
6363
6364
6365
6366
6367
6368
6369
6370
6371
6372
6373
6374
6375
6376
6377
6378
6379
6380
6381
6382
6383
6384
6385
6386
6387
6388
6389
6390
6391
6392
6393
6394
6395
6396
6397
6398
6399
6400
6401
6402
6403
6404
6405
6406
6407
6408
6409
6410
6411
6412
6413
6414
6415
6416
6417
6418
6419
6420
6421
6422
6423
6424
6425
6426
6427
6428
6429
6430
6431
6432
6433
6434
6435
6436
6437
6438
6439
6440
6441
6442
6443
6444
6445
6446
6447
6448
6449
6450
6451
6452
6453
6454
6455
6456
6457
6458
6459
6460
6461
6462
6463
6464
6465
6466
6467
6468
6469
6470
6471
6472
6473
6474
6475
6476
6477
6478
6479
6480
6481
6482
6483
6484
6485
6486
6487
6488
6489
6490
6491
6492
6493
6494
6495
6496
6497
6498
6499
6500
6501
6502
6503
6504
6505
6506
6507
6508
6509
6510
6511
6512
6513
6514
6515
6516
6517
6518
6519
6520
6521
6522
6523
6524
6525
6526
6527
6528
6529
6530
6531
6532
6533
6534
6535
6536
6537
6538
6539
6540
6541
6542
6543
6544
6545
6546
6547
6548
6549
6550
6551
6552
6553
6554
6555
6556
6557
6558
6559
6560
6561
6562
6563
6564
6565
6566
6567
6568
6569
6570
6571
6572
6573
6574
6575
6576
6577
6578
6579
6580
6581
6582
6583
6584
6585
6586
6587
6588
6589
6590
6591
6592
6593
6594
6595
6596
6597
6598
6599
6600
6601
6602
6603
6604
6605
6606
6607
6608
6609
6610
6611
6612
6613
6614
6615
6616
6617
6618
6619
6620
6621
6622
6623
6624
6625
6626
6627
6628
6629
6630
6631
6632
6633
6634
6635
6636
6637
6638
6639
6640
6641
6642
6643
6644
6645
6646
6647
6648
6649
6650
6651
6652
6653
6654
6655
6656
6657
6658
6659
6660
6661
6662
6663
6664
6665
6666
6667
6668
6669
6670
6671
6672
6673
6674
6675
6676
6677
6678
6679
6680
6681
6682
6683
6684
6685
6686
6687
6688
6689
6690
6691
6692
6693
6694
6695
6696
6697
6698
6699
6700
6701
6702
6703
6704
6705
6706
6707
6708
6709
6710
6711
6712
6713
6714
6715
6716
6717
6718
6719
6720
6721
6722
6723
6724
6725
6726
6727
6728
6729
6730
6731
6732
6733
6734
6735
6736
6737
6738
6739
6740
6741
6742
6743
6744
6745
6746
6747
6748
6749
6750
6751
6752
6753
6754
6755
6756
6757
6758
6759
6760
6761
6762
6763
6764
6765
6766
6767
6768
6769
6770
6771
6772
6773
6774
6775
6776
6777
6778
6779
6780
6781
6782
6783
6784
6785
6786
6787
6788
6789
6790
6791
6792
6793
6794
6795
6796
6797
6798
6799
6800
6801
6802
6803
6804
6805
6806
6807
6808
6809
6810
6811
6812
6813
6814
6815
6816
6817
6818
6819
6820
6821
6822
6823
6824
6825
6826
6827
6828
6829
6830
6831
6832
6833
6834
6835
6836
6837
6838
6839
6840
6841
6842
6843
6844
6845
6846
6847
6848
6849
6850
6851
6852
6853
6854
6855
6856
6857
6858
6859
6860
6861
6862
6863
6864
6865
6866
6867
6868
6869
6870
6871
6872
6873
6874
6875
6876
6877
6878
6879
6880
6881
6882
6883
6884
6885
6886
6887
6888
6889
6890
6891
6892
6893
6894
6895
6896
6897
6898
6899
6900
6901
6902
6903
6904
6905
6906
6907
6908
6909
6910
6911
6912
6913
6914
6915
6916
6917
6918
6919
6920
6921
6922
6923
6924
6925
6926
6927
6928
6929
6930
6931
6932
6933
6934
6935
6936
6937
6938
6939
6940
6941
6942
6943
6944
6945
6946
6947
6948
6949
6950
6951
6952
6953
6954
6955
6956
6957
6958
6959
6960
6961
6962
6963
6964
6965
6966
6967
6968
6969
6970
6971
6972
6973
6974
6975
6976
6977
6978
6979
6980
6981
6982
6983
6984
6985
6986
6987
6988
6989
6990
6991
6992
6993
6994
6995
6996
6997
6998
6999

In [356]:
print(df.iloc[0]['open_ai_prompt'])

Convert text to SQL.

DDL:
```
CREATE TABLE department (Department_ID int,Name text,Creation text,Ranking int,Budget_in_Billions real,Num_Employees real);CREATE TABLE head (head_ID int,name text,born_state text,age real);CREATE TABLE management (department_ID int,head_ID int,temporary_acting text);
```
Question:
"""What are the names of the states where at least 3 heads were born?"""
Answer:
SELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3

Question:
"""What are the names of the states where at least 3 heads were born?"""
Answer:
SELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3

Question:
"""How many heads of the departments are older than 56 ?"""
Answer:

In [362]:
tmp = df.sample(100)
tmp['model_response'] = ''

data = []
for idx, row in tmp.iterrows():
    print(idx)
    if row['model_response'] != '':
        print('already completed')
        data.append(row['model_response'])
        continue
    
    print(row['open_ai_completion'])
    new_response = call_raw_model(row)
    data.append(new_response)
    tmp.loc[idx,'model_response'] = new_response

3073
 SELECT DISTINCT T1.cust_name ,  T1.credit_score FROM customer AS T1 JOIN loan AS T2 ON T1.cust_id  =  T2.cust_id

SELECT cust_name, credit_score FROM customer JOIN loan ON customer.cust_ID  =  loan.cust_ID
2310
 SELECT T1.Name FROM people AS T1 JOIN perpetrator AS T2 ON T1.People_ID  =  T2.People_ID WHERE T2.Country != "China"

SELECT Name FROM people JOIN perpetrator ON people.People_ID = perpetrator.People_ID WHERE Country != 'China'
1543
 SELECT count(DISTINCT claim_outcome_code) FROM claims_processing

SELECT count(DISTINCT claim_outcome_code) FROM claims_processing
479
 SELECT Advisor FROM Student WHERE StuID  =  1004

SELECT Advisor FROM Student WHERE StuID = 1004
4672
 SELECT T1.DName FROM DEPARTMENT AS T1 JOIN MINOR_IN AS T2 ON T1.DNO  =  T2.DNO GROUP BY T2.DNO ORDER BY count(*) DESC LIMIT 1

SELECT T2.DName FROM MINOR_IN AS T1 JOIN DEPARTMENT AS T2 ON T1.DNO  =  T2.DNO GROUP BY T2.DName ORDER BY COUNT(*) DESC LIMIT 1
6880
 SELECT T1.name FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid GROUP BY T1.name ORDER BY count(*) DESC LIMIT 1

SELECT T1.name FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid GROUP BY T1.name ORDER BY count(*) DESC LIMIT 1
1530
 SELECT customer_details FROM customers WHERE customer_details LIKE "%Diana%"

SELECT Customer_Details FROM Customers WHERE Customer_Details LIKE '%Diana%'
15
 SELECT head_id ,  name FROM head WHERE name LIKE '%Ha%'

SELECT head_ID, name FROM head WHERE name LIKE '%Ha%'
4915
 SELECT TYPE ,  count(*) FROM store GROUP BY TYPE

SELECT t1.type, count(*) FROM store AS t1 GROUP BY t1.type
3139
 SELECT DISTINCT fault_status FROM Fault_Log_Parts

SELECT count(DISTINCT fault_status) FROM Fault_Log_Parts
2825
 SELECT ResName , Rating FROM Restaurant ORDER BY Rating DESC LIMIT 1;

SELECT ResName, Rating FROM Restaurant ORDER BY Rating DESC;
6863
 SELECT avg(elevation) ,  country FROM airports GROUP BY country

SELECT country, AVG(elevation) FROM airports GROUP BY country
5386
 SELECT product_id FROM problems AS T1 JOIN staff AS T2 ON T1.reported_by_staff_id = T2.staff_id WHERE T2.staff_first_name = "Christop" AND T2.staff_last_name = "Berge" INTERSECT SELECT product_id FROM problems AS T1 JOIN staff AS T2 ON T1.closure_authorised_by_staff_id = T2.staff_id WHERE T2.staff_first_name = "Ashley" AND T2.staff_last_name = "Medhurst"

SELECT DISTINCT T1.product_id FROM problems AS T1 JOIN staff AS T2 ON T1.reported_by_staff_id = T2.staff_id JOIN staff AS T3 ON T1.closure_authorised_by_staff_id = T3.staff_id WHERE T2.staff_first_name = "Christop" AND T2.staff_last_name = "Berge" AND T3.staff_first_name = "Ashley" AND T3.staff_last_name = "Medhurst"
3769
 SELECT count(*) FROM COURSES

SELECT COUNT(*) FROM Courses
4393
 SELECT role_code FROM Project_Staff WHERE date_from  >  '2003-04-19 15:06:20' AND date_to  <  '2016-03-15 00:33:18'

SELECT role_code FROM Project_Staff WHERE date_from BETWEEN '2003-04-19 15:06:20' AND '2016-03-15 00:33:18' AND date_to BETWEEN '2003-04-19 15:06:20' AND '2016-03-15 00:33:18'
2578
 SELECT kids FROM Reservations WHERE FirstName = "ROY" AND LastName  =  "SWEAZY";

SELECT Kids FROM Reservations WHERE LastName = "ROY" AND FirstName = "SWEAZY";
6720
 SELECT DISTINCT building FROM Faculty

SELECT DISTINCT Building FROM Faculty
6028
 SELECT StuID FROM Student WHERE sex  =  'M' EXCEPT SELECT StuID FROM Sportsinfo WHERE sportname  =  "Football"

SELECT StuID FROM Student WHERE Sex = "M" AND StuID NOT IN (SELECT StuID FROM Sportsinfo WHERE SportName = "Football")
5748
 SELECT count(*) FROM student AS T1 JOIN lives_in AS T2 ON T1.stuid  =  T2.stuid JOIN dorm AS T3 ON T3.dormid  =  T2.dormid WHERE T3.dorm_name  =  'Smith Hall' AND T1.sex  =  'F'

SELECT count(*) FROM student AS T1 JOIN lives_in AS T2 ON T1.stuid  =  T2.stuid JOIN dorm AS T3 ON T3.dormid  =  T2.dormid WHERE T3.dorm_name  =  'Smith Hall' AND T1.sex  =  'F'
1256
 SELECT apt_type_code FROM Apartments GROUP BY apt_type_code ORDER BY avg(room_count) DESC LIMIT 3

SELECT apt_type_code, AVG(room_count) FROM Apartments GROUP BY apt_type_code ORDER BY AVG(room_count) DESC LIMIT 3
4863
 SELECT LOCATION FROM school ORDER BY Enrollment ASC

SELECT Location FROM school ORDER BY Enrollment ASC
5607
 SELECT name FROM stadium WHERE capacity  <  (SELECT avg(capacity) FROM stadium)

SELECT name FROM stadium WHERE Capacity < (SELECT AVG(Capacity) FROM stadium)
5857
 SELECT T1.transaction_type_description ,  T2.date_of_transaction FROM Ref_Transaction_Types AS T1 JOIN TRANSACTIONS AS T2 ON T1.transaction_type_code  =  T2.transaction_type_code WHERE T2.share_count  <  10

SELECT transaction_type_description, date_of_transaction FROM TRANSACTIONS JOIN REF_TRANSACTION_TYPES ON TRANSACTIONS.transaction_type_code = REF_TRANSACTION_TYPES.transaction_type_code WHERE share_count < 10
941
 SELECT product ,  chromosome ,  porphyria FROM enzyme WHERE LOCATION  =  'Cytosol'

SELECT product, chromosome, porphyria FROM enzyme WHERE location = 'Cytosol'
3695
 SELECT sum(T1.salary) FROM salary AS T1 JOIN player AS T2 ON T1.player_id = T2.player_id WHERE T2.name_first  =  'Len' AND T2.name_last = 'Barker' AND T1.year BETWEEN 1985 AND 1990;

SELECT SUM(salary) FROM salary AS T1 JOIN player AS T2 ON T1.player_id  =  T2.player_id WHERE T2.name_first  =  'Len' AND T2.name_last  =  'Barker' AND T1.year BETWEEN 1985 AND 1990;
440
 SELECT count(DISTINCT allergy) FROM Allergy_type

SELECT COUNT(*) FROM Has_Allergy
1715
 SELECT title FROM item WHERE i_id NOT IN (SELECT i_id FROM review)

SELECT title FROM item WHERE i_id NOT IN (SELECT i_id FROM review)
1388
 SELECT T1.name FROM instructor AS T1 JOIN advisor AS T2 ON T1.id  =  T2.i_id GROUP BY T2.i_id HAVING count(*)  >  1

SELECT i.name
FROM instructor i
INNER JOIN advisor a ON i.id = a.i_id
GROUP BY i.name
HAVING COUNT(a.s_id) > 1;
4162
 SELECT calendar_date ,  day_Number FROM Ref_calendar

SELECT Calendar_Date, Day_Number FROM Ref_Calendar
3187
 SELECT dept_address FROM department WHERE dept_name  =  'History'

SELECT dept_address FROM department WHERE dept_name  =  'History'
6820
 SELECT country FROM airports ORDER BY elevation DESC LIMIT 1

SELECT country FROM airports ORDER BY elevation DESC LIMIT 1
6140
 SELECT customer_name FROM customers EXCEPT SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id

SELECT customer_name FROM customers WHERE customer_id NOT IN (SELECT customer_id FROM customer_orders)
3788
 SELECT login_name FROM Students WHERE family_name  =  "Ward"

SELECT login_name FROM Students WHERE family_name  =  "Ward"
1090
 SELECT POSITION ,  COUNT(*) FROM match_season GROUP BY POSITION

SELECT Position, COUNT(*) FROM match_season GROUP BY Position
5016
 SELECT T1.cName FROM  tryout AS T1 JOIN player AS T2 ON T1.pID  =  T2.pID WHERE T2.pName LIKE 'D%'

SELECT T2.cName FROM player AS T1 JOIN tryout AS T2 ON T1.pID  =  T2.pID WHERE T1.pName LIKE 'D%'
6844
 SELECT country FROM airlines WHERE active  =  'Y' GROUP BY country ORDER BY count(*) DESC LIMIT 1

SELECT country, count(*) FROM airlines WHERE active = 'Y' GROUP BY country ORDER BY count(*) DESC
434
 SELECT T2.name FROM Certificate AS T1 JOIN Aircraft AS T2 ON T2.aid  =  T1.aid WHERE T2.distance  >  5000 GROUP BY T1.aid ORDER BY count(*)  >=  5

SELECT a.name, a.distance
FROM Aircraft a
INNER JOIN Certificate c ON a.aid = c.aid
GROUP BY a.name, a.distance
HAVING a.distance > 5000 AND COUNT(c.eid) >= 5;
5729
 SELECT count(*) ,  avg(age) ,  city_code FROM student WHERE sex  =  'M' GROUP BY city_code

SELECT city_code, AVG(Age), COUNT(*) FROM student WHERE Sex = 'M' GROUP BY city_code
6595
 SELECT avg(price) FROM wine WHERE Appelation NOT IN (SELECT T1.Appelation FROM APPELLATIONS AS T1 JOIN WINE AS T2 ON T1.Appelation  =  T2.Appelation WHERE T1.County  =  'Sonoma')

SELECT AVG(Price) FROM WINE AS T1 JOIN APPELLATIONS AS T2 ON T1.Appelation  =  T2.Appelation WHERE T2.County  !=  "Sonoma"
2073
 SELECT member_name FROM member EXCEPT SELECT T1.member_name FROM member AS T1 JOIN party_events AS T2 ON T1.member_id  =  T2.member_in_charge_id

SELECT Member_Name FROM Member WHERE Member_ID NOT IN (SELECT Member_in_charge_ID FROM party_events)
2532
 SELECT count(*) FROM county_public_safety

SELECT COUNT(*) FROM county_public_safety;
1984
 SELECT Carrier ,  COUNT(*) FROM phone GROUP BY Carrier

SELECT Carrier, COUNT(*) FROM phone GROUP BY Carrier
1280
 SELECT T1.season FROM game AS T1 JOIN injury_accident AS T2 ON T1.id  =  T2.game_id WHERE T2.player  =  'Walter Samuel'

SELECT T2.Season FROM game AS T2 JOIN injury_accident AS T1 ON T2.id = T1.game_id WHERE T1.Player = 'Walter Samuel'
2724
 SELECT T2.region_name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T3.number_deaths  >=  10

SELECT region_name FROM region JOIN affected_region ON region.region_id = affected_region.region_id JOIN storm ON affected_region.storm_id = storm.storm_id WHERE number_deaths >= 10;
5477
 SELECT DISTINCT T1.Age FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.Secretary_Vote WHERE T2.Election_Cycle  =  "Fall"

SELECT DISTINCT Age FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.Secretary_Vote WHERE T2.Election_Cycle  =  'Fall'
1981
 SELECT DISTINCT Carrier FROM phone WHERE Memory_in_G  >  32

SELECT DISTINCT Carrier FROM phone WHERE Memory_in_G > 32
3617
 SELECT f_id FROM song WHERE resolution  >  (SELECT avg(resolution) FROM song WHERE genre_is  =  "modern")

SELECT f_id FROM song AS T1 JOIN genre AS T2 ON T1.genre_is  =  T2.g_name WHERE T2.g_name  =  "Modern" AND T1.resolution > (SELECT avg(resolution) FROM song AS T3 JOIN genre AS T4 ON T3.genre_is  =  T4.g_name WHERE T4.g_name  =  "Modern")
276
 SELECT count(*) FROM user_profiles

SELECT COUNT(*) FROM user_profiles
4002
 SELECT TYPE ,  Nationality FROM ship

SELECT Type, Nationality FROM ship
1746
 SELECT T2.Name FROM gymnast AS T1 JOIN people AS T2 ON T1.Gymnast_ID  =  T2.People_ID

SELECT T2.Name FROM gymnast AS T1 JOIN people AS T2 ON T1.Gymnast_ID  =  T2.People_ID
3239
 SELECT T3.dept_name FROM course AS T1 JOIN CLASS AS T2 ON T1.crs_code  =  T2.crs_code JOIN department AS T3 ON T1.dept_code  =  T3.dept_code GROUP BY T1.dept_code ORDER BY sum(T1.crs_credit) DESC LIMIT 1

SELECT T2.dept_name FROM course AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code GROUP BY T1.dept_code ORDER BY sum(crs_credit) DESC LIMIT 1
6696
 SELECT payment_method_code ,  count(*) FROM Customer_Payments GROUP BY payment_method_code;

SELECT payment_method_code, COUNT(payment_method_code) FROM Customer_Payments GROUP BY payment_method_code;
5513
 SELECT city_code FROM STUDENT GROUP BY city_code ORDER BY count(*) DESC LIMIT 1

SELECT city_code, COUNT(*) AS Student_Count FROM STUDENT GROUP BY city_code ORDER BY Student_Count DESC LIMIT 1;
2184
 SELECT DISTINCT T1.forename FROM drivers AS T1 JOIN driverstandings AS T2 ON T1.driverid = T2.driverid WHERE T2.position = 1 AND T2.wins = 1

SELECT DISTINCT T1.forename FROM drivers AS T1 JOIN driverStandings AS T2 ON T1.driverid = T2.driverid WHERE positionText  =  'Standing' AND wins  >  0
3268
 SELECT DISTINCT stu_fname FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num WHERE enroll_grade  =  'C'

SELECT T2.stu_fname FROM enroll AS T1 JOIN student AS T2 ON T1.stu_num  =  T2.stu_num WHERE T1.enroll_grade  =  'C'
2294
 SELECT T2.Name ,  T1.Company FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Money_Requested

SELECT T2.Name, T1.Investor FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Money_Requested DESC
960
 SELECT count(*) FROM medicine WHERE FDA_approved  =  'No'

SELECT COUNT(*) FROM medicine WHERE FDA_approved  !=  'Yes'
981
 SELECT founded FROM university ORDER BY enrollment DESC LIMIT 1

SELECT founded FROM university ORDER BY enrollment DESC LIMIT 1
868
 SELECT AVG(Milliseconds) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Latin" OR T1.Name  =  "Pop"

SELECT AVG(Milliseconds) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  IN  ("Latin", "Pop")
6428
 SELECT document_type_description FROM Ref_document_types WHERE document_type_name  =  "Film"

SELECT document_type_description FROM Ref_Document_Types WHERE document_type_name  =  "Film"
3657
 SELECT T1.name ,  T1.team_id ,  max(T2.salary) FROM team AS T1 JOIN salary AS T2 ON T1.team_id  =  T2.team_id GROUP BY T1.team_id;

SELECT T2.name, T2.team_id, MAX(T1.salary) FROM salary AS T1 JOIN team AS T2 ON T1.team_id = T2.team_id_br GROUP BY T2.team_id, T2.name;
6950
 SELECT DISTINCT T1.name ,  T1.nationality FROM architect AS T1 JOIN mill AS t2 ON T1.id  =  T2.architect_id

SELECT DISTINCT T1.name ,  T1.nationality FROM architect AS T1 JOIN mill AS t2 ON T1.id  =  T2.architect_id
1662
 SELECT name FROM artist ORDER BY year_join DESC LIMIT 1

SELECT name FROM artist ORDER BY year_join DESC LIMIT 1
6660
 SELECT email_address ,  date_of_birth FROM Customers WHERE first_name = "Carole"

SELECT email_address, date_of_birth FROM Customers WHERE first_name = "Carole";
6493
 SELECT name FROM scientists ORDER BY name

SELECT Name FROM Scientists ORDER BY Name ASC;
2174
 SELECT count(DISTINCT driverId) FROM results WHERE raceId NOT IN( SELECT raceId FROM races WHERE YEAR != 2009 )

SELECT COUNT(*) FROM drivers AS T1 LEFT JOIN races AS T2 ON T1.driverid = T2.driverid WHERE T2.year != 2009 AND T2.raceId IS NULL
5556
 SELECT count(DISTINCT t3.characteristic_name) FROM products AS t1 JOIN product_characteristics AS t2 ON t1.product_id  =  t2.product_id JOIN CHARACTERISTICS AS t3 ON t2.characteristic_id  =  t3.characteristic_id WHERE t1.product_name  =  "sesame"

SELECT COUNT(DISTINCT T3.characteristic_name) FROM products AS T1 JOIN product_characteristics AS T2 ON T1.product_id  =  T2.product_id JOIN characteristics AS T3 ON T2.characteristic_id  =  T3.characteristic_id WHERE T1.product_name  =  'cumin'
1668
 SELECT T2.name ,  count(*) FROM exhibition AS T1 JOIN artist AS T2 ON T1.artist_id  =  T2.artist_id GROUP BY T1.artist_id

SELECT Artist_ID, COUNT(Exhibition_ID) FROM exhibition GROUP BY Artist_ID
644
 SELECT T1.name FROM tracks AS T1 JOIN playlist_tracks AS T2 ON T1.id  =  T2.track_id JOIN playlists AS T3 ON T2.playlist_id  =  T3.id WHERE T3.name  =  'Movies' EXCEPT SELECT T1.name FROM tracks AS T1 JOIN playlist_tracks AS T2 ON T1.id  =  T2.track_id JOIN playlists AS T3 ON T2.playlist_id  =  T3.id WHERE T3.name  =  'Music'

SELECT t.name
FROM tracks t
JOIN playlist_tracks pt1 ON pt1.track_id = t.id
JOIN playlists p1 ON p1.id = pt1.playlist_id
JOIN playlist_tracks pt2 ON pt2.track_id = t.id
JOIN playlists p2 ON p2.id = pt2.playlist_id
WHERE p1.name = 'Movies' AND p2.name = 'Music'
AND pt1.playlist_id != pt2.playlist_id;
2585
 SELECT Adults FROM Reservations WHERE CheckIn  =  "2010-10-23" AND FirstName  =  "CONRAD" AND LastName  =  "SELBIG";

SELECT Adults FROM Reservations WHERE LastName = "Selbig" AND FirstName = "Conrad" AND CheckIn = "Oct 23, 2010";
1371
 SELECT dept_name FROM course GROUP BY dept_name ORDER BY count(*) DESC LIMIT 3

SELECT dept_name, COUNT(*) FROM course GROUP BY dept_name ORDER BY COUNT(*) DESC LIMIT 3;
3569
 SELECT DISTINCT song_name FROM song WHERE resolution  >  (SELECT min(resolution) FROM song WHERE languages  =  "english")

SELECT DISTINCT song_name FROM song WHERE resolution >  (SELECT max(resolution) FROM song WHERE languages  =  "English")
2647
 SELECT T1.cmi_cross_ref_id ,  T1.source_system_code FROM CMI_Cross_References AS T1 JOIN Council_Tax AS T2 ON T1.cmi_cross_ref_id  =  T2.cmi_cross_ref_id GROUP BY T1.cmi_cross_ref_id HAVING count(*)  >=  1

SELECT T1.cmi_cross_ref_id , T2.source_system_code FROM Council_Tax AS T1 JOIN CMI_Cross_References AS T2 ON T1.cmi_cross_ref_id  =  T2.cmi_cross_ref_id
5869
 SELECT investor_id ,  avg(share_count) FROM TRANSACTIONS GROUP BY investor_id ORDER BY avg(share_count)

SELECT investor_id, AVG(share_count) FROM TRANSACTIONS GROUP BY investor_id ORDER BY AVG(share_count)
1016
 SELECT sum(Enrollment) ,  affiliation FROM university WHERE founded  >  1850 GROUP BY affiliation

SELECT affiliation, SUM(enrollment) FROM university WHERE founded > 1850 GROUP BY affiliation
5054
 SELECT Carrier FROM device WHERE Software_Platform != 'Android'

SELECT Carrier FROM device WHERE Software_Platform != 'Android'
4394
 SELECT T1.outcome_description FROM Research_outcomes AS T1 JOIN Project_outcomes AS T2 ON T1.outcome_code  =  T2.outcome_code

SELECT outcome_description FROM Research_Outcomes
5633
 SELECT Builder FROM railway ORDER BY Builder ASC

SELECT Builder FROM railway ORDER BY Builder ASC
3149
 SELECT DISTINCT asset_model FROM Assets

SELECT DISTINCT asset_model FROM Assets;
2480
 SELECT DISTINCT T3.name ,  T2.title ,  T1.stars FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID WHERE T2.director  =  T3.name

SELECT T2.name, T3.title, T1.stars FROM Rating AS T1 JOIN Reviewer AS T2 ON T1.rID  =  T2.rID JOIN Movie AS T3 ON T1.mID  =  T3.mID WHERE T2.name  =  T3.director
463
 SELECT count(DISTINCT advisor) FROM Student

SELECT COUNT(DISTINCT Advisor) FROM Student
3306
 SELECT T2.dept_name ,  T2.dept_address ,  count(*) FROM student AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code GROUP BY T1.dept_code ORDER BY count(*) DESC LIMIT 3

SELECT T1.dept_name, T1.dept_address, COUNT(T2.stu_num) AS num_students FROM department AS T1 JOIN student AS T2 ON T1.dept_code  =  T2.dept_code GROUP BY T1.dept_name, T1.dept_address ORDER BY num_students DESC LIMIT 3;
1529
 SELECT customer_details FROM customers WHERE customer_details LIKE "%Diana%"

SELECT customer_details FROM customers WHERE customer_details LIKE '%Diana%'
6297
 SELECT city FROM city WHERE regional_population  >  10000000

SELECT city FROM city WHERE regional_population > 10000000
150
 SELECT avg(bikes_available) FROM status WHERE station_id NOT IN (SELECT id FROM station WHERE city  =  "Palo Alto")

SELECT AVG(bikes_available) FROM status WHERE station_id NOT IN (SELECT id FROM station WHERE city  =  'Palo Alto')
4031
 SELECT lastname FROM list WHERE classroom  =  111

SELECT lastname FROM list WHERE classroom = 111
5871
 SELECT T2.lot_id ,  avg(amount_of_transaction) FROM TRANSACTIONS AS T1 JOIN Transactions_Lots AS T2 ON T1.transaction_id  =  T2.transaction_id GROUP BY T2.lot_id

SELECT lot_id, avg(amount_of_transaction) FROM TRANSACTIONS t JOIN TRANSACTIONS_LOTS tl ON t.transaction_id = tl.transaction_id GROUP BY lot_id
5288
 SELECT founder FROM manufacturers WHERE name LIKE 'S%'

SELECT founder FROM manufacturers WHERE name LIKE  'S%'
4164
 SELECT count(*) FROM Ref_document_types

SELECT COUNT(*) FROM Ref_Document_Types
16
 SELECT count(*) FROM farm

SELECT COUNT(*) FROM farm;
1612
 SELECT T2.customer_last_name ,  T1.customer_id ,  T2.phone_number FROM Orders AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id ORDER BY count(*) DESC LIMIT 1

SELECT customer_last_name, customer_id, phone_number FROM Customers WHERE customer_id = (SELECT customer_id FROM Orders GROUP BY customer_id ORDER BY COUNT(*) DESC LIMIT 1)
865
 SELECT COUNT(*) FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId WHERE T1.Name  =  "AAC audio file"

SELECT COUNT(*) FROM TRACK WHERE MediaTypeId = (SELECT MediaTypeId FROM MEDIATYPE WHERE Name = 'AAC audio file')
4876
 SELECT Team FROM player ORDER BY Age DESC LIMIT 5

SELECT Team FROM player ORDER BY Age DESC LIMIT 5
2530
 SELECT T2.title FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID WHERE T1.stars  =  3 INTERSECT SELECT T2.title FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID WHERE T1.stars  =  4

SELECT DISTINCT title FROM Movie INNER JOIN Rating ON Movie.mID = Rating.mID WHERE stars IN (3,4)
459
 SELECT count(*) FROM Student

SELECT COUNT(*) FROM Student
6281
 SELECT T2.year FROM city AS T1 JOIN hosting_city AS T2 ON T1.city_id  =  T2.host_city WHERE T1.city  =  "Taizhou ( Zhejiang )"

SELECT year FROM hosting_city AS T1 JOIN city AS T2 ON T1.host_city = T2.city_id WHERE T2.city = "Taizhou ( Zhejiang )"
898
 SELECT customer_phone FROM available_policies WHERE policy_type_code  =  (SELECT policy_type_code FROM available_policies GROUP BY policy_type_code ORDER BY count(*) DESC LIMIT 1)

SELECT t1.customer_phone FROM customers_policies AS t1 JOIN available_policies AS t2 ON t1.policy_id  =  t2.policy_id WHERE t2.policy_type_code  =  (SELECT policy_type_code FROM available_policies GROUP BY policy_type_code ORDER BY count(*) DESC LIMIT 1)
1617
 SELECT order_id ,  count(*) FROM Order_items GROUP BY order_id

SELECT T1.order_id ,  COUNT(T2.order_item_id) AS num_items FROM Orders AS T1 JOIN Order_Items AS T2 ON T1.order_id  =  T2.order_id GROUP BY T1.order_id
3665
 SELECT max(T1.wins) FROM postseason AS T1 JOIN team AS T2 ON T1.team_id_winner  =  T2.team_id_br WHERE T2.name  =  'Boston Red Stockings';

SELECT max(T1.wins) FROM postseason AS T1 JOIN team AS T2 ON T1.team_id_winner  =  T2.team_id_br WHERE T2.name  =  'Boston Red Stockings';
3014
 SELECT avg(no_of_customers) FROM bank

SELECT AVG(no_of_customers) FROM bank;

In [363]:
tmp[~(tmp['model_response'] == '')].shape

(100, 15)

In [364]:
tmp['open_ai_execution'] = tmp.apply(lambda x: execution(x, 'open_ai_completion'), axis=1)
tmp['model_response_execution'] = tmp.apply(lambda x: execution(x, 'model_response'), axis=1)
tmp['execution_accuracy'] = np.where(tmp['open_ai_execution'] == tmp['model_response_execution'], 1, 0)
tmp[~(tmp['model_response'] == '') & ~(tmp['model_response'].isna())]['execution_accuracy'].mean()

0.7

In [367]:
df_db_rand = tmp.copy()

In [368]:
i = 0
print(df_db_rand[~(df_db_rand['model_response'] == '') & 
                 (df_db_rand['execution_accuracy'] == 0)].iloc[i]['open_ai_prompt'])
print(df_db_rand[~(df_db_rand['model_response'] == '') & 
                 (df_db_rand['execution_accuracy'] == 0)].iloc[i]['open_ai_completion'])
print(df_db_rand[~(df_db_rand['model_response'] == '') & 
                 (df_db_rand['execution_accuracy'] == 0)].iloc[i]['model_response'])

Convert text to SQL.

DDL:
```
CREATE TABLE bank (branch_ID int ,bname varchar(20),no_of_customers int,city varchar(10),state varchar(20));CREATE TABLE customer (cust_ID varchar(3) ,cust_name varchar(20),acc_type char(1),acc_bal int,no_of_loans int,credit_score int,branch_ID int,state varchar(20));CREATE TABLE loan (loan_ID varchar(3) ,loan_type varchar(15),cust_ID varchar(3),branch_ID varchar(3),amount int);
```
Question:
"""Find the names of bank branches that have provided a loan to any customer whose credit score is below 100."""
Answer:
SELECT T2.bname FROM loan AS T1 JOIN bank AS T2 ON T1.branch_id  =  T2.branch_id JOIN customer AS T3 ON T1.cust_id  =  T3.cust_id WHERE T3.credit_score  <  100

Question:
"""What are the total account balances for each customer from Utah or Texas?"""
Answer:
SELECT sum(acc_bal) FROM customer WHERE state  =  'Utah' OR state  =  'Texas'

Question:
"""What are the different names and credit scores of customers who have taken a loan?"""
Answer:

 SELECT DISTINCT T1.cust_name ,  T1.credit_score FROM customer AS T1 JOIN loan AS T2 ON T1.cust_id  =  T2.cust_id

SELECT cust_name, credit_score FROM customer JOIN loan ON customer.cust_ID  =  loan.cust_ID

# More examples from the same db

In [381]:
def get_more_db_examples(x, df, num_examples):
    db_id = x['db_id']
    tmp = df[df['db_id'] == db_id].copy()
    # Remove the row x from the dataframe tmp
    tmp = tmp[~tmp.index.isin([x.index])]
    
    if len(tmp) < num_examples:
        print('not enough examples in db')
        return None
    
    examples = np.random.randint(0,len(tmp),num_examples)
    for i in range(num_examples):
        row_ex = tmp.iloc[examples[i]]
        x['question-' + str(i+1)]   = row_ex['question']
        x['completion-' + str(i+1)] = row_ex['query']
        
    return x[['question-' + str(i+1) for i in range(num_examples)] + 
             ['completion-' + str(i+1) for i in range(num_examples)]]

def more_db_examples_prompt(x, num_examples):
    prompt = dedent(f'''
        Convert text to SQL.
        
        DDL:
        ```
        {x['schema']}
        ```
    ''')
    for i in range(1, num_examples + 1):
        question_key = f'question-{i}'
        completion_key = f'completion-{i}'
        if question_key in x and completion_key in x:
            prompt += dedent(f'''
            Question:
            """{x[question_key]}"""
            Answer:
            {x[completion_key]}
            ''')

    prompt += f'''\nQuestion:\n"""{x['question']}"""\nAnswer:\n'''

    return prompt

In [390]:
# We should be able to go up to 6 examples without causing a problem
df.groupby('db_id')['query'].count().min()

7

In [437]:
df = pd.read_json('spider/train_spider.json')

# Set schema
df['schema'] = df.apply(lambda x: get_schema(x['db_id']), axis=1)
df['schema'] = df['schema'].apply(lambda x: re.sub(r'\s+references\s+.*?[,;)]', '', x)) 
df['schema'] = df['schema'].apply(lambda x: re.sub('NOT NULL', '', x))
df['schema'] = df['schema'].apply(lambda x: re.sub(r',\s*(PRIMARY KEY|FOREIGN KEY).*?(;|$)', ');', x, 
                                                   flags=re.IGNORECASE))
df['schema'] = df['schema'].apply(lambda x: x.replace('`', '"'))
df['schema'] = df['schema'].apply(lambda x: re.sub(r'"(\w+)"', r'\1', x))
df['schema'] = df['schema'].apply(lambda x: x.replace('AUTOINCREMENT', ''))
df['schema'] = df['schema'].apply(lambda x: x.replace('UNSIGNED', ''))
df['schema'] = df['schema'].apply(lambda x: x.replace(' BIT', ' BOOLEAN'))
df['schema'] = df['schema'].apply(lambda x: x.replace('YEAR DEFAULT NULL', 'SMALLINT'))
df['schema'] = df['schema'].apply(lambda x: x.replace('MEDIUMINT', 'SMALLINT'))
df['schema'] = df['schema'].apply(lambda x: x.replace('character varchar', 'varchar'))
df['schema'] = df['schema'].apply(lambda x: re.sub(r'PRIMARY KEY,', ',', x))

# Select the examples to show the model
num_examples = 3
df[['question-' + str(i+1) for i in range(num_examples)] + ['completion-' + str(i+1) for i in range(num_examples)]]=\
    df.apply(lambda x: get_more_db_examples(x, df, num_examples), axis=1)
df['open_ai_prompt'] = df.apply(lambda x: more_db_examples_prompt(x, num_examples), axis=1)
df['open_ai_completion'] = df.apply(lambda x: open_ai_completion(x), axis=1)

In [438]:
# check all the DDLs are valid SQL
for i in range(df.shape[0]):
    print(i)
    sqlglot.transpile(df.iloc[i]['schema'], read='sqlite')

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
141
142
143
144
145
146
147
148
149
150
151
152
153
154
155
156
157
158
159
160
161
162
163
164
165
166
167
168
169
170
171
172
173
174
175
176
177
178
179
180
181
182
183
184
185
186
187
188
189
190
191
192
193
194
195
196
197
198
199
200
201
202
203
204
205
206
207
208
209
210
211
212
213
214
215
216
217
218
219
220
221
222
223
224
225
226
227
228
229
230
231
232
233
234
235
236
237
238
239
240
241
242
243
244
245
246
247
248
249
250
251
252
253
254
255
256
257
258
259
260
261
262
263
264
265
266
267
268
269
270
271
272
273
274
275
276
277
278
279
280
281
282
283
284
285
286
287
288
289
290
291
292
293
294
295
296
297
298
299
300
301
302
303
304
305
306
307
308
309
310
311
312
313
314
315
316
317
318
319
320
321
322
323
324
325
326
327
328
329
330
331
332
333
334
335
336
337
338
339
340
341
342
343
344
345
346
347
348
349
350
351
352
353
354
355
356
357
358
359
360
361
362
363
364
365
366
367
368
369
370
371
372
373
374
375
376
377
378
379
380
381
382
383
384
385
386
387
388
389
390
391
392
393
394
395
396
397
398
399
400
401
402
403
404
405
406
407
408
409
410
411
412
413
414
415
416
417
418
419
420
421
422
423
424
425
426
427
428
429
430
431
432
433
434
435
436
437
438
439
440
441
442
443
444
445
446
447
448
449
450
451
452
453
454
455
456
457
458
459
460
461
462
463
464
465
466
467
468
469
470
471
472
473
474
475
476
477
478
479
480
481
482
483
484
485
486
487
488
489
490
491
492
493
494
495
496
497
498
499
500
501
502
503
504
505
506
507
508
509
510
511
512
513
514
515
516
517
518
519
520
521
522
523
524
525
526
527
528
529
530
531
532
533
534
535
536
537
538
539
540
541
542
543
544
545
546
547
548
549
550
551
552
553
554
555
556
557
558
559
560
561
562
563
564
565
566
567
568
569
570
571
572
573
574
575
576
577
578
579
580
581
582
583
584
585
586
587
588
589
590
591
592
593
594
595
596
597
598
599
600
601
602
603
604
605
606
607
608
609
610
611
612
613
614
615
616
617
618
619
620
621
622
623
624
625
626
627
628
629
630
631
632
633
634
635
636
637
638
639
640
641
642
643
644
645
646
647
648
649
650
651
652
653
654
655
656
657
658
659
660
661
662
663
664
665
666
667
668
669
670
671
672
673
674
675
676
677
678
679
680
681
682
683
684
685
686
687
688
689
690
691
692
693
694
695
696
697
698
699
700
701
702
703
704
705
706
707
708
709
710
711
712
713
714
715
716
717
718
719
720
721
722
723
724
725
726
727
728
729
730
731
732
733
734
735
736
737
738
739
740
741
742
743
744
745
746
747
748
749
750
751
752
753
754
755
756
757
758
759
760
761
762
763
764
765
766
767
768
769
770
771
772
773
774
775
776
777
778
779
780
781
782
783
784
785
786
787
788
789
790
791
792
793
794
795
796
797
798
799
800
801
802
803
804
805
806
807
808
809
810
811
812
813
814
815
816
817
818
819
820
821
822
823
824
825
826
827
828
829
830
831
832
833
834
835
836
837
838
839
840
841
842
843
844
845
846
847
848
849
850
851
852
853
854
855
856
857
858
859
860
861
862
863
864
865
866
867
868
869
870
871
872
873
874
875
876
877
878
879
880
881
882
883
884
885
886
887
888
889
890
891
892
893
894
895
896
897
898
899
900
901
902
903
904
905
906
907
908
909
910
911
912
913
914
915
916
917
918
919
920
921
922
923
924
925
926
927
928
929
930
931
932
933
934
935
936
937
938
939
940
941
942
943
944
945
946
947
948
949
950
951
952
953
954
955
956
957
958
959
960
961
962
963
964
965
966
967
968
969
970
971
972
973
974
975
976
977
978
979
980
981
982
983
984
985
986
987
988
989
990
991
992
993
994
995
996
997
998
999
1000
1001
1002
1003
1004
1005
1006
1007
1008
1009
1010
1011
1012
1013
1014
1015
1016
1017
1018
1019
1020
1021
1022
1023
1024
1025
1026
1027
1028
1029
1030
1031
1032
1033
1034
1035
1036
1037
1038
1039
1040
1041
1042
1043
1044
1045
1046
1047
1048
1049
1050
1051
1052
1053
1054
1055
1056
1057
1058
1059
1060
1061
1062
1063
1064
1065
1066
1067
1068
1069
1070
1071
1072
1073
1074
1075
1076
1077
1078
1079
1080
1081
1082
1083
1084
1085
1086
1087
1088
1089
1090
1091
1092
1093
1094
1095
1096
1097
1098
1099
1100
1101
1102
1103
1104
1105
1106
1107
1108
1109
1110
1111
1112
1113
1114
1115
1116
1117
1118
1119
1120
1121
1122
1123
1124
1125
1126
1127
1128
1129
1130
1131
1132
1133
1134
1135
1136
1137
1138
1139
1140
1141
1142
1143
1144
1145
1146
1147
1148
1149
1150
1151
1152
1153
1154
1155
1156
1157
1158
1159
1160
1161
1162
1163
1164
1165
1166
1167
1168
1169
1170
1171
1172
1173
1174
1175
1176
1177
1178
1179
1180
1181
1182
1183
1184
1185
1186
1187
1188
1189
1190
1191
1192
1193
1194
1195
1196
1197
1198
1199
1200
1201
1202
1203
1204
1205
1206
1207
1208
1209
1210
1211
1212
1213
1214
1215
1216
1217
1218
1219
1220
1221
1222
1223
1224
1225
1226
1227
1228
1229
1230
1231
1232
1233
1234
1235
1236
1237
1238
1239
1240
1241
1242
1243
1244
1245
1246
1247
1248
1249
1250
1251
1252
1253
1254
1255
1256
1257
1258
1259
1260
1261
1262
1263
1264
1265
1266
1267
1268
1269
1270
1271
1272
1273
1274
1275
1276
1277
1278
1279
1280
1281
1282
1283
1284
1285
1286
1287
1288
1289
1290
1291
1292
1293
1294
1295
1296
1297
1298
1299
1300
1301
1302
1303
1304
1305
1306
1307
1308
1309
1310
1311
1312
1313
1314
1315
1316
1317
1318
1319
1320
1321
1322
1323
1324
1325
1326
1327
1328
1329
1330
1331
1332
1333
1334
1335
1336
1337
1338
1339
1340
1341
1342
1343
1344
1345
1346
1347
1348
1349
1350
1351
1352
1353
1354
1355
1356
1357
1358
1359
1360
1361
1362
1363
1364
1365
1366
1367
1368
1369
1370
1371
1372
1373
1374
1375
1376
1377
1378
1379
1380
1381
1382
1383
1384
1385
1386
1387
1388
1389
1390
1391
1392
1393
1394
1395
1396
1397
1398
1399
1400
1401
1402
1403
1404
1405
1406
1407
1408
1409
1410
1411
1412
1413
1414
1415
1416
1417
1418
1419
1420
1421
1422
1423
1424
1425
1426
1427
1428
1429
1430
1431
1432
1433
1434
1435
1436
1437
1438
1439
1440
1441
1442
1443
1444
1445
1446
1447
1448
1449
1450
1451
1452
1453
1454
1455
1456
1457
1458
1459
1460
1461
1462
1463
1464
1465
1466
1467
1468
1469
1470
1471
1472
1473
1474
1475
1476
1477
1478
1479
1480
1481
1482
1483
1484
1485
1486
1487
1488
1489
1490
1491
1492
1493
1494
1495
1496
1497
1498
1499
1500
1501
1502
1503
1504
1505
1506
1507
1508
1509
1510
1511
1512
1513
1514
1515
1516
1517
1518
1519
1520
1521
1522
1523
1524
1525
1526
1527
1528
1529
1530
1531
1532
1533
1534
1535
1536
1537
1538
1539
1540
1541
1542
1543
1544
1545
1546
1547
1548
1549
1550
1551
1552
1553
1554
1555
1556
1557
1558
1559
1560
1561
1562
1563
1564
1565
1566
1567
1568
1569
1570
1571
1572
1573
1574
1575
1576
1577
1578
1579
1580
1581
1582
1583
1584
1585
1586
1587
1588
1589
1590
1591
1592
1593
1594
1595
1596
1597
1598
1599
1600
1601
1602
1603
1604
1605
1606
1607
1608
1609
1610
1611
1612
1613
1614
1615
1616
1617
1618
1619
1620
1621
1622
1623
1624
1625
1626
1627
1628
1629
1630
1631
1632
1633
1634
1635
1636
1637
1638
1639
1640
1641
1642
1643
1644
1645
1646
1647
1648
1649
1650
1651
1652
1653
1654
1655
1656
1657
1658
1659
1660
1661
1662
1663
1664
1665
1666
1667
1668
1669
1670
1671
1672
1673
1674
1675
1676
1677
1678
1679
1680
1681
1682
1683
1684
1685
1686
1687
1688
1689
1690
1691
1692
1693
1694
1695
1696
1697
1698
1699
1700
1701
1702
1703
1704
1705
1706
1707
1708
1709
1710
1711
1712
1713
1714
1715
1716
1717
1718
1719
1720
1721
1722
1723
1724
1725
1726
1727
1728
1729
1730
1731
1732
1733
1734
1735
1736
1737
1738
1739
1740
1741
1742
1743
1744
1745
1746
1747
1748
1749
1750
1751
1752
1753
1754
1755
1756
1757
1758
1759
1760
1761
1762
1763
1764
1765
1766
1767
1768
1769
1770
1771
1772
1773
1774
1775
1776
1777
1778
1779
1780
1781
1782
1783
1784
1785
1786
1787
1788
1789
1790
1791
1792
1793
1794
1795
1796
1797
1798
1799
1800
1801
1802
1803
1804
1805
1806
1807
1808
1809
1810
1811
1812
1813
1814
1815
1816
1817
1818
1819
1820
1821
1822
1823
1824
1825
1826
1827
1828
1829
1830
1831
1832
1833
1834
1835
1836
1837
1838
1839
1840
1841
1842
1843
1844
1845
1846
1847
1848
1849
1850
1851
1852
1853
1854
1855
1856
1857
1858
1859
1860
1861
1862
1863
1864
1865
1866
1867
1868
1869
1870
1871
1872
1873
1874
1875
1876
1877
1878
1879
1880
1881
1882
1883
1884
1885
1886
1887
1888
1889
1890
1891
1892
1893
1894
1895
1896
1897
1898
1899
1900
1901
1902
1903
1904
1905
1906
1907
1908
1909
1910
1911
1912
1913
1914
1915
1916
1917
1918
1919
1920
1921
1922
1923
1924
1925
1926

1927
1928
1929
1930
1931
1932
1933
1934
1935
1936
1937
1938
1939
1940
1941
1942
1943
1944
1945
1946
1947
1948
1949
1950
1951
1952
1953
1954
1955
1956
1957
1958
1959
1960
1961
1962
1963
1964
1965
1966
1967
1968
1969
1970
1971
1972
1973
1974
1975
1976
1977
1978
1979
1980
1981
1982
1983
1984
1985
1986
1987
1988
1989
1990
1991
1992
1993
1994
1995
1996
1997
1998
1999
2000
2001
2002
2003
2004
2005
2006
2007
2008
2009
2010
2011
2012
2013
2014
2015
2016
2017
2018
2019
2020
2021
2022
2023
2024
2025
2026
2027
2028
2029
2030
2031
2032
2033
2034
2035
2036
2037
2038
2039
2040
2041
2042
2043
2044
2045
2046
2047
2048
2049
2050
2051
2052
2053
2054
2055
2056
2057
2058
2059
2060
2061
2062
2063
2064
2065
2066
2067
2068
2069
2070
2071
2072
2073
2074
2075
2076
2077
2078
2079
2080
2081
2082
2083
2084
2085
2086
2087
2088
2089
2090
2091
2092
2093
2094
2095
2096
2097
2098
2099
2100
2101
2102
2103
2104
2105
2106
2107
2108
2109
2110
2111
2112
2113
2114
2115
2116
2117
2118
2119
2120
2121
2122
2123
2124
2125
2126
2127
2128
2129
2130
2131
2132
2133
2134
2135
2136
2137
2138
2139
2140
2141
2142
2143
2144
2145
2146
2147
2148
2149
2150
2151
2152
2153
2154
2155
2156
2157
2158
2159
2160
2161
2162
2163
2164
2165
2166
2167
2168
2169
2170
2171
2172
2173
2174
2175
2176
2177
2178
2179
2180
2181
2182
2183
2184
2185
2186
2187
2188
2189
2190
2191
2192
2193
2194
2195
2196
2197
2198
2199
2200
2201
2202
2203
2204
2205
2206
2207
2208
2209
2210
2211
2212
2213
2214
2215
2216
2217
2218
2219
2220
2221
2222
2223
2224
2225
2226
2227
2228
2229
2230
2231
2232
2233
2234
2235
2236
2237
2238
2239
2240
2241
2242
2243
2244
2245
2246
2247
2248
2249
2250
2251
2252
2253
2254
2255
2256
2257
2258
2259
2260
2261
2262
2263
2264
2265
2266
2267
2268
2269
2270
2271
2272
2273
2274
2275
2276
2277
2278
2279
2280
2281
2282
2283
2284
2285
2286
2287
2288
2289
2290
2291
2292
2293
2294
2295
2296
2297
2298
2299
2300
2301
2302
2303
2304
2305
2306
2307
2308
2309
2310
2311
2312
2313
2314
2315
2316
2317
2318
2319
2320
2321
2322
2323
2324
2325
2326
2327
2328
2329
2330
2331
2332
2333
2334
2335
2336
2337
2338
2339
2340
2341
2342
2343
2344
2345
2346
2347
2348
2349
2350
2351
2352
2353
2354
2355
2356
2357
2358
2359
2360
2361
2362
2363
2364
2365
2366
2367
2368
2369
2370
2371
2372
2373
2374
2375
2376
2377
2378
2379
2380
2381
2382
2383
2384
2385
2386
2387
2388
2389
2390
2391
2392
2393
2394
2395
2396
2397
2398
2399
2400
2401
2402
2403
2404
2405
2406
2407
2408
2409
2410
2411
2412
2413
2414
2415
2416
2417
2418
2419
2420
2421
2422
2423
2424
2425
2426
2427
2428
2429
2430
2431
2432
2433
2434
2435
2436
2437
2438
2439
2440
2441
2442
2443
2444
2445
2446
2447
2448
2449
2450
2451
2452
2453
2454
2455
2456
2457
2458
2459
2460
2461
2462
2463
2464
2465
2466
2467
2468
2469
2470
2471
2472
2473
2474
2475
2476
2477
2478
2479
2480
2481
2482
2483
2484
2485
2486
2487
2488
2489
2490
2491
2492
2493
2494
2495
2496
2497
2498
2499
2500
2501
2502
2503
2504
2505
2506
2507
2508
2509
2510
2511
2512
2513
2514
2515
2516
2517
2518
2519
2520
2521
2522
2523
2524
2525
2526
2527
2528
2529
2530
2531
2532
2533
2534
2535
2536
2537
2538
2539
2540
2541
2542
2543
2544
2545
2546
2547
2548
2549
2550
2551
2552
2553
2554
2555
2556
2557
2558
2559
2560
2561
2562
2563
2564
2565
2566
2567
2568
2569
2570
2571
2572
2573
2574
2575
2576
2577
2578
2579
2580
2581
2582
2583
2584
2585
2586
2587
2588
2589
2590
2591
2592
2593
2594
2595
2596
2597
2598
2599
2600
2601
2602
2603
2604
2605
2606
2607
2608
2609
2610
2611
2612
2613
2614
2615
2616
2617
2618
2619
2620
2621
2622
2623
2624
2625
2626
2627
2628
2629
2630
2631
2632
2633
2634
2635
2636
2637
2638
2639
2640
2641
2642
2643
2644
2645
2646
2647
2648
2649
2650
2651
2652
2653
2654
2655
2656
2657
2658
2659
2660
2661
2662
2663
2664
2665
2666
2667
2668
2669
2670
2671
2672
2673
2674
2675
2676
2677
2678
2679
2680
2681
2682
2683
2684
2685
2686
2687
2688
2689
2690
2691
2692
2693
2694
2695
2696
2697
2698
2699
2700
2701
2702
2703
2704
2705
2706
2707
2708
2709
2710
2711
2712
2713
2714
2715
2716
2717
2718
2719
2720
2721
2722
2723
2724
2725
2726
2727
2728
2729
2730
2731
2732
2733
2734
2735
2736
2737
2738
2739
2740
2741
2742
2743
2744
2745
2746
2747
2748
2749
2750
2751
2752
2753
2754
2755
2756
2757
2758
2759
2760
2761
2762
2763
2764
2765
2766
2767
2768
2769
2770
2771
2772
2773
2774
2775
2776
2777
2778
2779
2780
2781
2782
2783
2784
2785
2786
2787
2788
2789
2790
2791
2792
2793
2794
2795
2796
2797
2798
2799
2800
2801
2802
2803
2804
2805
2806
2807
2808
2809
2810
2811
2812
2813
2814
2815
2816
2817
2818
2819
2820
2821
2822
2823
2824
2825
2826
2827
2828
2829
2830
2831
2832
2833
2834
2835
2836
2837
2838
2839
2840
2841
2842
2843
2844
2845
2846
2847
2848
2849
2850
2851
2852
2853
2854
2855
2856
2857
2858
2859
2860
2861
2862
2863
2864
2865
2866
2867
2868
2869
2870
2871
2872
2873
2874
2875
2876
2877
2878
2879
2880
2881
2882
2883
2884
2885
2886
2887
2888
2889
2890
2891
2892
2893
2894
2895
2896
2897
2898
2899
2900
2901
2902
2903
2904
2905
2906
2907
2908
2909
2910
2911
2912
2913
2914
2915
2916
2917
2918
2919
2920
2921
2922
2923
2924
2925
2926
2927
2928
2929
2930
2931
2932
2933
2934
2935
2936
2937
2938
2939
2940
2941
2942
2943
2944
2945
2946
2947
2948
2949
2950
2951
2952
2953
2954
2955
2956
2957
2958
2959
2960
2961
2962
2963
2964
2965
2966
2967
2968
2969
2970
2971
2972
2973
2974
2975
2976
2977
2978
2979
2980
2981
2982
2983
2984
2985
2986
2987
2988
2989
2990
2991
2992
2993
2994
2995
2996
2997
2998
2999
3000
3001
3002
3003
3004
3005
3006
3007
3008
3009
3010
3011
3012
3013
3014
3015
3016
3017
3018
3019
3020
3021
3022
3023
3024
3025
3026
3027
3028
3029
3030
3031
3032
3033
3034
3035
3036
3037
3038
3039
3040
3041
3042
3043
3044
3045
3046
3047
3048
3049
3050
3051
3052
3053
3054
3055
3056
3057
3058
3059
3060
3061
3062
3063
3064
3065
3066
3067
3068
3069
3070
3071
3072
3073
3074
3075
3076
3077
3078
3079
3080
3081
3082
3083
3084
3085
3086
3087
3088
3089
3090
3091
3092
3093
3094
3095
3096
3097
3098
3099
3100
3101
3102
3103
3104
3105
3106
3107
3108
3109
3110
3111
3112
3113
3114
3115
3116
3117
3118
3119
3120
3121
3122
3123
3124
3125
3126
3127
3128
3129
3130
3131
3132
3133
3134
3135
3136
3137
3138
3139
3140
3141
3142
3143
3144
3145
3146
3147
3148
3149
3150
3151
3152
3153
3154
3155
3156
3157
3158
3159
3160
3161
3162
3163
3164
3165
3166
3167
3168
3169
3170
3171
3172
3173
3174
3175
3176
3177
3178
3179
3180
3181
3182
3183
3184
3185
3186
3187
3188
3189
3190
3191
3192
3193
3194
3195
3196
3197
3198
3199
3200
3201
3202
3203
3204
3205
3206
3207
3208
3209
3210
3211
3212
3213
3214
3215
3216
3217
3218
3219
3220
3221
3222
3223
3224
3225
3226
3227
3228
3229
3230
3231
3232
3233
3234
3235
3236
3237
3238
3239
3240
3241
3242
3243
3244
3245
3246
3247
3248
3249
3250
3251
3252
3253
3254
3255
3256
3257
3258
3259
3260
3261
3262
3263
3264
3265
3266
3267
3268
3269
3270
3271
3272
3273
3274
3275
3276
3277
3278
3279
3280
3281
3282
3283
3284
3285
3286
3287
3288
3289
3290
3291
3292
3293
3294
3295
3296
3297
3298
3299
3300
3301
3302
3303
3304
3305
3306
3307
3308
3309
3310
3311
3312
3313
3314
3315
3316
3317
3318
3319
3320
3321
3322
3323
3324
3325
3326
3327
3328
3329
3330
3331
3332
3333
3334
3335
3336
3337
3338
3339
3340
3341
3342
3343
3344
3345
3346
3347
3348
3349
3350
3351
3352
3353
3354
3355
3356
3357
3358
3359
3360
3361
3362
3363
3364
3365
3366
3367
3368
3369
3370
3371
3372
3373
3374
3375
3376
3377
3378
3379
3380
3381
3382
3383
3384
3385
3386
3387
3388
3389
3390
3391
3392
3393
3394
3395
3396
3397
3398
3399
3400
3401
3402
3403
3404
3405
3406
3407
3408
3409
3410
3411
3412
3413
3414
3415
3416
3417
3418
3419
3420
3421
3422
3423
3424
3425
3426
3427
3428
3429
3430
3431
3432
3433
3434
3435
3436
3437
3438
3439
3440
3441
3442
3443
3444
3445
3446
3447
3448
3449
3450
3451
3452
3453
3454
3455
3456
3457
3458
3459
3460
3461
3462
3463
3464
3465
3466
3467
3468
3469
3470
3471
3472
3473
3474
3475
3476
3477
3478
3479
3480
3481
3482
3483
3484
3485
3486
3487
3488
3489
3490
3491
3492
3493
3494
3495
3496
3497
3498
3499
3500
3501
3502
3503
3504
3505
3506
3507
3508
3509
3510
3511
3512
3513
3514
3515
3516
3517
3518
3519
3520
3521
3522
3523
3524
3525
3526
3527
3528
3529
3530
3531
3532
3533
3534
3535
3536
3537
3538
3539
3540
3541
3542
3543
3544
3545
3546
3547
3548
3549
3550
3551
3552
3553
3554
3555
3556
3557
3558
3559
3560
3561
3562
3563
3564
3565
3566
3567
3568
3569
3570
3571
3572
3573
3574
3575
3576
3577
3578
3579
3580
3581
3582
3583
3584
3585
3586
3587
3588
3589
3590
3591
3592
3593
3594
3595
3596
3597
3598
3599
3600
3601
3602
3603
3604
3605
3606
3607
3608
3609
3610
3611
3612
3613
3614
3615
3616
3617
3618
3619
3620
3621
3622
3623
3624
3625
3626
3627
3628
3629
3630
3631

3632
3633
3634
3635
3636
3637
3638
3639
3640
3641
3642
3643
3644
3645
3646
3647
3648
3649
3650
3651
3652
3653
3654
3655
3656
3657
3658
3659
3660
3661
3662
3663
3664
3665
3666
3667
3668
3669
3670
3671
3672
3673
3674
3675
3676
3677
3678
3679
3680
3681
3682
3683
3684
3685
3686
3687
3688
3689
3690
3691
3692
3693
3694
3695
3696
3697
3698
3699
3700
3701
3702
3703
3704
3705
3706
3707
3708
3709
3710
3711
3712
3713
3714
3715
3716
3717
3718
3719
3720
3721
3722
3723
3724
3725
3726
3727
3728
3729
3730
3731
3732
3733
3734
3735
3736
3737
3738
3739
3740
3741
3742
3743
3744
3745
3746
3747
3748
3749
3750
3751
3752
3753
3754
3755
3756
3757
3758
3759
3760
3761
3762
3763
3764
3765
3766
3767
3768
3769
3770
3771
3772
3773
3774
3775
3776
3777
3778
3779
3780
3781
3782
3783
3784
3785
3786
3787
3788
3789
3790
3791
3792
3793
3794
3795
3796
3797
3798
3799
3800
3801
3802
3803
3804
3805
3806
3807
3808
3809
3810
3811
3812
3813
3814
3815
3816
3817
3818
3819
3820
3821
3822
3823
3824
3825
3826
3827
3828
3829
3830
3831
3832
3833
3834
3835
3836
3837
3838
3839
3840
3841
3842
3843
3844
3845
3846
3847
3848
3849
3850
3851
3852
3853
3854
3855
3856
3857
3858
3859
3860
3861
3862
3863
3864
3865
3866
3867
3868
3869
3870
3871
3872
3873
3874
3875
3876
3877
3878
3879
3880
3881
3882
3883
3884
3885
3886
3887
3888
3889
3890
3891
3892
3893
3894
3895
3896
3897
3898
3899
3900
3901
3902
3903
3904
3905
3906
3907
3908
3909
3910
3911
3912
3913
3914
3915
3916
3917
3918
3919
3920
3921
3922
3923
3924
3925
3926
3927
3928
3929
3930
3931
3932
3933
3934
3935
3936
3937
3938
3939
3940
3941
3942
3943
3944
3945
3946
3947
3948
3949
3950
3951
3952
3953
3954
3955
3956
3957
3958
3959
3960
3961
3962
3963
3964
3965
3966
3967
3968
3969
3970
3971
3972
3973
3974
3975
3976
3977
3978
3979
3980
3981
3982
3983
3984
3985
3986
3987
3988
3989
3990
3991
3992
3993
3994
3995
3996
3997
3998
3999
4000
4001
4002
4003
4004
4005
4006
4007
4008
4009
4010
4011
4012
4013
4014
4015
4016
4017
4018
4019
4020
4021
4022
4023
4024
4025
4026
4027
4028
4029
4030
4031
4032
4033
4034
4035
4036
4037
4038
4039
4040
4041
4042
4043
4044
4045
4046
4047
4048
4049
4050
4051
4052
4053
4054
4055
4056
4057
4058
4059
4060
4061
4062
4063
4064
4065
4066
4067
4068
4069
4070
4071
4072
4073
4074
4075
4076
4077
4078
4079
4080
4081
4082
4083
4084
4085
4086
4087
4088
4089
4090
4091
4092
4093
4094
4095
4096
4097
4098
4099
4100
4101
4102
4103
4104
4105
4106
4107
4108
4109
4110
4111
4112
4113
4114
4115
4116
4117
4118
4119
4120
4121
4122
4123
4124
4125
4126
4127
4128
4129
4130
4131
4132
4133
4134
4135
4136
4137
4138
4139
4140
4141
4142
4143
4144
4145
4146
4147
4148
4149
4150
4151
4152
4153
4154
4155
4156
4157
4158
4159
4160
4161
4162
4163
4164
4165
4166
4167
4168
4169
4170
4171
4172
4173
4174
4175
4176
4177
4178
4179
4180
4181
4182
4183
4184
4185
4186
4187
4188
4189
4190
4191
4192
4193
4194
4195
4196
4197
4198
4199
4200
4201
4202
4203
4204
4205
4206
4207
4208
4209
4210
4211
4212
4213
4214
4215
4216
4217
4218
4219
4220
4221
4222
4223
4224
4225
4226
4227
4228
4229
4230
4231
4232
4233
4234
4235
4236
4237
4238
4239
4240
4241
4242
4243
4244
4245
4246
4247
4248
4249
4250
4251
4252
4253
4254
4255
4256
4257
4258
4259
4260
4261
4262
4263
4264
4265
4266
4267
4268
4269
4270
4271
4272
4273
4274
4275
4276
4277
4278
4279
4280
4281
4282
4283
4284
4285
4286
4287
4288
4289
4290
4291
4292
4293
4294
4295
4296
4297
4298
4299
4300
4301
4302
4303
4304
4305
4306
4307
4308
4309
4310
4311
4312
4313
4314
4315
4316
4317
4318
4319
4320
4321
4322
4323
4324
4325
4326
4327
4328
4329
4330
4331
4332
4333
4334
4335
4336
4337
4338
4339
4340
4341
4342
4343
4344
4345
4346
4347
4348
4349
4350
4351
4352
4353
4354
4355
4356
4357
4358
4359
4360
4361
4362
4363
4364
4365
4366
4367
4368
4369
4370
4371
4372
4373
4374
4375
4376
4377
4378
4379
4380
4381
4382
4383
4384
4385
4386
4387
4388
4389
4390
4391
4392
4393
4394
4395
4396
4397
4398
4399
4400
4401
4402
4403
4404
4405
4406
4407
4408
4409
4410
4411
4412
4413
4414
4415
4416
4417
4418
4419
4420
4421
4422
4423
4424
4425
4426
4427
4428
4429
4430
4431
4432
4433
4434
4435
4436
4437
4438
4439
4440
4441
4442
4443
4444
4445
4446
4447
4448
4449
4450
4451
4452
4453
4454
4455
4456
4457
4458
4459
4460
4461
4462
4463
4464
4465
4466
4467
4468
4469
4470
4471
4472
4473
4474
4475
4476
4477
4478
4479
4480
4481
4482
4483
4484
4485
4486
4487
4488
4489
4490
4491
4492
4493
4494
4495
4496
4497
4498
4499
4500
4501
4502
4503
4504
4505
4506
4507
4508
4509
4510
4511
4512
4513
4514
4515
4516
4517
4518
4519
4520
4521
4522
4523
4524
4525
4526
4527
4528
4529
4530
4531
4532
4533
4534
4535
4536
4537
4538
4539
4540
4541
4542
4543
4544
4545
4546
4547
4548
4549
4550
4551
4552
4553
4554
4555
4556
4557
4558
4559
4560
4561
4562
4563
4564
4565
4566
4567
4568
4569
4570
4571
4572
4573
4574
4575
4576
4577
4578
4579
4580
4581
4582
4583
4584
4585
4586
4587
4588
4589
4590
4591
4592
4593
4594
4595
4596
4597
4598
4599
4600
4601
4602
4603
4604
4605
4606
4607
4608
4609
4610
4611
4612
4613
4614
4615
4616
4617
4618
4619
4620
4621
4622
4623
4624
4625
4626
4627
4628
4629
4630
4631
4632
4633
4634
4635
4636
4637
4638
4639
4640
4641
4642
4643
4644
4645
4646
4647
4648
4649
4650
4651
4652
4653
4654
4655
4656
4657
4658
4659
4660
4661
4662
4663
4664
4665
4666
4667
4668
4669
4670
4671
4672
4673
4674
4675
4676
4677
4678
4679
4680
4681
4682
4683
4684
4685
4686
4687
4688
4689
4690
4691
4692
4693
4694
4695
4696
4697
4698
4699
4700
4701
4702
4703
4704
4705
4706
4707
4708
4709
4710
4711
4712
4713
4714
4715
4716
4717
4718
4719
4720
4721
4722
4723
4724
4725
4726
4727
4728
4729
4730
4731
4732
4733
4734
4735
4736
4737
4738
4739
4740
4741
4742
4743
4744
4745
4746
4747
4748
4749
4750
4751
4752
4753
4754
4755
4756
4757
4758
4759
4760
4761
4762
4763
4764
4765
4766
4767
4768
4769
4770
4771
4772
4773
4774
4775
4776
4777
4778
4779
4780
4781
4782
4783
4784
4785
4786
4787
4788
4789
4790
4791
4792
4793
4794
4795
4796
4797
4798
4799
4800
4801
4802
4803
4804
4805
4806
4807
4808
4809
4810
4811
4812
4813
4814
4815
4816
4817
4818
4819
4820
4821
4822
4823
4824
4825
4826
4827
4828
4829
4830
4831
4832
4833
4834
4835
4836
4837
4838
4839
4840
4841
4842
4843
4844
4845
4846
4847
4848
4849
4850
4851
4852
4853
4854
4855
4856
4857
4858
4859
4860
4861
4862
4863
4864
4865
4866
4867
4868
4869
4870
4871
4872
4873
4874
4875
4876
4877
4878
4879
4880
4881
4882
4883
4884
4885
4886
4887
4888
4889
4890
4891
4892
4893
4894
4895
4896
4897
4898
4899
4900
4901
4902
4903
4904
4905
4906
4907
4908
4909
4910
4911
4912
4913
4914
4915
4916
4917
4918
4919
4920
4921
4922
4923
4924
4925
4926
4927
4928
4929
4930
4931
4932
4933
4934
4935
4936
4937
4938
4939
4940
4941
4942
4943
4944
4945
4946
4947
4948
4949
4950
4951
4952
4953
4954
4955
4956
4957
4958
4959
4960
4961
4962
4963
4964
4965
4966
4967
4968
4969
4970
4971
4972
4973
4974
4975
4976
4977
4978
4979
4980
4981
4982
4983
4984
4985
4986
4987
4988
4989
4990
4991
4992
4993
4994
4995
4996
4997
4998
4999
5000
5001
5002
5003
5004
5005
5006
5007
5008
5009
5010
5011
5012
5013
5014
5015
5016
5017
5018
5019
5020
5021
5022
5023
5024
5025
5026
5027
5028
5029
5030
5031
5032
5033
5034
5035
5036
5037
5038
5039
5040
5041
5042
5043
5044
5045
5046
5047
5048
5049
5050
5051
5052
5053
5054
5055
5056
5057
5058
5059
5060
5061
5062
5063
5064
5065
5066
5067
5068
5069
5070
5071
5072
5073
5074
5075
5076
5077
5078
5079
5080
5081
5082
5083
5084
5085
5086
5087
5088
5089
5090
5091
5092
5093
5094
5095
5096
5097
5098
5099
5100
5101
5102
5103
5104
5105
5106
5107
5108
5109
5110
5111
5112
5113
5114
5115
5116
5117
5118
5119
5120
5121
5122
5123
5124
5125
5126
5127
5128
5129
5130
5131
5132
5133
5134
5135
5136
5137
5138
5139
5140
5141
5142
5143
5144
5145
5146
5147
5148
5149
5150
5151
5152
5153
5154
5155
5156
5157
5158
5159
5160
5161
5162
5163
5164
5165
5166
5167
5168
5169
5170
5171
5172
5173
5174
5175
5176
5177
5178
5179
5180
5181
5182
5183
5184
5185
5186
5187
5188
5189
5190
5191
5192
5193
5194
5195
5196
5197
5198
5199
5200
5201
5202
5203
5204
5205
5206
5207
5208
5209
5210
5211
5212
5213
5214
5215
5216
5217
5218
5219
5220
5221
5222
5223
5224
5225
5226
5227
5228
5229
5230
5231
5232
5233
5234
5235
5236
5237
5238
5239
5240
5241
5242
5243
5244
5245
5246
5247
5248
5249
5250
5251
5252
5253
5254
5255
5256
5257
5258
5259
5260
5261
5262
5263
5264
5265
5266
5267
5268
5269
5270
5271
5272
5273
5274
5275
5276
5277
5278
5279
5280
5281
5282
5283
5284
5285
5286
5287
5288
5289
5290
5291
5292
5293
5294
5295
5296
5297
5298
5299
5300
5301
5302
5303
5304
5305
5306
5307
5308
5309
5310
5311
5312
5313
5314
5315
5316
5317
5318
5319
5320
5321
5322
5323
5324
5325
5326
5327
5328
5329
5330
5331
5332
5333
5334
5335
5336
5337
5338
5339
5340
5341
5342
5343
5344
5345
5346
5347
5348
5349
5350
5351
5352
5353
5354
5355
5356
5357
5358
5359
5360
5361
5362
5363
5364
5365
5366
5367
5368
5369
5370
5371
5372
5373
5374
5375
5376
5377
5378
5379
5380
5381
5382
5383
5384
5385
5386
5387
5388
5389
5390
5391
5392
5393
5394
5395
5396
5397
5398
5399
5400
5401
5402
5403
5404
5405
5406
5407
5408
5409
5410
5411
5412
5413
5414
5415
5416
5417
5418
5419
5420
5421
5422
5423
5424
5425
5426
5427
5428
5429
5430
5431
5432
5433
5434
5435
5436
5437
5438
5439
5440
5441
5442
5443
5444
5445
5446
5447
5448
5449

5450
5451
5452
5453
5454
5455
5456
5457
5458
5459
5460
5461
5462
5463
5464
5465
5466
5467
5468
5469
5470
5471
5472
5473
5474
5475
5476
5477
5478
5479
5480
5481
5482
5483
5484
5485
5486
5487
5488
5489
5490
5491
5492
5493
5494
5495
5496
5497
5498
5499
5500
5501
5502
5503
5504
5505
5506
5507
5508
5509
5510
5511
5512
5513
5514
5515
5516
5517
5518
5519
5520
5521
5522
5523
5524
5525
5526
5527
5528
5529
5530
5531
5532
5533
5534
5535
5536
5537
5538
5539
5540
5541
5542
5543
5544
5545
5546
5547
5548
5549
5550
5551
5552
5553
5554
5555
5556
5557
5558
5559
5560
5561
5562
5563
5564
5565
5566
5567
5568
5569
5570
5571
5572
5573
5574
5575
5576
5577
5578
5579
5580
5581
5582
5583
5584
5585
5586
5587
5588
5589
5590
5591
5592
5593
5594
5595
5596
5597
5598
5599
5600
5601
5602
5603
5604
5605
5606
5607
5608
5609
5610
5611
5612
5613
5614
5615
5616
5617
5618
5619
5620
5621
5622
5623
5624
5625
5626
5627
5628
5629
5630
5631
5632
5633
5634
5635
5636
5637
5638
5639
5640
5641
5642
5643
5644
5645
5646
5647
5648
5649
5650
5651
5652
5653
5654
5655
5656
5657
5658
5659
5660
5661
5662
5663
5664
5665
5666
5667
5668
5669
5670
5671
5672
5673
5674
5675
5676
5677
5678
5679
5680
5681
5682
5683
5684
5685
5686
5687
5688
5689
5690
5691
5692
5693
5694
5695
5696
5697
5698
5699
5700
5701
5702
5703
5704
5705
5706
5707
5708
5709
5710
5711
5712
5713
5714
5715
5716
5717
5718
5719
5720
5721
5722
5723
5724
5725
5726
5727
5728
5729
5730
5731
5732
5733
5734
5735
5736
5737
5738
5739
5740
5741
5742
5743
5744
5745
5746
5747
5748
5749
5750
5751
5752
5753
5754
5755
5756
5757
5758
5759
5760
5761
5762
5763
5764
5765
5766
5767
5768
5769
5770
5771
5772
5773
5774
5775
5776
5777
5778
5779
5780
5781
5782
5783
5784
5785
5786
5787
5788
5789
5790
5791
5792
5793
5794
5795
5796
5797
5798
5799
5800
5801
5802
5803
5804
5805
5806
5807
5808
5809
5810
5811
5812
5813
5814
5815
5816
5817
5818
5819
5820
5821
5822
5823
5824
5825
5826
5827
5828
5829
5830
5831
5832
5833
5834
5835
5836
5837
5838
5839
5840
5841
5842
5843
5844
5845
5846
5847
5848
5849
5850
5851
5852
5853
5854
5855
5856
5857
5858
5859
5860
5861
5862
5863
5864
5865
5866
5867
5868
5869
5870
5871
5872
5873
5874
5875
5876
5877
5878
5879
5880
5881
5882
5883
5884
5885
5886
5887
5888
5889
5890
5891
5892
5893
5894
5895
5896
5897
5898
5899
5900
5901
5902
5903
5904
5905
5906
5907
5908
5909
5910
5911
5912
5913
5914
5915
5916
5917
5918
5919
5920
5921
5922
5923
5924
5925
5926
5927
5928
5929
5930
5931
5932
5933
5934
5935
5936
5937
5938
5939
5940
5941
5942
5943
5944
5945
5946
5947
5948
5949
5950
5951
5952
5953
5954
5955
5956
5957
5958
5959
5960
5961
5962
5963
5964
5965
5966
5967
5968
5969
5970
5971
5972
5973
5974
5975
5976
5977
5978
5979
5980
5981
5982
5983
5984
5985
5986
5987
5988
5989
5990
5991
5992
5993
5994
5995
5996
5997
5998
5999
6000
6001
6002
6003
6004
6005
6006
6007
6008
6009
6010
6011
6012
6013
6014
6015
6016
6017
6018
6019
6020
6021
6022
6023
6024
6025
6026
6027
6028
6029
6030
6031
6032
6033
6034
6035
6036
6037
6038
6039
6040
6041
6042
6043
6044
6045
6046
6047
6048
6049
6050
6051
6052
6053
6054
6055
6056
6057
6058
6059
6060
6061
6062
6063
6064
6065
6066
6067
6068
6069
6070
6071
6072
6073
6074
6075
6076
6077
6078
6079
6080
6081
6082
6083
6084
6085
6086
6087
6088
6089
6090
6091
6092
6093
6094
6095
6096
6097
6098
6099
6100
6101
6102
6103
6104
6105
6106
6107
6108
6109
6110
6111
6112
6113
6114
6115
6116
6117
6118
6119
6120
6121
6122
6123
6124
6125
6126
6127
6128
6129
6130
6131
6132
6133
6134
6135
6136
6137
6138
6139
6140
6141
6142
6143
6144
6145
6146
6147
6148
6149
6150
6151
6152
6153
6154
6155
6156
6157
6158
6159
6160
6161
6162
6163
6164
6165
6166
6167
6168
6169
6170
6171
6172
6173
6174
6175
6176
6177
6178
6179
6180
6181
6182
6183
6184
6185
6186
6187
6188
6189
6190
6191
6192
6193
6194
6195
6196
6197
6198
6199
6200
6201
6202
6203
6204
6205
6206
6207
6208
6209
6210
6211
6212
6213
6214
6215
6216
6217
6218
6219
6220
6221
6222
6223
6224
6225
6226
6227
6228
6229
6230
6231
6232
6233
6234
6235
6236
6237
6238
6239
6240
6241
6242
6243
6244
6245
6246
6247
6248
6249
6250
6251
6252
6253
6254
6255
6256
6257
6258
6259
6260
6261
6262
6263
6264
6265
6266
6267
6268
6269
6270
6271
6272
6273
6274
6275
6276
6277
6278
6279
6280
6281
6282
6283
6284
6285
6286
6287
6288
6289
6290
6291
6292
6293
6294
6295
6296
6297
6298
6299
6300
6301
6302
6303
6304
6305
6306
6307
6308
6309
6310
6311
6312
6313
6314
6315
6316
6317
6318
6319
6320
6321
6322
6323
6324
6325
6326
6327
6328
6329
6330
6331
6332
6333
6334
6335
6336
6337
6338
6339
6340
6341
6342
6343
6344
6345
6346
6347
6348
6349
6350
6351
6352
6353
6354
6355
6356
6357
6358
6359
6360
6361
6362
6363
6364
6365
6366
6367
6368
6369
6370
6371
6372
6373
6374
6375
6376
6377
6378
6379
6380
6381
6382
6383
6384
6385
6386
6387
6388
6389
6390
6391
6392
6393
6394
6395
6396
6397
6398
6399
6400
6401
6402
6403
6404
6405
6406
6407
6408
6409
6410
6411
6412
6413
6414
6415
6416
6417
6418
6419
6420
6421
6422
6423
6424
6425
6426
6427
6428
6429
6430
6431
6432
6433
6434
6435
6436
6437
6438
6439
6440
6441
6442
6443
6444
6445
6446
6447
6448
6449
6450
6451
6452
6453
6454
6455
6456
6457
6458
6459
6460
6461
6462
6463
6464
6465
6466
6467
6468
6469
6470
6471
6472
6473
6474
6475
6476
6477
6478
6479
6480
6481
6482
6483
6484
6485
6486
6487
6488
6489
6490
6491
6492
6493
6494
6495
6496
6497
6498
6499
6500
6501
6502
6503
6504
6505
6506
6507
6508
6509
6510
6511
6512
6513
6514
6515
6516
6517
6518
6519
6520
6521
6522
6523
6524
6525
6526
6527
6528
6529
6530
6531
6532
6533
6534
6535
6536
6537
6538
6539
6540
6541
6542
6543
6544
6545
6546
6547
6548
6549
6550
6551
6552
6553
6554
6555
6556
6557
6558
6559
6560
6561
6562
6563
6564
6565
6566
6567
6568
6569
6570
6571
6572
6573
6574
6575
6576
6577
6578
6579
6580
6581
6582
6583
6584
6585
6586
6587
6588
6589
6590
6591
6592
6593
6594
6595
6596
6597
6598
6599
6600
6601
6602
6603
6604
6605
6606
6607
6608
6609
6610
6611
6612
6613
6614
6615
6616
6617
6618
6619
6620
6621
6622
6623
6624
6625
6626
6627
6628
6629
6630
6631
6632
6633
6634
6635
6636
6637
6638
6639
6640
6641
6642
6643
6644
6645
6646
6647
6648
6649
6650
6651
6652
6653
6654
6655
6656
6657
6658
6659
6660
6661
6662
6663
6664
6665
6666
6667
6668
6669
6670
6671
6672
6673
6674
6675
6676
6677
6678
6679
6680
6681
6682
6683
6684
6685
6686
6687
6688
6689
6690
6691
6692
6693
6694
6695
6696
6697
6698
6699
6700
6701
6702
6703
6704
6705
6706
6707
6708
6709
6710
6711
6712
6713
6714
6715
6716
6717
6718
6719
6720
6721
6722
6723
6724
6725
6726
6727
6728
6729
6730
6731
6732
6733
6734
6735
6736
6737
6738
6739
6740
6741
6742
6743
6744
6745
6746
6747
6748
6749
6750
6751
6752
6753
6754
6755
6756
6757
6758
6759
6760
6761
6762
6763
6764
6765
6766
6767
6768
6769
6770
6771
6772
6773
6774
6775
6776
6777
6778
6779
6780
6781
6782
6783
6784
6785
6786
6787
6788
6789
6790
6791
6792
6793
6794
6795
6796
6797
6798
6799
6800
6801
6802
6803
6804
6805
6806
6807
6808
6809
6810
6811
6812
6813
6814
6815
6816
6817
6818
6819
6820
6821
6822
6823
6824
6825
6826
6827
6828
6829
6830
6831
6832
6833
6834
6835
6836
6837
6838
6839
6840
6841
6842
6843
6844
6845
6846
6847
6848
6849
6850
6851
6852
6853
6854
6855
6856
6857
6858
6859
6860
6861
6862
6863
6864
6865
6866
6867
6868
6869
6870
6871
6872
6873
6874
6875
6876
6877
6878
6879
6880
6881
6882
6883
6884
6885
6886
6887
6888
6889
6890
6891
6892
6893
6894
6895
6896
6897
6898
6899
6900
6901
6902
6903
6904
6905
6906
6907
6908
6909
6910
6911
6912
6913
6914
6915
6916
6917
6918
6919
6920
6921
6922
6923
6924
6925
6926
6927
6928
6929
6930
6931
6932
6933
6934
6935
6936
6937
6938
6939
6940
6941
6942
6943
6944
6945
6946
6947
6948
6949
6950
6951
6952
6953
6954
6955
6956
6957
6958
6959
6960
6961
6962
6963
6964
6965
6966
6967
6968
6969
6970
6971
6972
6973
6974
6975
6976
6977
6978
6979
6980
6981
6982
6983
6984
6985
6986
6987
6988
6989
6990
6991
6992
6993
6994
6995
6996
6997
6998
6999

In [439]:
print(df.iloc[0]['open_ai_prompt'])

Convert text to SQL.

DDL:
```
CREATE TABLE department (Department_ID int,Name text,Creation text,Ranking int,Budget_in_Billions real,Num_Employees real);CREATE TABLE head (head_ID int,name text,born_state text,age real);CREATE TABLE management (department_ID int,head_ID int,temporary_acting text);
```

Question:
"""How many acting statuses are there?"""
Answer:
SELECT count(DISTINCT temporary_acting) FROM management

Question:
"""List the name, born state and age of the heads of departments ordered by age."""
Answer:
SELECT name ,  born_state ,  age FROM head ORDER BY age

Question:
"""List the states where both the secretary of 'Treasury' department and the secretary of 'Homeland Security' were born."""
Answer:
SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Homeland Security'

Question:
"""How many heads of the departments are older than 56 ?"""
Answer:

In [440]:
tmp = df.sample(100)
tmp['model_response'] = ''

data = []
for idx, row in tmp.iterrows():
    print(idx)
    if row['model_response'] != '':
        print('already completed')
        data.append(row['model_response'])
        continue
    
    print(row['open_ai_completion'])
    new_response = call_raw_model(row)
    data.append(new_response)
    tmp.loc[idx,'model_response'] = new_response

265
 SELECT RESULT FROM musical GROUP BY RESULT ORDER BY COUNT(*) DESC LIMIT 1

SELECT RESULT FROM musical GROUP BY RESULT ORDER BY COUNT(*) DESC LIMIT 1
6957
 SELECT name FROM mill WHERE name LIKE '%Moulin%'

SELECT name FROM mill WHERE name LIKE '%Moulin%'
5797
 SELECT complaint_status_code FROM complaints GROUP BY complaint_status_code HAVING count(*)  >  3

SELECT complaint_status_code, COUNT(*) FROM complaints GROUP BY complaint_status_code HAVING COUNT(*) > 3
5082
 SELECT Shop_Name FROM shop WHERE Shop_ID NOT IN (SELECT Shop_ID FROM stock)

SELECT Shop_Name FROM shop WHERE Shop_ID NOT IN (SELECT Shop_ID FROM stock)
1337
 SELECT count(DISTINCT s_id) FROM advisor

SELECT count(*) FROM advisor
6731
 SELECT count(*) FROM Faculty WHERE Rank  =  "Professor" AND building  =  "NEB"

SELECT count(*) FROM Faculty WHERE building  =  "NEB" AND rank  =  "Professor"
6672
 SELECT customer_status_code , count(*) FROM Customers GROUP BY customer_status_code;

SELECT customer_status_code ,  count(*) FROM Customers GROUP BY customer_status_code;
3207
 SELECT count(*) ,  T3.school_code FROM CLASS AS T1 JOIN course AS T2 ON T1.crs_code  =  T2.crs_code JOIN department AS T3 ON T2.dept_code  =  T3.dept_code GROUP BY T3.school_code

SELECT SCHOOL_CODE, COUNT(*) FROM DEPARTMENT AS T1 JOIN CLASS AS T2 ON T1.DEPT_CODE  =  T2.DEPT_CODE GROUP BY SCHOOL_CODE
4319
 SELECT avg(t3.age) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t1.clubname  =  "Tennis Club"

SELECT AVG(t3.age) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t1.clubname  =  "Tennis Club"
997
 SELECT enrollment ,  primary_conference FROM university ORDER BY founded LIMIT 1

SELECT enrollment ,  primary_conference FROM university ORDER BY founded LIMIT 1
472
 SELECT StuID FROM Student WHERE Sex  =  'M'

SELECT StuID FROM Student WHERE Sex = 'M'
1956
 SELECT LOCATION FROM cinema WHERE capacity  >  300 GROUP BY LOCATION HAVING count(*)  >  1

SELECT LOCATION FROM cinema WHERE capacity  >  300 GROUP BY LOCATION HAVING COUNT(*)  >  1
651
 SELECT Name ,  Age FROM editor

SELECT Name, Age FROM editor
2538
 SELECT min(Crime_rate) ,  max(Crime_rate) FROM county_public_safety

SELECT MIN(Crime_rate), MAX(Crime_rate) FROM county_public_safety;
838
 SELECT T1.Name FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId GROUP BY T2.MediaTypeId ORDER BY COUNT(*) ASC LIMIT 1

SELECT T1.Name FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId GROUP BY T2.MediaTypeId ORDER BY COUNT(*) ASC LIMIT 1
963
 SELECT T1.id ,  T1.trade_name FROM medicine AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.medicine_id  =  T1.id GROUP BY T1.id HAVING COUNT(*)  >=  3

SELECT T1.id ,  T1.Trade_Name FROM medicine AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.medicine_id  =  T1.id GROUP BY T1.id HAVING count(*)  >=  3
5829
 SELECT College FROM submission GROUP BY College ORDER BY COUNT(*) DESC LIMIT 1

SELECT College, COUNT(*) FROM submission GROUP BY College ORDER BY COUNT(*) DESC LIMIT 1
6073
 SELECT customer_name FROM customers WHERE customer_name LIKE "%Alex%"

SELECT customer_name FROM customers WHERE customer_name LIKE "%Alex%"
2110
 SELECT Roles.role_description , count(Employees.employee_id) FROM ROLES JOIN Employees ON Employees.role_code = Roles.role_code GROUP BY Employees.role_code HAVING count(Employees.employee_id)  >  1;

SELECT role_description, COUNT(employee_id) FROM Roles JOIN Employees ON Roles.role_code = Employees.role_code GROUP BY role_description HAVING COUNT(employee_id) > 1;
4746
 SELECT product_type_code ,  max(product_price) ,  min(product_price) FROM products GROUP BY product_type_code

SELECT product_type_code, MAX(product_price) AS max_price, MIN(product_price) AS min_price FROM products GROUP BY product_type_code
4082
 SELECT classroom ,  count(DISTINCT grade) FROM list GROUP BY classroom

SELECT classroom, COUNT(DISTINCT grade) FROM list GROUP BY classroom
6447
 SELECT document_id FROM Documents_with_expenses WHERE budget_type_code  =  'SF'

SELECT document_id FROM Documents_with_Expenses WHERE budget_type_code  =  'SF'
3776
 SELECT login_name ,  family_name FROM Course_Authors_and_Tutors

SELECT login_name, family_name FROM Course_Authors_and_Tutors
3164
 SELECT count(*) ,  t1.network_name ,  t1.services FROM station AS t1 JOIN route AS t2 ON t1.id  =  t2.station_id GROUP BY t2.station_id

SELECT t2.network_name ,  t2.services ,  COUNT(t1.train_id) AS num_trains FROM route AS t1 JOIN station AS t2 ON t1.station_id  =  t2.id GROUP BY t1.station_id
6501
 SELECT T3.ssn ,  T3.name FROM assignedto AS T1 JOIN projects AS T2 ON T1.project  =  T2.code JOIN scientists AS T3 ON T1.scientist  =  T3.SSN WHERE T2.hours  =  (SELECT max(hours) FROM projects)

SELECT s.ssn, s.name
FROM Scientists s
INNER JOIN AssignedTo a ON s.ssn = a.scientist
INNER JOIN Projects p ON a.project = p.code
WHERE p.hours = (SELECT MAX(hours) FROM Projects)
6544
 SELECT T2.Name ,   T2.Score FROM GRAPES AS T1 JOIN WINE AS T2 ON T1.Grape  =  T2.Grape WHERE T1.Color  =  "White"

SELECT Name, Score FROM GRAPES AS T1 JOIN WINE AS T2 ON T1.GRAPE  =  T2.GRAPE WHERE T1.Color  =  "White"
4771
 SELECT supplier_id FROM Product_Suppliers GROUP BY supplier_id HAVING avg(total_amount_purchased)  >  50000 OR avg(total_amount_purchased)  <  30000

SELECT supplier_id FROM Product_Suppliers GROUP BY supplier_id HAVING avg(total_amount_purchased)  >  50000 OR avg(total_amount_purchased)  <  30000
5860
 SELECT lot_details ,  investor_id FROM LOTS

SELECT lot_details, investor_id FROM Lots
112
 SELECT name FROM station WHERE lat  <  37.5

SELECT name FROM station WHERE lat < 37.5
1156
 SELECT T2.Name FROM body_builder AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID

SELECT Name FROM people
667
 SELECT count(*) FROM Accounts

SELECT count(*) FROM Accounts
6826
 SELECT count(*) FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid WHERE T1.name  =  'American Airlines'

SELECT count(*) FROM routes AS T1 JOIN airlines AS T2 ON T1.alid  =  T2.alid WHERE T2.name  =  'American Airlines'
5504
 SELECT Major FROM STUDENT GROUP BY Major HAVING COUNT(*)  <  3

SELECT Major FROM STUDENT GROUP BY Major HAVING COUNT(*) < 3
399
 SELECT flno FROM Flight ORDER BY distance ASC LIMIT 3

SELECT flno FROM Flight ORDER BY distance LIMIT 3
1592
 SELECT account_id FROM Financial_transactions GROUP BY account_id ORDER BY count(*) DESC LIMIT 1

SELECT T1.account_id FROM Financial_transactions AS T1 JOIN (SELECT account_id, COUNT(*) AS num_transactions FROM Financial_transactions GROUP BY account_id ORDER BY num_transactions DESC LIMIT 1) AS T2 ON T1.account_id = T2.account_id
1177
 SELECT min(Vote_Percent) ,  max(Vote_Percent) FROM election

SELECT MIN(Vote_Percent) AS Min_Vote_Percent, MAX(Vote_Percent) AS Max_Vote_Percent FROM election;
5664
 SELECT T2.customer_name ,  T3.city ,  T1.date_from ,  T1.date_to FROM customer_address_history AS T1 JOIN customers AS T2 ON T1.customer_id  =  T2.customer_id JOIN addresses AS T3 ON T1.address_id  =  T3.address_id

SELECT T1.customer_name ,  T2.city ,  T3.date_from ,  T3.date_to FROM customers AS T1 JOIN addresses AS T2 ON T1.customer_address  =  T2.address_id JOIN customer_address_history AS T3 ON T1.customer_id  =  T3.customer_id
4160
 SELECT count(*) FROM Ref_calendar

SELECT COUNT(*) FROM Ref_Calendar
4632
 SELECT DISTINCT address_type_code FROM customer_addresses

SELECT DISTINCT address_type_code FROM customer_addresses
1985
 SELECT Carrier FROM phone GROUP BY Carrier ORDER BY COUNT(*) DESC LIMIT 1

SELECT Carrier, COUNT(Carrier) AS Frequency FROM phone GROUP BY Carrier ORDER BY Frequency DESC LIMIT 1
3545
 SELECT count(*) FROM files WHERE duration LIKE "4:%"

SELECT count(*) FROM files WHERE duration LIKE "4:%"
4783
 SELECT order_id ,  customer_id FROM customer_orders WHERE order_status_code  =   "Cancelled" ORDER BY order_date

SELECT order_id, customer_id FROM Customer_Orders WHERE order_status_code = 'Cancelled' ORDER BY order_date
3351
 SELECT name FROM club ORDER BY Start_year ASC

SELECT name FROM club ORDER BY Start_year ASC
989
 SELECT t1.Primary_conference FROM university AS t1 JOIN basketball_match AS t2 ON t1.school_id  =  t2.school_id ORDER BY t2.acc_percent LIMIT 1

SELECT primary_conference FROM university u JOIN basketball_match bm ON u.school_id = bm.school_id ORDER BY bm.acc_percent ASC LIMIT 1
5579
 SELECT unit_of_measure FROM ref_product_categories WHERE product_category_code  =  "Herbs"

SELECT unit_of_measure FROM ref_product_categories WHERE product_category_description  =  "Herb"
1270
 SELECT T2.apt_number FROM Apartment_Bookings AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.booking_status_code  =  "Confirmed" INTERSECT SELECT T2.apt_number FROM Apartment_Bookings AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.booking_status_code  =  "Provisional"

SELECT Apartments.apt_number
FROM Apartments
INNER JOIN Apartment_Bookings
ON Apartments.apt_id = Apartment_Bookings.apt_id
WHERE Apartment_Bookings.booking_status_code = "Provisional"
OR Apartment_Bookings.booking_status_code = "Confirmed"
1542
 SELECT claim_status_description FROM claims_processing_stages WHERE claim_status_name  =  "Open"

SELECT claim_status_description FROM claims_processing_stages WHERE claim_status_name  =  "Open"
6736
 SELECT building ,  count(*) FROM Faculty GROUP BY building

SELECT T1.building, count(*) FROM Faculty AS T1 GROUP BY T1.building
323
 SELECT catalog_entry_name FROM catalog_contents ORDER BY height DESC LIMIT 1

SELECT catalog_entry_name FROM catalog_contents ORDER BY height DESC LIMIT 1
56
 SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1

SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id ORDER BY count(*) DESC LIMIT 1;
6997
 SELECT T1.title ,  T3.book_title FROM movie AS T1 JOIN culture_company AS T2 ON T1.movie_id  =  T2.movie_id JOIN book_club AS T3 ON T3.book_club_id  =  T2.book_club_id WHERE T2.incorporated_in  =  'China'

SELECT b.Book_Title, m.Title FROM book_club b JOIN culture_company c ON b.book_club_id = c.book_club_id JOIN movie m ON c.movie_id = m.movie_id WHERE c.Incorporated_in = 'China'
2762
 SELECT count(DISTINCT T2.Delegate) FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District WHERE T1.Population  >  50000

SELECT COUNT(DISTINCT Delegate) FROM election
INNER JOIN county ON election.Counties_Represented = county.County_name
WHERE Population > 50000
6773
 SELECT FacID FROM Faculty_participates_in INTERSECT SELECT advisor FROM Student

SELECT DISTINCT T1.FacID FROM Faculty AS T1 JOIN Faculty_participates_in AS T2 ON T1.facID  =  T2.facID JOIN Student AS T3 ON T1.FacID  =  T3.Advisor
3901
 SELECT head FROM department GROUP BY departmentID ORDER BY count(departmentID) LIMIT 1;

SELECT T1.head FROM department AS T1 JOIN affiliated_with AS T2 ON T1.departmentid = T2.department GROUP BY T1.head ORDER BY COUNT(*) ASC LIMIT 1
3877
 SELECT Date_Claim_Made ,  Date_Claim_Settled FROM Settlements

SELECT T1.Date_Claim_Made, T1.Date_Claim_Settled FROM Settlements AS T1 JOIN Claims AS T2 ON T1.Claim_ID = T2.Claim_ID
5957
 SELECT T2.Name FROM Locations AS T1 JOIN Tourist_Attractions AS T2 ON T1.Location_ID  =  T2.Location_ID WHERE T1.Address  =  "660 Shea Crescent" OR T2.How_to_Get_There  =  "walk"

SELECT Name FROM Tourist_Attractions WHERE How_to_Get_There  =  "Walk" OR Address  =  "660 Shea Crescent"
3265
 SELECT stu_fname ,  stu_lname ,  stu_gpa FROM student WHERE stu_gpa  >  3 ORDER BY stu_dob DESC LIMIT 1

SELECT stu_fname, stu_lname, stu_gpa FROM student WHERE stu_gpa > 3 ORDER BY stu_dob ASC LIMIT 1
2835
 SELECT Fname , Lname FROM Student WHERE Age  >  18 AND Major != 600 AND Sex = 'F';

SELECT Fname, Lname FROM Student WHERE Sex = 'F' AND Age > 18 AND Major != 600;
5831
 SELECT College FROM submission WHERE Scores  >  90 INTERSECT SELECT College FROM submission WHERE Scores  <  80

SELECT College FROM submission WHERE Scores > 90 OR Scores < 80 GROUP BY College HAVING COUNT(*) > 1
3455
 SELECT country_id ,  COUNT(*) FROM locations GROUP BY country_id

SELECT country_id, COUNT(city) FROM locations GROUP BY country_id
6014
 SELECT StuID ,  count(*) ,  sum(gamesplayed) FROM Sportsinfo GROUP BY StuID

SELECT StuID, SUM(GamesPlayed) as TotalGames, SUM(HoursPerWeek) as TotalHours FROM SportsInfo GROUP BY StuID
118
 SELECT avg(lat) ,  avg(long) FROM station WHERE city  =  "San Jose"

SELECT AVG(lat), AVG(long) FROM station WHERE city = 'San Jose'
2771
 SELECT T2.Comptroller FROM election AS T1 JOIN party AS T2 ON T1.Party  =  T2.Party_ID WHERE T1.District  =  1 OR T1.District  =  2

SELECT T2.Comptroller FROM election AS T1 JOIN party AS T2 ON T1.Party  =  T2.Party_ID WHERE T1.District  IN  (1,2) GROUP BY T2.Comptroller
5325
 SELECT name ,  price FROM products

SELECT name ,  price FROM products
1734
 SELECT T1.club_id ,  T1.club_name, count(*) FROM club AS T1 JOIN coach AS T2 ON T1.club_id  =  T2.club_id GROUP BY T1.club_id

SELECT T1.club_id ,  T1.club_name, count(*) FROM club AS T1 JOIN coach AS T2 ON T1.club_id  =  T2.club_id GROUP BY T1.club_id
4610
 SELECT T3.Festival_Name FROM nomination AS T1 JOIN artwork AS T2 ON T1.Artwork_ID  =  T2.Artwork_ID JOIN festival_detail AS T3 ON T1.Festival_ID  =  T3.Festival_ID WHERE T2.Type  =  "Program Talent Show"

SELECT T3.Festival_Name FROM nomination AS T1 JOIN artwork AS T2 ON T1.Artwork_ID  =  T2.Artwork_ID JOIN festival_detail AS T3 ON T1.Festival_ID  =  T3.Festival_ID WHERE T2.Type = 'Program Talent Show'
980
 SELECT school ,  LOCATION FROM university WHERE affiliation  =  'Public'

SELECT school ,  LOCATION FROM university WHERE affiliation  =  'Public'
3640
 SELECT YEAR ,  avg(attendance) FROM home_game GROUP BY YEAR;

SELECT T1.year, avg(T1.attendance) FROM home_game AS T1 GROUP BY T1.year;
5216
 SELECT instrument FROM instruments AS T1 JOIN Band AS T2 ON T1.bandmateid  =  T2.id WHERE T2.lastname  =  "Heilo"

SELECT instrument FROM Instruments AS T1 JOIN Band AS T2 ON T1.BandmateId = T2.Id WHERE T2.Lastname = 'Heilo';
3398
 SELECT name ,  open_year FROM manufacturer WHERE num_of_shops  >  10 OR Num_of_Factories  <  10

SELECT name ,  open_year FROM manufacturer WHERE num_of_factories  <  10 OR num_of_shops  >  10
6868
 SELECT T1.country ,  T1.name ,  count(*) FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid GROUP BY T1.country ,  T1.name

SELECT count(*), T1.country, T2.name FROM routes AS T1 JOIN airlines AS T2 ON T1.alid = T2.alid GROUP BY T1.country, T2.name
499
 SELECT advisor ,  count(*) FROM Student GROUP BY advisor

SELECT advisor, COUNT(*) FROM Student GROUP BY advisor
320
 SELECT t2.catalog_level_name FROM catalog_contents AS t1 JOIN catalog_structure AS t2 ON t1.catalog_level_number  =  t2.catalog_level_number ORDER BY t1.price_in_dollars LIMIT 1

SELECT c.catalog_level_name FROM Catalog_Structure c INNER JOIN Catalog_Contents cc ON c.catalog_level_number = cc.catalog_level_number WHERE price_in_dollars = (SELECT MIN(price_in_dollars) FROM Catalog_Contents)
1092
 SELECT Country_name ,  COUNT(*) FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country GROUP BY T1.Country_name

SELECT T1.Country_name, COUNT(T2.Player) FROM country AS T1 JOIN match_season AS T2 ON T1.Country_id  =  T2.Country GROUP BY T1.Country_name
6502
 SELECT T3.ssn ,  T3.name FROM assignedto AS T1 JOIN projects AS T2 ON T1.project  =  T2.code JOIN scientists AS T3 ON T1.scientist  =  T3.SSN WHERE T2.hours  =  (SELECT max(hours) FROM projects)

SELECT T3.SSN, T3.name FROM assignedto AS T1 JOIN projects AS T2 ON T1.project  =  T2.code JOIN scientists AS T3 ON T1.scientist  =  T3.SSN WHERE T2.hours = (SELECT MAX(hours) FROM projects)
3783
 SELECT count(course_id) FROM Student_Course_Enrolment

SELECT COUNT(DISTINCT course_id) FROM Student_Course_Enrolment
3805
 SELECT T1.address_line_1 FROM Course_Authors_and_Tutors AS T1 JOIN Courses AS T2 ON T1.author_id  =  T2.author_id WHERE T2.course_name  =  "operating system" OR T2.course_name  =  "data structure"

SELECT T1.address_line_1 FROM Course_Authors_and_Tutors AS T1 JOIN Courses AS T2 ON T1.author_id  =  T2.author_id JOIN Subjects AS T3 ON T2.subject_id  =  T3.subject_id WHERE T3.subject_name  =  "operating system" OR T3.subject_name  =  "data structure"
3745
 SELECT t1.name FROM channel AS t1 JOIN broadcast AS t2 ON t1.channel_id  =  t2.channel_id WHERE t2.time_of_day  =  'Morning'

SELECT c.name
FROM channel c
INNER JOIN broadcast b
ON c.Channel_ID = b.Channel_ID
WHERE b.Time_of_day = 'morning'
5107
 SELECT Marketing_Region_Descriptrion FROM Marketing_Regions WHERE Marketing_Region_Name  =  "China"

SELECT Marketing_Region_Descriptrion FROM Marketing_Regions WHERE Marketing_Region_Name  =  "China"
4252
 SELECT clubname FROM club

SELECT clubname FROM club
1580
 SELECT count(*) ,  account_id FROM Financial_transactions

SELECT T1.account_id ,  count(*) FROM Financial_transactions AS T1 GROUP BY T1.account_id
3144
 SELECT T1.part_name FROM Parts AS T1 JOIN Part_Faults AS T2 ON T1.part_id  =  T2.part_id GROUP BY T1.part_name ORDER BY count(*) ASC LIMIT 1

SELECT T1.part_name FROM Parts AS T1 JOIN Asset_Parts AS T2 ON T1.part_id  =  T2.part_id JOIN Part_Faults AS T3 ON T2.part_id  =  T3.part_id GROUP BY T1.part_name ORDER BY count(*) ASC LIMIT 1
657
 SELECT DISTINCT Theme FROM journal

SELECT DISTINCT Theme FROM journal
866
 SELECT COUNT(*) FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId WHERE T1.Name  =  "AAC audio file"

SELECT COUNT(TrackId) FROM MEDIATYPE AS T1 JOIN TRACK AS T2 ON T1.MediaTypeId  =  T2.MediaTypeId WHERE T1.Name  =  "AAC audio file"
5949
 SELECT How_to_Get_There ,  COUNT(*) FROM Tourist_Attractions GROUP BY How_to_Get_There

SELECT How_to_Get_There , COUNT(*) FROM TOURIST_ATTRACTIONS GROUP BY How_to_Get_There
87
 SELECT student_id FROM student_course_attendance WHERE course_id  =  301

SELECT student_id FROM student_course_registrations WHERE course_id = 301
2472
 SELECT T3.name ,  T2.title ,  T1.stars ,  T1.ratingDate FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID ORDER BY T3.name ,  T2.title ,  T1.stars

SELECT T3.name, T2.title, T1.stars, T1.ratingDate FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID JOIN Reviewer AS T3 ON T1.rID  =  T3.rID ORDER BY T3.name, T2.title, T1.stars
6229
 SELECT name ,  CLASS ,  rank FROM captain

SELECT name, class, rank FROM captain
4052
 SELECT lastname FROM teachers WHERE classroom  =  109

SELECT lastname FROM teachers WHERE classroom  =  109
4961
 SELECT count(DISTINCT pPos) FROM tryout

SELECT DISTINCT pPos FROM Tryout
6460
 SELECT document_id FROM Documents WHERE document_type_code  =  "CV" EXCEPT SELECT document_id FROM Documents_with_expenses

SELECT Document_ID FROM Documents AS T1 LEFT JOIN Documents_with_Expenses AS T2 ON T1.Document_ID = T2.Document_ID WHERE T1.Document_Type_Code = 'CV' AND T2.Budget_Type_Code IS NULL
2700
 SELECT name ,  dates_active ,  number_deaths FROM storm WHERE number_deaths  >=  1

SELECT T1.name, T1.dates_active, T1.number_deaths FROM storm AS T1 WHERE T1.number_deaths  >=  1
1442
 SELECT id FROM instructor EXCEPT SELECT id FROM teaches

SELECT ID FROM instructor WHERE ID NOT IN (SELECT DISTINCT ID FROM teaches)
2487
 SELECT T1.title ,  T1.director FROM Movie AS T1 JOIN Movie AS T2 ON T1.director  =  T2.director WHERE T1.title != T2.title ORDER BY T1.director ,  T1.title

SELECT T1.director, T1.title FROM Movie AS T1 JOIN (SELECT director, COUNT(*) AS num_movies FROM Movie GROUP BY director HAVING num_movies > 1) AS T2 ON T1.director  =  T2.director
659
 SELECT T2.Name ,  T3.Theme FROM journal_committee AS T1 JOIN editor AS T2 ON T1.Editor_ID  =  T2.Editor_ID JOIN journal AS T3 ON T1.Journal_ID  =  T3.Journal_ID

SELECT e.Name, j.Theme FROM journal_committee jc
INNER JOIN editor e ON jc.Editor_ID = e.Editor_ID
INNER JOIN journal j ON jc.Journal_ID = j.Journal_ID
2919
 SELECT fname FROM authors ORDER BY fname

SELECT DISTINCT t1.fname FROM authors AS t1 ORDER BY t1.fname ASC
1474
 SELECT DISTINCT name FROM  instructor ORDER BY name

SELECT DISTINCT name FROM instructor ORDER BY name
3627
 SELECT DISTINCT artist_name FROM artist WHERE country  =  "Bangladesh" EXCEPT SELECT DISTINCT artist_name FROM song WHERE rating  >  7

SELECT T1.artist_name FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T1.country  =  "Bangladesh" AND T2.rating  <=  7
6934
 SELECT invoice_number FROM invoices WHERE invoice_date < "1989-09-03" OR invoice_date > "2007-12-25"

SELECT invoice_number FROM invoices WHERE invoice_date < '1989-09-03' OR invoice_date > '2007-12-25'
3752
 SELECT name FROM program EXCEPT SELECT t1.name FROM program AS t1 JOIN broadcast AS t2 ON t1.program_id  =  t2.program_id WHERE t2.Time_of_day  =  "Morning"

SELECT Name FROM program WHERE Program_ID NOT IN (SELECT Program_ID FROM broadcast WHERE Time_of_day = 'morning')

In [441]:
tmp[~(tmp['model_response'] == '')].shape

(100, 17)

In [442]:
tmp[~(tmp['model_response'].isna())].shape

(100, 17)

In [443]:
tmp['open_ai_execution'] = tmp.apply(lambda x: execution(x, 'open_ai_completion'), axis=1)
tmp['model_response_execution'] = tmp.apply(lambda x: execution(x, 'model_response'), axis=1)
tmp['execution_accuracy'] = np.where(tmp['open_ai_execution'] == tmp['model_response_execution'], 1, 0)
tmp[~(tmp['model_response'] == '') & ~(tmp['model_response'].isna())]['execution_accuracy'].mean()

0.72

In [444]:
i = 1
print(tmp[~(tmp['model_response'] == '') & 
                 (tmp['execution_accuracy'] == 0)].iloc[i]['open_ai_prompt'])
print(tmp[~(tmp['model_response'] == '') & 
                 (tmp['execution_accuracy'] == 0)].iloc[i]['open_ai_completion'])
print(tmp[~(tmp['model_response'] == '') & 
                 (tmp['execution_accuracy'] == 0)].iloc[i]['model_response'])

Convert text to SQL.

DDL:
```
CREATE TABLE CLASS (CLASS_CODE varchar(5) ,CRS_CODE varchar(10),CLASS_SECTION varchar(2),CLASS_TIME varchar(20),CLASS_ROOM varchar(8),PROF_NUM int);CREATE TABLE COURSE (CRS_CODE varchar(10) ,DEPT_CODE varchar(10),CRS_DESCRIPTION varchar(35),CRS_CREDIT float(8));CREATE TABLE DEPARTMENT (DEPT_CODE varchar(10) ,DEPT_NAME varchar(30),SCHOOL_CODE varchar(8),EMP_NUM int,DEPT_ADDRESS varchar(20),DEPT_EXTENSION varchar(4));CREATE TABLE EMPLOYEE (EMP_NUM int ,EMP_LNAME varchar(15),EMP_FNAME varchar(12),EMP_INITIAL varchar(1),EMP_JOBCODE varchar(5),EMP_HIREDATE datetime,EMP_DOB datetime);CREATE TABLE ENROLL (CLASS_CODE varchar(5),STU_NUM int,ENROLL_GRADE varchar(50));CREATE TABLE PROFESSOR (EMP_NUM int,DEPT_CODE varchar(10),PROF_OFFICE varchar(50),PROF_EXTENSION varchar(4),PROF_HIGH_DEGREE varchar(5));CREATE TABLE STUDENT (STU_NUM int ,STU_LNAME varchar(15),STU_FNAME varchar(15),STU_INIT varchar(1),STU_DOB datetime,STU_HRS int,STU_CLASS varchar(2),STU_GPA float(8),STU_TRANSFER numeric,DEPT_CODE varchar(18),STU_PHONE varchar(4),PROF_NUM int);
```

Question:
"""What are the first and last name of all biology professors?"""
Answer:
SELECT T3.EMP_FNAME ,  T3.EMP_LNAME FROM professor AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code JOIN employee AS T3 ON T1.EMP_NUM  =  T3.EMP_NUM WHERE DEPT_NAME  =  "Biology"

Question:
"""Find the first names of all instructors who have taught some course and the course code."""
Answer:
SELECT T2.emp_fname ,  T1.crs_code FROM CLASS AS T1 JOIN employee AS T2 ON T1.prof_num  =  T2.emp_num

Question:
"""Find the first names of professors who are teaching more than one class."""
Answer:
SELECT T2.emp_fname FROM CLASS AS T1 JOIN employee AS T2 ON T1.prof_num  =  T2.emp_num GROUP BY T1.prof_num HAVING count(*)  >  1

Question:
"""Find the number of classes in each school."""
Answer:

 SELECT count(*) ,  T3.school_code FROM CLASS AS T1 JOIN course AS T2 ON T1.crs_code  =  T2.crs_code JOIN department AS T3 ON T2.dept_code  =  T3.dept_code GROUP BY T3.school_code

SELECT SCHOOL_CODE, COUNT(*) FROM DEPARTMENT AS T1 JOIN CLASS AS T2 ON T1.DEPT_CODE  =  T2.DEPT_CODE GROUP BY SCHOOL_CODE

In [445]:
df_3_examples = tmp.copy()

In [416]:
df_0_examples[~(df_0_examples['model_response'] == '') & 
              ~(df_0_examples['model_response'].isna())]['execution_accuracy'].mean()

0.16

In [426]:
df_1_examples[~(df_1_examples['model_response'] == '') & 
              ~(df_1_examples['model_response'].isna())]['execution_accuracy'].mean()

0.64

In [436]:
df_2_examples[~(df_2_examples['model_response'] == '') & 
              ~(df_2_examples['model_response'].isna())]['execution_accuracy'].mean()

0.67

In [446]:
df_3_examples[~(df_3_examples['model_response'] == '') & 
              ~(df_3_examples['model_response'].isna())]['execution_accuracy'].mean()

0.72

In [414]:
df_6_examples[~(df_6_examples['model_response'] == '') & 
              ~(df_6_examples['model_response'].isna())]['execution_accuracy'].mean()

0.7

In [402]:
df_db_rand.head()

,db_id,query,query_toks,query_toks_no_value,question,question_toks,sql,schema,question-1,completion-1,question-2,completion-2,open_ai_prompt,open_ai_completion,model_response,open_ai_execution,model_response_execution,execution_accuracy
3073,loan_1,"SELECT DISTINCT T1.cust_name , T1.credit_scor...","[SELECT, DISTINCT, T1.cust_name, ,, T1.credit_...","[select, distinct, t1, ., cust_name, ,, t1, .,...",What are the different names and credit scores...,"[What, are, the, different, names, and, credit...","{'from': {'table_units': [['table_unit', 1], [...","CREATE TABLE bank (branch_ID int ,bname varcha...",Find the names of bank branches that have prov...,SELECT T2.bname FROM loan AS T1 JOIN bank AS T...,What are the total account balances for each c...,SELECT sum(acc_bal) FROM customer WHERE state ...,\nConvert text to SQL.\n\nDDL:\n```\nCREATE TA...,"SELECT DISTINCT T1.cust_name , T1.credit_sco...","SELECT cust_name, credit_score FROM customer J...","[(Mary, 30), (Owen, 210)]","[(Mary, 30), (Mary, 30), (Owen, 210)]",0
2310,perpetrator,SELECT T1.Name FROM people AS T1 JOIN perpetra...,"[SELECT, T1.Name, FROM, people, AS, T1, JOIN, ...","[select, t1, ., name, from, people, as, t1, jo...",What are the names of perpetrators whose count...,"[What, are, the, names, of, perpetrators, whos...","{'from': {'table_units': [['table_unit', 1], [...","CREATE TABLE perpetrator (Perpetrator_ID int,P...",Show the countries that have both perpetrators...,SELECT Country FROM perpetrator WHERE Injured ...,What are the countries of perpetrators? Show e...,"SELECT Country , COUNT(*) FROM perpetrator GR...",\nConvert text to SQL.\n\nDDL:\n```\nCREATE TA...,SELECT T1.Name FROM people AS T1 JOIN perpetr...,SELECT Name FROM people JOIN perpetrator ON pe...,"[(Ron Baxter,), (Rob Cunningham,), (Henry John...","[(Ron Baxter,), (Rob Cunningham,), (Henry John...",1
1543,insurance_and_eClaims,SELECT count(DISTINCT claim_outcome_code) FROM...,"[SELECT, count, (, DISTINCT, claim_outcome_cod...","[select, count, (, distinct, claim_outcome_cod...",How many distinct claim outcome codes are there?,"[How, many, distinct, claim, outcome, codes, a...","{'from': {'table_units': [['table_unit', 6]], ...","CREATE TABLE Customers (Customer_ID INTEGER ,C...",Which customers have an insurance policy with ...,SELECT DISTINCT t2.customer_details FROM polic...,Find the number of distinct stages in claim pr...,SELECT count(*) FROM claims_processing_stages,\nConvert text to SQL.\n\nDDL:\n```\nCREATE TA...,SELECT count(DISTINCT claim_outcome_code) FRO...,SELECT count(DISTINCT claim_outcome_code) FROM...,"[(3,)]","[(3,)]",1
479,allergy_1,SELECT Advisor FROM Student WHERE StuID = 1004,"[SELECT, Advisor, FROM, Student, WHERE, StuID,...","[select, advisor, from, student, where, stuid,...",Who is the advisor of student with ID 1004?,"[Who, is, the, advisor, of, student, with, ID,...","{'from': {'table_units': [['table_unit', 2]], ...",create table Allergy_Type ( Allergy \t\t...,What are the student ids of students who don't...,SELECT StuID FROM Student EXCEPT SELECT StuID ...,How many distinct allergies are there?,SELECT count(DISTINCT allergytype) FROM Allerg...,\nConvert text to SQL.\n\nDDL:\n```\ncreate ta...,SELECT Advisor FROM Student WHERE StuID = 1...,SELECT Advisor FROM Student WHERE StuID = 1004,"[(8423,)]","[(8423,)]",1
4672,college_3,SELECT T1.DName FROM DEPARTMENT AS T1 JOIN MIN...,"[SELECT, T1.DName, FROM, DEPARTMENT, AS, T1, J...","[select, t1, ., dname, from, department, as, t...",What is the name of the department with the mo...,"[What, is, the, name, of, the, department, wit...","{'from': {'table_units': [['table_unit', 2], [...",create table Student ( StuID INT...,Find the first name and last name of the instr...,"SELECT T2.Fname , T2.Lname FROM COURSE AS T1 ...",Which courses are taught on days MTW?,"SELECT CName FROM COURSE WHERE Days = ""MTW""",\nConvert text to SQL.\n\nDDL:\n```\ncreate ta...,SELECT T1.DName FROM DEPARTMENT AS T1 JOIN MI...,SELECT T2.DName FROM MINOR_IN AS T1 JOIN DEPAR...,"[(Mathematical Sciences,)]","[(Mathematical Sciences,)]",1

In [403]:
df_6_examples.head()

,db_id,query,query_toks,query_toks_no_value,question,question_toks,sql,schema,question-1,question-2,...,completion-3,completion-4,completion-5,completion-6,open_ai_prompt,open_ai_completion,model_response,open_ai_execution,model_response_execution,execution_accuracy
5632,railway,SELECT count(*) FROM railway,"[SELECT, count, (, *, ), FROM, railway]","[select, count, (, *, ), from, railway]",How many railways are there?,"[How, many, railways, are, there, ?]","{'from': {'table_units': [['table_unit', 0]], ...","CREATE TABLE railway (Railway_ID int,Railway t...",Show the most common builder of railways.,Show the distinct countries of managers.,...,SELECT Builder FROM railway ORDER BY Builder ASC,SELECT Builder FROM railway ORDER BY Builder ASC,SELECT Name FROM manager ORDER BY LEVEL ASC,"SELECT LOCATION , COUNT(*) FROM railway GROUP...",\nConvert text to SQL.\n\nDDL:\n```\nCREATE TA...,SELECT count(*) FROM railway\n,SELECT COUNT(*) FROM railway,"[(10,)]","[(10,)]",1
4443,network_2,"SELECT DISTINCT T1.name , T1.age FROM Person ...","[SELECT, DISTINCT, T1.name, ,, T1.age, FROM, P...","[select, distinct, t1, ., name, ,, t1, ., age,...",What are the different names and ages of every...,"[What, are, the, different, names, and, ages, ...","{'from': {'table_units': [['table_unit', 0], [...","CREATE TABLE Person ( name varchar(20) , age...",What are the names of every person who has a f...,What are the names of all friends who are from...,...,"SELECT T1.name , T1.age , T1.job FROM Person...",SELECT T2.name FROM Person AS T1 JOIN PersonFr...,SELECT age FROM Person WHERE job = 'doctor' ...,SELECT count(DISTINCT job) FROM Person,\nConvert text to SQL.\n\nDDL:\n```\nCREATE TA...,"SELECT DISTINCT T1.name , T1.age FROM Person...","SELECT T2.name , T1.age FROM Person AS T1 JOI...","[(Zach, 45)]","[(Zach, 45), (Zach, 45)]",0
4713,department_store,SELECT count(DISTINCT product_type_code) FROM ...,"[SELECT, count, (, DISTINCT, product_type_code...","[select, count, (, distinct, product_type_code...",Find the number of different product types.,"[Find, the, number, of, different, product, ty...","{'from': {'table_units': [['table_unit', 5]], ...","CREATE TABLE Addresses (address_id INTEGER ,ad...",Return ids of all the products that are suppli...,What are the names and ids of customers whose ...,...,SELECT DISTINCT T1.customer_name FROM customer...,SELECT avg(product_price) FROM products WHERE ...,"SELECT T1.supplier_name , T1.supplier_phone F...",SELECT T1.staff_name FROM staff AS T1 JOIN sta...,\nConvert text to SQL.\n\nDDL:\n```\nCREATE TA...,SELECT count(DISTINCT product_type_code) FROM...,SELECT COUNT(DISTINCT product_type_code) FROM ...,"[(2,)]","[(2,)]",1
5365,tracking_software_problems,SELECT count(*) FROM product AS T1 JOIN proble...,"[SELECT, count, (, *, ), FROM, product, AS, T1...","[select, count, (, *, ), from, product, as, t1...","How many problems did the product called ""volu...","[How, many, problems, did, the, product, calle...","{'from': {'table_units': [['table_unit', 3], [...",CREATE TABLE Problem_Category_Codes (problem_c...,Find the first and last name of the staff memb...,What are the ids of the problems that are from...,...,SELECT T1.problem_id FROM problems AS T1 JOIN ...,SELECT T2.product_name FROM problems AS T1 JOI...,SELECT problem_id FROM problems WHERE date_pro...,SELECT problem_id FROM problems WHERE date_pro...,\nConvert text to SQL.\n\nDDL:\n```\nCREATE TA...,SELECT count(*) FROM product AS T1 JOIN probl...,SELECT COUNT(*) FROM problems AS T1 JOIN produ...,"[(0,)]","[(0,)]",1
5345,manufactory_1,"SELECT avg(T1.Price) , T2.name FROM products ...","[SELECT, avg, (, T1.Price, ), ,, T2.name, FROM...","[select, avg, (, t1, ., price, ), ,, t2, ., na...",What are the names and average prices of produ...,"[What, are, the, names, and, average, prices, ...","{'from': {'table_units': [['table_unit', 1], [...","CREATE TABLE Manufacturers ( Code INTEGER, N...",Select the average price of each manufacturer'...,Who is the founders of companies whose first l...,...,SELECT DISTINCT headquarter FROM manufacturers,"SELECT T1.Name , max(T1.Price) , T2.name FRO...","SELECT sum(revenue) , founder FROM manufactur...",SELECT sum(revenue) FROM manufacturers WHERE h...,\nConvert text to SQL.\n\nDDL:\n```\nCREATE TA...,"SELECT avg(T1.Price) , T2.name FROM products...","SELECT T1.name , AVG(T1.price) FROM products ...","[(150.0, Creative Labs), (240.0, Fujitsu), (16...","[(DVD burner, 180.0), (DVD drive, 165.0), (Har...",0

In [473]:
print(df_6_examples[df_6_examples['model_response'].str.len() == 250]['model_response'])#.str.len().max()

2732    SELECT T3.name FROM affected_region AS T1 JOIN...
Name: model_response, dtype: object

In [475]:
df_6_examples.loc[2732]['model_response']

"SELECT T3.name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T2.region_name  =  'Afghanistan' OR T2.region_name  =  'Albania' GROUP BY T3.name HAVING count(*)  =  2"

# Testing other models
Curie (90% chepaer) - 9% accuracy  
Codex models (free in beta, more expensive later?)  
Davinci 1 - 57% accuracy  
Davinci 2 - 76% accuracy  
Cushman - 59% accuracy

In [448]:
df = pd.read_json('spider/train_spider.json')

# Set schema
df['schema'] = df.apply(lambda x: get_schema(x['db_id']), axis=1)
df['schema'] = df['schema'].apply(lambda x: re.sub(r'\s+references\s+.*?[,;)]', '', x)) 
df['schema'] = df['schema'].apply(lambda x: re.sub('NOT NULL', '', x))
df['schema'] = df['schema'].apply(lambda x: re.sub(r',\s*(PRIMARY KEY|FOREIGN KEY).*?(;|$)', ');', x, 
                                                   flags=re.IGNORECASE))
df['schema'] = df['schema'].apply(lambda x: x.replace('`', '"'))
df['schema'] = df['schema'].apply(lambda x: re.sub(r'"(\w+)"', r'\1', x))
df['schema'] = df['schema'].apply(lambda x: x.replace('AUTOINCREMENT', ''))
df['schema'] = df['schema'].apply(lambda x: x.replace('UNSIGNED', ''))
df['schema'] = df['schema'].apply(lambda x: x.replace(' BIT', ' BOOLEAN'))
df['schema'] = df['schema'].apply(lambda x: x.replace('YEAR DEFAULT NULL', 'SMALLINT'))
df['schema'] = df['schema'].apply(lambda x: x.replace('MEDIUMINT', 'SMALLINT'))
df['schema'] = df['schema'].apply(lambda x: x.replace('character varchar', 'varchar'))
df['schema'] = df['schema'].apply(lambda x: re.sub(r'PRIMARY KEY,', ',', x))

# Select the examples to show the model
num_examples = 3
df[['question-' + str(i+1) for i in range(num_examples)] + ['completion-' + str(i+1) for i in range(num_examples)]]=\
    df.apply(lambda x: get_more_db_examples(x, df, num_examples), axis=1)
df['open_ai_prompt'] = df.apply(lambda x: more_db_examples_prompt(x, num_examples), axis=1)
df['open_ai_completion'] = df.apply(lambda x: open_ai_completion(x), axis=1)

In [477]:
df_curie = df.sample(100).copy()
df_curie['model_response'] = ''

data = []
for idx, row in df_curie.iterrows():
    print(idx)
    if row['model_response'] != '':
        print('already completed')
        data.append(row['model_response'])
        continue
    
    print(row['open_ai_completion'])
    new_response = call_raw_model(row, engine="curie", stop='\n', max_tokens=128)
    data.append(new_response)
    df_curie.loc[idx,'model_response'] = new_response

1013
 SELECT count(*) ,  affiliation FROM university WHERE enrollment  >  20000 GROUP BY affiliation

SELECT affiliation , SUM(enrollment) OVER ( ORDER BY founded ) FROM university GROUP BY affiliation
4440
 SELECT T1.name ,  T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend  =  'Dan' INTERSECT SELECT T1.name ,   T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend  =  'Alice'

SELECT name, age FROM PersonFriend WHERE name  =  'Dan' AND age  =  '23'
5876
 SELECT transaction_type_code FROM TRANSACTIONS GROUP BY transaction_type_code ORDER BY COUNT(*) DESC LIMIT 1

SELECT T2.transaction_type_code FROM TRANSACTIONS
4866
 SELECT Enrollment FROM school WHERE Denomination != "Catholic"

SELECT Enrollment FROM school WHERE Denomination != 'Catholic'
136
 SELECT bike_id FROM trip WHERE zip_code  =  94002 GROUP BY bike_id ORDER BY COUNT(*) DESC LIMIT 1

SELECT id FROM trip WHERE bike_id  =  636 AND duration  >  (SELECT max(duration) FROM trip WHERE bike_id  =  636)
2720
 SELECT T1.name FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id HAVING count(*)  >=  2 INTERSECT SELECT T1.name FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id HAVING sum(T2.number_city_affected)  >=  10

SELECT T1.Name , T2.Region_name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T2.Region_name  =  'Afghanistan' AND T1.Region_name  =  'Albania' AND T1.Number_city_affected  > 10
1393
 SELECT count(*) ,  building FROM classroom WHERE capacity  >  50 GROUP BY building

SELECT COUNT(*) FROM BUILDING WHERE capacity > 50
4383
 SELECT T1.organisation_id ,  count(*) FROM Projects AS T1 JOIN Project_outcomes AS T2 ON T1.project_id  =  T2.project_id GROUP BY T1.organisation_id ORDER BY count(*) DESC LIMIT 1

SELECT organisation_id FROM Organisation_Types JOIN Project_Outcomes AS T1 ON T1.organisation_type_id = T1.organisation_type_id JOIN Project_Staff AS T2 ON T1.organisation_id = T2.organisation_id GROUP BY organisation_id
4471
 SELECT T1.age FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.friend WHERE T2.name =  'Zach' AND T2.year  =  (SELECT max(YEAR) FROM PersonFriend WHERE name =  'Zach')

SELECT DISTINCT T1.name FROM PersonFriend AS T1 JOIN Person AS T2 ON T1.name  =  T2.name WHERE T2.friend IN (SELECT name FROM Person WHERE age  >  40) AND T2.friend IN (SELECT name FROM Person WHERE age  <  30)
3870
 SELECT Date_Claim_Made FROM Claims ORDER BY Date_Claim_Made ASC LIMIT 1

SELECT T1.claim_id ,  T1.date_claim_made ,  T1.date_claim_settled FROM Claims AS T1 JOIN Settlements AS T2 ON T1.claim_id  =  T2.claim_id GROUP BY T1.claim_id ORDER BY T1.date_claim_made DESC LIMIT 1
5525
 SELECT color_description FROM ref_colors

SELECT color_description FROM colors
209
 SELECT count(*) FROM station AS T1 JOIN trip AS T2 JOIN station AS T3 JOIN trip AS T4 ON T1.id  =  T2.start_station_id AND T2.id  =  T4.id AND T3.id  =  T4.end_station_id WHERE T1.city  =  "Mountain View" AND T3.city  =  "Palo Alto"

SELECT trip_id, trip_duration, trip_start_station_name, trip_start_station_id, trip_end_station_name, trip_end_station_id FROM trip WHERE trip_start_city =  'Mountain View' AND trip_end_city =  'Palo Alto'
4803
 SELECT International_Passengers ,  Domestic_Passengers FROM airport WHERE Airport_Name  =  "London Heathrow"

SELECT COUNT(*) AS International_Passengers, COUNT(*) AS Domestic_Passengers FROM airport AS A JOIN airport_aircraft AS A2 ON A.Airport_ID = A2.ID JOIN airport AS A3 ON A3.Airport_ID = A2.ID JOIN airport_aircraft AS A4 ON A4.Airport_ID = A3.ID WHERE Airport_Name = 'Heathrow' GROUP BY Airport_Name, Airport_ID
2211
 SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN results AS T2 ON T1.driverid  =  T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid WHERE T3.year > 2010 GROUP BY T1.driverid ORDER BY count(*) DESC LIMIT 1

SELECT T1.driverid , T1.lastname FROM drivers AS T1 JOIN results AS T2 ON T1.driverid = T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid GROUP BY T1.driverid HAVING count(*) >  2
448
 SELECT DISTINCT allergy FROM Allergy_type WHERE allergytype  =  "food"

SELECT allergytype , count(*) FROM Allergy_type GROUP BY allergytype
2847
 SELECT product_name FROM products ORDER BY product_price DESC LIMIT 1

SELECT product_name FROM Products WHERE product_price >
5016
 SELECT T1.cName FROM  tryout AS T1 JOIN player AS T2 ON T1.pID  =  T2.pID WHERE T2.pName LIKE 'D%'

SELECT cName FROM Tryout WHERE pID = 'D'
14
 SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1

SELECT * FROM department WHERE head_ID > 1
3566
 SELECT T1.gender ,  T1.artist_name FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name ORDER BY T2.resolution LIMIT 1

SELECT T1.gender , T1.name
947
 SELECT T1.name FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T1.id  =  T2.enzyme_id JOIN medicine AS T3 ON T2.medicine_id  =  T3.id WHERE T3.name  =  'Amisulpride' AND T2.interaction_type  =  'inhibitor'

SELECT name FROM medicine WHERE enzyme_id =  'Amisulpride'
3557
 SELECT T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T1.gender  =  "Female" AND T2.languages  =  "bangla"

SELECT country FROM artist WHERE gender =  "F" AND country =  "Bangladesh"
5601
 SELECT count(*) FROM Ref_colors WHERE color_code NOT IN ( SELECT color_code FROM products )

SELECT COUNT(*) FROM products AS t1 JOIN ref_colors AS t2 ON t1.color_code  = t2.color_code WHERE t1.product_id  IS NULL
2314
 SELECT T1.Height FROM people AS T1 JOIN perpetrator AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Injured DESC

SELECT Height FROM perpetrator ORDER BY Height DESC
1817
 SELECT T2.balance ,  T3.balance ,  T1.name FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid JOIN savings AS T3 ON T1.custid  =  T3.custid

SELECT name, balance, savings FROM accounts
2003
 SELECT DISTINCT main_industry FROM company

SELECT main_industry FROM company WHERE main_industry
4679
 SELECT T2.Fname ,  T2.Lname FROM COURSE AS T1 JOIN FACULTY AS T2 ON T1.Instructor  =  T2.FacID GROUP BY T1.Instructor ORDER BY count(*) DESC LIMIT 3

SELECT T2.Fname , T2.Lname FROM COURSE AS T1 JOIN FACULTY AS T2 ON T1.Instructor  =  T2.FacID JOIN COURSE AS T3 ON T1.CID = T3.CID WHERE T1.CName  =  "COMPUTER LITERACY" AND T3.CID  =  1
2189
 SELECT count(*) ,  constructorid FROM constructorStandings GROUP BY constructorid

SELECT COUNT(*) FROM races AS T1 JOIN constructors AS T2 ON T1.constructorid = T2.constructorid WHERE T1.name = "Mercedes"
5975
 SELECT gname ,  gtype FROM Video_games ORDER BY gname

SELECT DISTINCT gname FROM Video_games AS T1 JOIN Plays_games AS T2 ON T1.gameid  = T2.gameid WHERE T1.gname = 'Video_Games' AND T2.gname = 'Plays_Games'
4386
 SELECT staff_details FROM Research_Staff ORDER BY staff_details ASC

SELECT staff_id, staff_name, staff_role_id, staff_date_from, staff_date_to, staff_other_details FROM Staff_Roles ORDER BY staff_date_from DESC
3473
 SELECT first_name ,  last_name ,  department_id FROM employees WHERE salary IN (SELECT MIN(salary) FROM employees GROUP BY department_id)

SELECT first_name , last_name , department_id FROM employees WHERE salary =  '$10'
5747
 SELECT count(*) FROM student AS T1 JOIN lives_in AS T2 ON T1.stuid  =  T2.stuid JOIN dorm AS T3 ON T3.dormid  =  T2.dormid WHERE T3.gender  =  'M'

SELECT SUM(age) FROM student WHERE dormid = '1' GROUP BY dormid
2511
 SELECT T2.title FROM Rating AS T1 JOIN Movie AS T2 ON T1.mID  =  T2.mID WHERE T1.stars BETWEEN 3 AND 5

SELECT DISTINCT YEAR FROM Movie AS T1 JOIN Rating AS T2 ON T1.mID  =  T2.mID WHERE T2.stars  >=  3 AND T2.stars  <=  5 ORDER BY T1.year
621
 SELECT T2.name FROM genres AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T1.name = "Rock";

SELECT T2.name FROM genres AS T1 JOIN tracks AS T2 ON T1.id = T2.genre_id WHERE T1.name = "Rock";
194
 SELECT DISTINCT start_station_name FROM trip WHERE duration  <  100

SELECT station_name FROM trip WHERE trip_duration  < 100
2672
 SELECT Nationality ,  COUNT(*) FROM HOST GROUP BY Nationality

SELECT Nationality , COUNT(*) FROM HOST GROUP BY Nationality ORDER BY COUNT(*) DESC LIMIT 1
4139
 SELECT T1.Year FROM film_market_estimation AS T1 JOIN market AS T2 ON T1.Market_ID  =  T2.Market_ID WHERE T2.Country  =  "Japan" ORDER BY T1.Year DESC

SELECT Year,Estimation_ID FROM film_market_estimation AS T1 JOIN market AS T2 ON T1.Market_ID = T2.Market_ID WHERE T1.Year =  '2014' AND T1.Estimation_ID =  '1'
6368
 SELECT id ,  country ,  city ,  name FROM airport ORDER BY name

SELECT id, country, city, name FROM airport ORDER BY name
2271
 SELECT Name FROM People ORDER BY Weight ASC

SELECT Name FROM people ORDER BY Weight DESC LIMIT 10
132
 SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7

SELECT name FROM station WHERE bikes_available = 7
1433
 SELECT T2.name ,  T2.salary FROM advisor AS T1 JOIN instructor AS T2 ON T1.i_id  =  T2.id JOIN student AS T3 ON T1.s_id  =  T3.id WHERE T3.dept_name  =  'Math'

SELECT name , salary FROM instructor WHERE dept_name = 'Math'
706
 SELECT count(*) FROM Customers_cards AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.customer_first_name  =  "Art" AND T2.customer_last_name  =  "Turcotte"

SELECT COUNT(*) FROM Customers_cards WHERE customer_first_name =  "Art" AND customer_last_name =  "Turcotte"
4527
 SELECT t1.document_name FROM documents AS t1 JOIN document_sections AS t2 ON t1.document_code  =  t2.document_code GROUP BY t1.document_code ORDER BY count(*) DESC LIMIT 1

SELECT t2.section_code FROM documents AS t1 JOIN document_sections AS t2 ON t1.document_code = t2.document_code WHERE t1.document_name = "David CV"
2521
 SELECT rID FROM Rating EXCEPT SELECT rID FROM Rating WHERE stars  =  4

SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE rID NOT IN (SELECT rID FROM Reviewer WHERE r
1908
 SELECT count(*) FROM (SELECT * FROM endowment WHERE amount  >  8.5 GROUP BY school_id HAVING count(*)  >  1)

SELECT count(*) FROM school WHERE donator_name
3514
 SELECT * FROM employees WHERE employee_id NOT IN (SELECT employee_id FROM job_history)

SELECT * FROM employees WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (SELECT job_id FROM jobs WHERE job_id NOT IN (
6406
 SELECT document_name ,  document_id FROM Documents WHERE document_type_code  =  "BK"

SELECT document_name ,  document_id FROM Documents WHERE document_type_code =  "BK"
4131
 SELECT T1.Title ,  T2.Type FROM film AS T1 JOIN film_market_estimation AS T2 ON T1.Film_ID  =  T2.Film_ID

SELECT Title,Type FROM film_market_estimation
1751
 SELECT Age FROM people ORDER BY Height DESC LIMIT 1

SELECT T2.Age FROM gymnast AS T1 JOIN people AS T2 ON T1.Gymnast_ID  =  T2.People_ID GROUP BY T2.Age ORDER BY T2.Age DESC LIMIT 1
5452
 SELECT LName FROM STUDENT WHERE Major  =  50

SELECT Last_Name FROM STUDENT WHERE Major 	=  "50" ORDER BY Last_Name DESC
5184
 SELECT count(*) FROM performance AS T1 JOIN band AS T2 ON T1.bandmate  =  T2.id JOIN songs AS T3 ON T3.songid  =  T1.songid WHERE T3.Title  =  "Flash"

SELECT T2.firstname , 	T2.lastname FROM Performance AS T1 JOIN Band AS T2 ON T1.bandmate  =  T2.id JOIN Songs AS T3 ON T3.SongId  =  T1.SongId WHERE T3.Title  = "Flash" GROUP BY T2.firstname , T2.lastname
5797
 SELECT complaint_status_code FROM complaints GROUP BY complaint_status_code HAVING count(*)  >  3

SELECT complaint_status_code , complaint_type_code FROM complaints WHERE complaint_status_code > 3
5025
 SELECT cName FROM College WHERE enr  <  13000 AND state = "AZ" UNION SELECT cName FROM College WHERE enr  >  15000 AND state = "LA"

SELECT DISTINCT cName FROM college WHERE cName > 15000 AND cName < 13000
2890
 SELECT t3.title FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN papers AS t3 ON t2.paperid  =  t3.paperid WHERE t1.fname  =  "Olin" AND t1.lname  =  "Shivers"

SELECT * FROM papers WHERE authOrder = 1 AND authID = 1 AND paperID = 1 AND authID = 1
81
 SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id

SELECT T3.course_name ,
6359
 SELECT T2.school ,  T3.name FROM school_bus AS T1 JOIN school AS T2 ON T1.school_id  =  T2.school_id JOIN driver AS T3 ON T1.driver_id  =  T3.driver_id

SELECT T2.school ,  T3.name FROM school_bus AS T1 JOIN school AS T2 ON T1.school_id  =  T2.school_id JOIN driver AS T3 ON T1.driver_id  =  T3.driver_id
530
 SELECT count(*) FROM Student WHERE sex  =  "M" AND StuID IN (SELECT StuID FROM Has_allergy AS T1 JOIN Allergy_Type AS T2 ON T1.Allergy  =  T2.Allergy WHERE T2.allergytype  =  "food")

SELECT sex , allergytype FROM Has_allergy GROUP BY sex , allergytype
5781
 SELECT t1.phone_number FROM customers AS t1 JOIN complaints AS t2 ON t1.customer_id  =  t2.customer_id ORDER BY t2.date_complaint_raised DESC LIMIT 1

SELECT phone_number FROM complaints WHERE complaint_status_code =  'R'
3972
 SELECT T1.name FROM physician AS T1 JOIN trained_in AS T2 ON T1.employeeid  =  T2.physician JOIN procedures AS T3 ON T3.code  =  T2.treatment WHERE T3.cost  >  5000

SELECT name FROM procedures WHERE cost > 5000 AND name  <> "John Wen"
3004
 SELECT first_name FROM customer WHERE customer_id NOT IN( SELECT customer_id FROM rental WHERE rental_date  >  '2005-08-23 02:06:01' )

SELECT first_name FROM customer WHERE rental_date  <  '2005-08-23 02:06:01'
6793
 SELECT T1.activity_name FROM Activity AS T1 JOIN Participates_in AS T2 ON T1.actID  =  T2.actID GROUP BY T1.actID ORDER BY count(*) DESC LIMIT 1

SELECT 	ACTID FROM Activity WHERE 	ACTID 	> 	0
6951
 SELECT name FROM mill WHERE LOCATION != 'Donceel'

SELECT name ,  nationality ,  id FROM mill WHERE location  =  'Donceel' ORDER BY name
3064
 SELECT T1.cust_name ,  T1.acc_type FROM customer AS T1 JOIN loan AS T2 ON T1.cust_id  =  T2.cust_id GROUP BY T1.cust_name HAVING sum(T2.amount)  >  5000

SELECT cust_name , acc_bal FROM customer WHERE acc_bal > 5000
1790
 SELECT T2.balance ,  T3.balance FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid JOIN savings AS T3 ON T1.custid  =  T3.custid WHERE T1.name  =  'Brown'

SELECT T1.name , T2.balance FROM accounts AS T1 JOIN checking AS T2 ON T1.custid = T2.custid JOIN savings AS T3 ON T1.custid = T3.custid WHERE T3.balance =  (SELECT avg(balance) FROM checking)
2871
 SELECT DISTINCT t3.name FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t1.fname  =  "Matthias" AND t1.lname  =  "Blume"

SELECT DISTINCT t1.fname ,  t1.lname FROM authors AS t1 JOIN authorship AS t2 ON t1.authid  =  t2.authid JOIN inst AS t3 ON t2.instid  =  t3.instid WHERE t3.name  =  "Matthias Blume"
1401
 SELECT min(salary) ,  dept_name FROM instructor GROUP BY dept_name HAVING avg(salary)  >  (SELECT avg(salary) FROM instructor)

SELECT salary FROM instructor WHERE salary  >=  AVG(salary)
3103
 SELECT * FROM Student_Addresses ORDER BY monthly_rental DESC

SELECT T1.line_1 , T2.monthly_rental , T3.address_id , T4.date_address_from , T5.date_address_to FROM Student_Addresses AS T1 JOIN Student_Addresses AS T2 ON T1.address_id = T2.address_id JOIN Addresses AS T3 ON T2.line_1 = T3.line_1 JOIN Addresses AS T4 ON T3.line_1 = T4.line_1 JOIN Addresses AS T5 ON T4.line_1
3439
 SELECT * FROM employees WHERE hire_date  >  '1987-09-07'

SELECT * FROM employees WHERE hire_date >= '1987-09-07'
380
 SELECT eid ,  salary FROM Employee WHERE name  =  'Mark Young'

SELECT eid , salary FROM Employee WHERE name = 'Mark Young'
5910
 SELECT Name FROM TOURIST_ATTRACTIONS WHERE How_to_Get_There  =  "bus"

SELECT T1.Name FROM Tourist_Attractions AS T1 JOIN VISITS AS T2 ON T1.Tourist_Attraction_ID  =  T2.Tourist_Attraction_ID JOIN BUSES AS T3 ON T2.Tourist_ID  = T3.Tourist_ID WHERE T3.Tourist_Details  =  "Bus"
4923
 SELECT t3.headquartered_city ,  count(*) FROM store AS t1 JOIN store_district AS t2 ON t1.store_id  =  t2.store_id JOIN district AS t3 ON t2.district_id  =  t3.district_id GROUP BY t3.headquartered_city

SELECT city_name FROM city WHERE city_population =
4769
 SELECT product_id ,  product_name FROM products WHERE product_price  <  600 OR product_price  >  900

SELECT product_id , product_name FROM products WHERE product_price  <  600 OR product_price  >  900
5464
 SELECT DISTINCT Secretary_Vote FROM VOTING_RECORD WHERE ELECTION_CYCLE  =  "Fall"

SELECT DISTINCT T1.Age FROM VOTING_RECORD AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.Secretary_Vote WHERE T2.Election_Cycle  =  "Fall"
513
 SELECT Allergy FROM Has_allergy GROUP BY Allergy ORDER BY count(*) DESC LIMIT 1

SELECT T2.allergytype ,  count(*) FROM Has_allergy AS T1 JOIN Allergy_type AS T2 ON T1.allergy  =  T2.allergy GROUP BY T2.allergytype
4659
 SELECT * FROM COURSE ORDER BY Credits

SELECT * FROM COURSE ORDER BY Credits
3809
 SELECT T1.address_line_1 ,  T2.author_id FROM Course_Authors_and_Tutors AS T1 JOIN Courses AS T2 ON T1.author_id  =  T2.author_id GROUP BY T2.author_id HAVING Count(*)  >=  2

SELECT address_line_1 FROM Course_Authors_and_Tutors JOIN Authors ON authors_id = 	course_author_id WHERE personal_name = 	"Cathrine" AND course_id = 	 1
507
 SELECT StuID FROM Student EXCEPT SELECT StuID FROM Has_allergy

SELECT T1.StuID FROM Allergy_type AS T1 JOIN Has_allergy AS T2 ON T1.Allergy  =  T2.Allergy JOIN Student AS T3 ON T3.StuID  =  T2.StuID WHERE T3.Fname  =  "Lisa"
4137
 SELECT T2.Country ,  T1.Year FROM film_market_estimation AS T1 JOIN market AS T2 ON T1.Market_ID  =  T2.Market_ID

SELECT Country , Year FROM market WHERE Country = "Japan"
1780
 SELECT sum(balance) FROM checking

SELECT T2.balance FROM checking AS T2 JOIN accounts AS T1 ON T2.custid = T1.custid WHERE T1.name LIKE '%ee%'
210
 SELECT count(*) FROM station AS T1 JOIN trip AS T2 JOIN station AS T3 JOIN trip AS T4 ON T1.id  =  T2.start_station_id AND T2.id  =  T4.id AND T3.id  =  T4.end_station_id WHERE T1.city  =  "Mountain View" AND T3.city  =  "Palo Alto"

SELECT COUNT(*) FROM trip WHERE start_station_id = 'Mountain View' AND end_station_id = 'Palo Alto'
6858
 SELECT city FROM airports GROUP BY city HAVING count(*)  >  2 ORDER BY count(*)

SELECT city FROM airports WHERE country  =  'United States' GROUP BY city ORDER BY city
656
 SELECT Age FROM editor GROUP BY Age ORDER BY COUNT(*) DESC LIMIT 1

SELECT Name FROM editor WHERE Age >= 24 AND Age <= 35
3069
 SELECT T2.bname FROM loan AS T1 JOIN bank AS T2 ON T1.branch_id  =  T2.branch_id JOIN customer AS T3 ON T1.cust_id  =  T3.cust_id WHERE T3.credit_score  <  100 GROUP BY T2.bname ORDER BY sum(T1.amount) DESC LIMIT 1

SELECT T1.branch_name FROM bank AS T1 JOIN loan AS T2 ON T1.branch_id = T2.branch_id JOIN customer AS T3 ON T1.cust_id = T3.cust_id WHERE T2.loan_type = 'home' AND T2.cust_id < 100
5893
 SELECT Tourist_Details FROM VISITORS

SELECT T1.Tourist_ID ,  T2.Tourist_ID ,  T3.Tourist_ID ,  T4.Tourist_ID ,  T5.Tourist_ID ,  T6.Tourist_ID ,  T7.Tourist_ID ,  T8.Tourist_ID ,  T9.Tourist_ID ,  T10.Tourist_ID ,  T11.Tourist_ID ,  T12.Tourist_ID ,  T13.Tourist_ID ,  T14.Tourist_ID ,  T
737
 SELECT avg(transaction_amount) ,  sum(transaction_amount) FROM Financial_transactions

SELECT AVG(T2.transaction_amount) , SUM(T2.transaction_amount) FROM Financial_transactions AS T2 GROUP BY T2.account_id
2009
 SELECT main_industry ,  count(*) FROM company GROUP BY main_industry ORDER BY sum(market_value) DESC LIMIT 1

SELECT main_industry , sum(market_value) FROM company GROUP BY main_industry ORDER BY sum(market_value) DESC
5549
 SELECT t1.product_id ,  t2.color_description FROM products AS t1 JOIN ref_colors AS t2 ON t1.color_code  =  t2.color_code JOIN product_characteristics AS t3 ON t1.product_id  =  t3.product_id GROUP BY t1.product_id HAVING count(*)  >=  2

SELECT product_id, color_code FROM products WHERE characteristic_type_code  =  "BOTH" AND characteristic_name  =  "fast" AND characteristic_name  =  "red"
346
 SELECT name ,  distance FROM Aircraft

SELECT T1.name , T1.distance FROM Aircraft AS T1 JOIN Flight AS T2 ON T1.flno =  T2.flno WHERE T2.name  =  "Airbus A340-300"
2439
 SELECT count(*) FROM Movie WHERE YEAR  <  2000

SELECT COUNT(*) FROM Movie GROUP BY year(year) HAVING year(year) > 2000
3709
 SELECT T2.park_name FROM home_game AS T1 JOIN park AS T2 ON T1.park_id  =  T2.park_id WHERE T1.year = 2008 ORDER BY T1.attendance DESC LIMIT 1;

InvalidRequestError: too many tokens
4934
 SELECT product FROM product WHERE product LIKE "%Scanner%"

SELECT product FROM product WHERE product LIKE '%Scanner%'
6005
 SELECT T2.Lname FROM Sportsinfo AS T1 JOIN Student AS T2 ON T1.StuID  =  T2.StuID WHERE T1.onscholarship  =  'Y'

SELECT LName FROM Student WHERE StuID = 1 AND Hours_Played > 0 GROUP BY LName
3640
 SELECT YEAR ,  avg(attendance) FROM home_game GROUP BY YEAR;

InvalidRequestError: too many tokens
4946
 SELECT avg(enr) FROM College

SELECT cName , state , enr FROM college GROUP BY state
2751
 SELECT count(DISTINCT Governor) FROM party

SELECT COUNT(*) FROM party GROUP BY Governor
3715
 SELECT avg(prominence) FROM mountain WHERE country  =  'Morocco'

SELECT SUM(prominence) FROM mountain WHERE country = 'Morocco'
3061
 SELECT sum(amount) ,  T1.bname FROM bank AS T1 JOIN loan AS T2 ON T1.branch_id  =  T2.branch_id GROUP BY T1.bname

SELECT T1.bname, sum(amount) FROM loan AS T1 JOIN bank AS T2 ON T1.branch_id  =  T2.branch_id GROUP BY T1.bname
3587
 SELECT artist_name FROM song WHERE resolution  >  500 GROUP BY languages ORDER BY count(*) DESC LIMIT 1

SELECT languages FROM song WHERE resolution > 500 AND languages  =  "english"
6905
 SELECT T1.customer_name FROM customers AS T1 JOIN orders AS T2 ON T1.customer_id = T2.customer_id WHERE T2.date_order_placed >= "2009-01-01" AND T2.date_order_placed <= "2010-01-01"

SELECT COUNT(*) FROM orders WHERE order_date BETWEEN '2009-01-01' AND '2010-01-01'
6216
 SELECT T1.Name ,  T1.population FROM country AS T1 JOIN roller_coaster AS T2 ON T1.Country_ID  =  T2.Country_ID ORDER BY T2.Height DESC LIMIT 1

SELECT Name, Population FROM country WHERE Roller_Coaster_ID = 1
5228
 SELECT count(DISTINCT title) FROM vocals AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE TYPE  =  "lead"

SELECT DISTINCT title FROM vocals AS t1 JOIN songs AS t2 ON t1.songid  =  t2.songid WHERE TYPE  =  "lead"

In [478]:
df_curie[~(df_curie['model_response'] == '')].shape

(100, 17)

In [479]:
df_curie[~(df_curie['model_response'].isna())].shape

(98, 17)

In [480]:
df_curie['open_ai_execution'] = df_curie.apply(lambda x: execution(x, 'open_ai_completion'), axis=1)
df_curie['model_response_execution'] = df_curie.apply(lambda x: execution(x, 'model_response'), axis=1)
df_curie['execution_accuracy'] = np.where(df_curie['open_ai_execution'] == df_curie['model_response_execution'], 1, 0)
df_curie[~(df_curie['model_response'] == '') & ~(df_curie['model_response'].isna())]['execution_accuracy'].mean()

0.09183673469387756

In [481]:
print(df_curie.iloc[0]['open_ai_prompt'])
print(df_curie.iloc[0]['open_ai_completion'])
print(df_curie.iloc[0]['model_response'])

Convert text to SQL.

DDL:
```
CREATE TABLE basketball_match (Team_ID int,School_ID int,Team_Name text,ACC_Regular_Season text,ACC_Percent text,ACC_Home text,ACC_Road text,All_Games text,All_Games_Percent int,All_Home text,All_Road text,All_Neutral text);CREATE TABLE university (School_ID int,School text,Location text,Founded real,Affiliation text,Enrollment real,Nickname text,Primary_conference text);
```

Question:
"""Show the enrollment and primary_conference of the oldest college."""
Answer:
SELECT enrollment ,  primary_conference FROM university ORDER BY founded LIMIT 1

Question:
"""Return the total and minimum enrollments across all schools."""
Answer:
SELECT sum(enrollment) ,  min(enrollment) FROM university

Question:
"""What are the different schools and their nicknames, ordered by their founding years?"""
Answer:
SELECT school ,  nickname FROM university ORDER BY founded

Question:
"""Find the number of universities that have over a 20000 enrollment size for each affiliation type."""
Answer:

 SELECT count(*) ,  affiliation FROM university WHERE enrollment  >  20000 GROUP BY affiliation

SELECT affiliation , SUM(enrollment) OVER ( ORDER BY founded ) FROM university GROUP BY affiliation

In [482]:
df_code_davinci = df.sample(100).copy()
df_code_davinci['model_response'] = ''

data = []
for idx, row in df_code_davinci.iterrows():
    print(idx)
    if row['model_response'] != '':
        print('already completed')
        data.append(row['model_response'])
        continue
    
    print(row['open_ai_completion'])
    new_response = call_raw_model(row, engine="code-davinci-001", stop='\n', max_tokens=128)
    data.append(new_response)
    df_code_davinci.loc[idx,'model_response'] = new_response

6701
 SELECT T1.lesson_id FROM Lessons AS T1 JOIN Staff AS T2 ON T1.staff_id = T2.staff_id WHERE T2.first_name = "Janessa" AND T2.last_name = "Sawayn" AND nickname LIKE "%s%";

SELECT lesson_id FROM Lessons AS T1 JOIN Staff AS T2 ON T1.staff_id = T2.staff_id WHERE T2.nickname LIKE "%s%" AND T2.first_name = "Janessa" AND T2.last_name = "Sawayn";
1789
 SELECT T2.balance FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid WHERE T1.name LIKE '%ee%'

SELECT T2.balance FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid WHERE T1.name  LIKE  '%ee%'
255
 SELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC

SELECT Name FROM actor WHERE Musical_ID IN (SELECT Musical_ID FROM musical WHERE Award  =  "Tony Award") ORDER BY Year DESC
6869
 SELECT count(*) FROM routes AS T1 JOIN airports AS T2 ON T1.dst_apid  =  T2.apid WHERE T2.country  =  'Italy'

SELECT count(*) FROM routes AS T1 JOIN airports AS T2 ON T1.dst_apid  =  T2.apid WHERE T2.country  =  'Italy'
5774
 SELECT t1.product_name ,  count(*) FROM products AS t1 JOIN complaints AS t2 ON t1.product_id  =  t2.product_id GROUP BY t1.product_name

SELECT product_name,count(*) FROM products JOIN complaints ON products.product_id  =  complaints.product_id GROUP BY products.product_id
3992
 SELECT count(*) FROM patient WHERE SSN NOT IN ( SELECT T1.patient FROM Prescribes AS T1 JOIN Medication AS T2 ON T1.Medication  =  T2.Code WHERE T2.name  =  'Procrastin-X' )

SELECT count(*) FROM patient AS T1 JOIN (SELECT patient FROM prescribes WHERE medication  =  1) AS T2 ON T1.ssn  =  T2.patient WHERE medication  =  2
6165
 SELECT T1.Date_of_ceremony FROM music_festival AS T1 JOIN volume AS T2 ON T1.Volume  =  T2.Volume_ID WHERE T2.Weeks_on_Top  >  2

SELECT Date_of_ceremony FROM volume WHERE Weeks_on_Top  >  2
4046
 SELECT DISTINCT T2.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE grade  =  5

RateLimitError
SELECT DISTINCT T2.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.grade  =  5
1104
 SELECT Name FROM team WHERE Team_id NOT IN (SELECT Team FROM match_season)

SELECT Name FROM team WHERE Name NOT IN (SELECT DISTINCT Team FROM match_season)
1441
 SELECT name FROM instructor WHERE id NOT IN (SELECT id FROM teaches)

RateLimitError
SELECT name FROM instructor WHERE i_ID  NOT IN (SELECT i_ID FROM teaches)
4532
 SELECT count(*) FROM users WHERE user_login  =  1

SELECT count(*) FROM users WHERE user_login  =  1
24
 SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000

SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000
4422
 SELECT avg(age) ,  job FROM Person GROUP BY job

RateLimitError
RateLimitError
RateLimitError
SELECT job, avg(age) FROM Person GROUP BY job
1821
 SELECT T1.name FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid JOIN savings AS T3 ON T1.custid  =  T3.custid WHERE T2.balance  >  T3.balance

SELECT T1.name FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid JOIN savings AS T3 ON T1.custid  =  T3.custid WHERE T2.balance > T3.balance
1509
 SELECT policy_type_code FROM policies AS t1 JOIN customers AS t2 ON t1.customer_id  =  t2.customer_id WHERE t2.customer_details  =  "Dayana Robel"

SELECT policy_type_code FROM policies AS t1 JOIN customers AS t2 ON t1.customer_id  =  t2.customer_id WHERE t2.customer_details  =  "Dayana Robel"
4099
 SELECT Name FROM company WHERE Industry  =  "Banking" OR Industry  =  "Retailing"

SELECT Name FROM company WHERE Industry  =  "Banking" OR Industry  =  "Retailing"
3921
 SELECT count(T1.SSN) FROM patient AS T1 JOIN prescribes AS T2 ON T1.SSN  =  T2.patient JOIN physician AS T3 ON T2.physician  =  T3.employeeid WHERE T3.name = "John Dorian"

RateLimitError
SELECT COUNT(*) FROM prescribes WHERE physician  =  1
4973
 SELECT DISTINCT pName FROM Player WHERE pName LIKE '%a%'

SELECT pName FROM player WHERE pName  LIKE  "%a%"
736
 SELECT count(DISTINCT transaction_type) FROM Financial_Transactions

SELECT count(DISTINCT transaction_type) FROM Financial_Transactions
574
 SELECT company FROM customers WHERE first_name = "Eduardo" AND last_name = "Martins";

SELECT T1.company FROM customers AS T1 JOIN invoices AS T2 ON T1.id  =  T2.customer_id JOIN invoice_lines AS T3 ON T2.id  =  T3.invoice_id JOIN tracks AS T4 ON T3.track_id  =  T4.id JOIN albums AS T5 ON T4.album_id  =  T5.id JOIN artists AS T6 ON T5.artist_id  =  T6.id WHERE T1.first_name  =  "
752
 SELECT name ,  seating FROM track WHERE year_opened  >  2000 ORDER BY seating

SELECT name ,  seating FROM track WHERE year_opened  >  2000 ORDER BY seating
2839
 SELECT TIME FROM Student JOIN Visits_Restaurant ON Student.StuID = Visits_Restaurant.StuID JOIN Restaurant ON Visits_Restaurant.ResID = Restaurant.ResID WHERE Student.Fname = "Linda" AND Student.Lname = "Smith" AND Restaurant.ResName = "Subway";

RateLimitError
SELECT Visits_Restaurant.Time FROM Student JOIN Visits_Restaurant ON Student.StuID = Visits_Restaurant.StuID JOIN Restaurant ON Visits_Restaurant.ResID = Restaurant.ResID WHERE Student.Fname = "Linda" AND Student.Lname = "Smith" AND Restaurant.ResName = "Subway";
4837
 SELECT t1.name ,  t1.age FROM pilot AS t1 JOIN MATCH AS t2 ON t1.pilot_id  =  t2.winning_pilot WHERE t1.age  <  30 GROUP BY t2.winning_pilot ORDER BY count(*) DESC LIMIT 1

RateLimitError
SELECT t1.name ,  t1.age FROM pilot AS t1 JOIN MATCH AS t2 ON t1.pilot_id  =  t2.winning_pilot WHERE t1.age  <  30 GROUP BY t2.winning_pilot ORDER BY count(*) DESC LIMIT 1
3476
 SELECT employee_id FROM employees WHERE salary  >  (SELECT AVG(salary) FROM employees)

RateLimitError
SELECT employee_id FROM employees WHERE salary > (SELECT AVG(salary) FROM employees)
5304
 SELECT sum(revenue) FROM manufacturers WHERE revenue  >  (SELECT min(revenue) FROM manufacturers WHERE headquarter  =  'Austin')

RateLimitError
SELECT sum(T1.revenue) FROM manufacturers AS T1 JOIN manufacturers AS T2 ON T1.code  =  T2.code WHERE T2.Headquarter  =  'Austin' AND T1.revenue  >  T2.revenue
3579
 SELECT song_name FROM song ORDER BY resolution

SELECT song_name FROM song ORDER BY resolution
806
 SELECT MONTH FROM happy_hour GROUP BY MONTH HAVING count(*)  >  2

SELECT month ,  count(*) FROM happy_hour GROUP BY month HAVING count(*) > 2
1693
 SELECT avg(rating) ,  max(rating) FROM review

SELECT avg(rating) AS avg_rating, max(rating) AS max_rating FROM review
5567
 SELECT count(*) FROM products AS t1 JOIN product_characteristics AS t2 ON t1.product_id  =  t2.product_id JOIN CHARACTERISTICS AS t3 ON t2.characteristic_id  =  t3.characteristic_id WHERE t1.product_name  =  "flax"

SELECT count(*) FROM products AS t1 JOIN product_characteristics AS t2 ON t1.product_id  =  t2.product_id JOIN CHARACTERISTICS AS t3 ON t2.characteristic_id  =  t3.characteristic_id WHERE t1.product_name  =  'flax'
1943
 SELECT LOCATION FROM cinema WHERE capacity  >  300 GROUP BY LOCATION HAVING count(*)  >=  2

SELECT location ,  count(*) FROM cinema WHERE capacity > 300 GROUP BY location HAVING count(*) > 2
6557
 SELECT DISTINCT Name FROM WINE WHERE Price  >  (SELECT min(Price) FROM wine WHERE Winery  =  "John Anthony")

SELECT DISTINCT Name FROM WINE WHERE WINE.Winery = 'John Anthony' AND Price > (SELECT Price FROM WINE WHERE WINE.Winery = 'John Anthony' ORDER BY Price LIMIT 1)
2728
 SELECT T1.region_name FROM region AS T1 JOIN affected_region AS T2 ON T1.region_id = T2.region_id GROUP BY T1.region_id HAVING count(*)  >=  2

SELECT region_name FROM region JOIN affected_region ON region.region_id = affected_region.region_id GROUP BY region_name HAVING COUNT(*)  >  2
4093
 SELECT T2.firstname ,  T2.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom GROUP BY T2.firstname ,  T2.lastname ORDER BY count(*) DESC LIMIT 1

SELECT T2.firstname ,  T2.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom GROUP BY T2.firstname ,  T2.lastname ORDER BY count(*) DESC LIMIT 1
4788
 SELECT DISTINCT T1.customer_name FROM customers AS T1 JOIN customer_orders AS T2 ON T1.customer_id  =  T2.customer_id JOIN order_items AS T3 ON T2.order_id  =  T3.order_id GROUP BY T1.customer_id HAVING COUNT (DISTINCT T3.product_id)  >=  3

SELECT DISTINCT T1.customer_name FROM customers AS T1 JOIN Customer_Orders AS T2 ON T1.customer_id  =  T2.customer_id JOIN Order_Items AS T3 ON T2.order_id  =  T3.order_id GROUP BY T1.customer_name HAVING COUNT(DISTINCT T3.product_id)  >=  3
5360
 SELECT DISTINCT staff_first_name ,  staff_last_name FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T2.problem_id = 1

SELECT DISTINCT T1.staff_first_name , T1.staff_last_name FROM staff AS T1 JOIN problem_log AS T2 ON T1.staff_id = T2.assigned_to_staff_id WHERE T2.problem_id = 1
3872
 SELECT sum(Amount_Settled) FROM Settlements

SELECT sum(Amount_Settled) FROM Settlements
2616
 SELECT roomName ,  bedType FROM Rooms WHERE decor = "traditional";

SELECT bedType, roomName FROM Rooms WHERE decor  =  'traditional';
6851
 SELECT city FROM airports WHERE country  =  'United States' GROUP BY city HAVING count(*)  >  3

SELECT city FROM airports WHERE country  =  'United States' GROUP BY city HAVING count(*) > 3
5553
 SELECT t1.product_name ,  t1.typical_buying_price ,  t1.typical_selling_price FROM products AS t1 JOIN ref_colors AS t2 ON t1.color_code  =  t2.color_code WHERE t2.color_description  =  "yellow"

SELECT product_name, typical_buying_price, typical_selling_price FROM products JOIN ref_colors ON products.color_code = ref_colors.color_code WHERE color_description = "yellow"
3863
 SELECT Date_Claim_Made FROM Claims WHERE Amount_Settled  <=  ( SELECT avg(Amount_Settled) FROM Claims )

RateLimitError
RateLimitError
SELECT Start_Date FROM Claims WHERE Amount_Claimed <= (SELECT AVG(Amount_Claimed) FROM Claims)
4801
 SELECT avg(International_Passengers) FROM airport

RateLimitError
RateLimitError
SELECT avg(T3.International_Passengers) FROM airport_aircraft AS T1 JOIN airport AS T2 ON T1.Airport_ID  =  T2.Airport_ID JOIN aircraft AS T3 ON T1.Aircraft_ID  =  T3.Aircraft_ID
1922
 SELECT T1.name ,  count(*) FROM building AS T1 JOIN institution AS T2 ON T1.building_id  =  T2.building_id GROUP BY T1.building_id

SELECT name ,  count(*) FROM building JOIN institution ON building_id  =  building_id GROUP BY name
4421
 SELECT avg(age) ,  gender FROM Person GROUP BY gender

SELECT gender, avg(age) FROM Person GROUP BY gender
2574
 SELECT roomName ,  RoomId FROM Rooms WHERE basePrice  >  160 AND maxOccupancy  >  2;

RateLimitError
RateLimitError
SELECT roomname ,  roomid FROM Rooms WHERE basePrice  >  160 AND beds  >  2;
2300
 SELECT count(DISTINCT Company) FROM entrepreneur

SELECT COUNT(Company) FROM entrepreneur
6868
 SELECT T1.country ,  T1.name ,  count(*) FROM airlines AS T1 JOIN routes AS T2 ON T1.alid  =  T2.alid GROUP BY T1.country ,  T1.name

SELECT country, alid, count(*) FROM routes AS T1 JOIN airports AS T2 ON T1.dst_apid  =  T2.apid JOIN airlines AS T3 ON T1.alid  =  T3.alid GROUP BY country, alid
1123
 SELECT Country FROM mountain WHERE Height  >  5000

SELECT T2.Country FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID WHERE T2.Height  >  5000
4711
 SELECT product_id ,  product_type_code FROM products ORDER BY product_price LIMIT 1

SELECT product_id ,  product_type_code FROM products WHERE product_price = (SELECT MIN(product_price) FROM products)
4068
 SELECT count(*) FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T2.firstname  =  "KAWA" AND T2.lastname  =  "GORDON"

SELECT count(*) FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.firstname  =  "KAWA" AND T1.lastname  =  "GORDON"
4662
 SELECT CName FROM COURSE ORDER BY Credits

SELECT CName FROM COURSE ORDER BY Credits
6691
 SELECT sum(T1.amount_payment) FROM Customer_Payments AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id WHERE T2.first_name = "Carole" AND T2.last_name = "Bernhard"

RateLimitError
SELECT sum(amount_payment) FROM Customer_Payments WHERE customer_id = (SELECT customer_id FROM Customers WHERE first_name = "Carole" AND last_name = "Bernhard");
4957
 SELECT pName ,  HS FROM Player WHERE HS  <  1500

RateLimitError
RateLimitError
SELECT T1.pName ,  T1.HS FROM player AS T1 JOIN tryout AS T2 ON T1.pID  =  T2.pID WHERE T1.HS  <  1500
1567
 SELECT T1.customer_id ,  T2.customer_first_name ,  T2.customer_last_name FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id ORDER BY count(*) DESC LIMIT 1

SELECT T2.customer_id ,  T2.customer_first_name ,  T2.customer_last_name FROM Customers AS T2 JOIN (SELECT T1.customer_id ,  count(*) AS accounts FROM Accounts AS T1 GROUP BY T1.customer_id ORDER BY accounts DESC LIMIT 1) AS T3 ON T2.customer_id  =  T3.customer_id
5476
 SELECT DISTINCT T1.Age FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.Secretary_Vote WHERE T2.Election_Cycle  =  "Fall"

SELECT DISTINCT T1.Age FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.Secretary_Vote WHERE T2.Election_Cycle  =  "Fall"
2585
 SELECT Adults FROM Reservations WHERE CheckIn  =  "2010-10-23" AND FirstName  =  "CONRAD" AND LastName  =  "SELBIG";

RateLimitError
SELECT count(adults) FROM Reservations WHERE firstName = 'CONRAD' AND lastName = 'SELBIG' AND checkIn = '2010-10-23';
1823
 SELECT T1.name ,  T3.balance + T2.balance FROM accounts AS T1 JOIN checking AS T2 ON T1.custid  =  T2.custid JOIN savings AS T3 ON T1.custid  =  T3.custid WHERE T3.balance  <  T2.balance

SELECT T1.name ,  T2.balance + T3.balance AS total FROM accounts AS T1 JOIN savings AS T2 ON T1.custid  =  T2.custid JOIN checking AS T3 ON T1.custid  =  T3.custid WHERE T2.balance  <  T3.balance
4626
 SELECT T1.customer_name ,  T1.customer_phone FROM customers AS T1 JOIN mailshot_customers AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.outcome_code  =  'No Response'

SELECT T2.customer_name ,  T2.customer_phone FROM mailshot_customers AS T1 JOIN customers AS T2 ON T1.customer_id  =  T2.customer_id WHERE T1.outcome_code  =  'No Response'
5830
 SELECT College FROM submission WHERE Scores  >  90 INTERSECT SELECT College FROM submission WHERE Scores  <  80

SELECT DISTINCT College FROM submission WHERE Scores > 90 AND Scores < 80
3081
 SELECT sum(T2.amount) FROM bank AS T1 JOIN loan AS T2 ON T1.branch_id  =  T2.branch_id WHERE T1.state  =  'New York'

RateLimitError
SELECT sum(amount) FROM bank JOIN loan ON bank.branch_id  =  loan.branch_id WHERE state  =  'New York'
5585
 SELECT t2.unit_of_measure FROM products AS t1 JOIN ref_product_categories AS t2 ON t1.product_category_code  =  t2.product_category_code WHERE t1.product_name  =  "cumin"

SELECT t2.unit_of_measure FROM products AS t1 JOIN ref_product_categories AS t2 ON t1.product_category_code  =  t2.product_category_code WHERE t1.product_name  =  "cumin"
4672
 SELECT T1.DName FROM DEPARTMENT AS T1 JOIN MINOR_IN AS T2 ON T1.DNO  =  T2.DNO GROUP BY T2.DNO ORDER BY count(*) DESC LIMIT 1

SELECT T2.DName FROM MINOR_IN AS T1 JOIN DEPARTMENT AS T2 ON T1.DNO  =  T2.DNO GROUP BY T1.DNO ORDER BY count(*) DESC LIMIT 1
2997
 SELECT DISTINCT T1.first_name ,  T1.last_name FROM staff AS T1 JOIN rental AS T2 ON T1.staff_id  =  T2.staff_id JOIN customer AS T3 ON T2.customer_id  =  T3.customer_id WHERE T3.first_name  =  'APRIL' AND T3.last_name  =  'BURNS'

SELECT first_name ,  last_name FROM staff JOIN rental ON staff_id  =  rental.staff_id JOIN customer ON rental.customer_id  =  customer.customer_id JOIN inventory ON rental.inventory_id  =  inventory.inventory_id JOIN film ON inventory.film_id  =  film.film_id WHERE first_name  =  'April' AND last_name  =  'Burns'
3204
 SELECT count(*) ,  class_room FROM CLASS GROUP BY class_room HAVING count(*)  >=  2

SELECT T1.class_room ,  count(*) FROM CLASS AS T1 JOIN CLASS AS T2 ON T1.class_code  =  T2.class_code WHERE T1.class_room  =  T2.class_room GROUP BY T1.class_room HAVING count(*)  >  1
5091
 SELECT count(*) FROM BOOKINGS

RateLimitError
SELECT COUNT(*) FROM Bookings
2021
 SELECT headquarters FROM company EXCEPT SELECT headquarters FROM company WHERE main_industry  =  'Banking'

SELECT headquarters FROM company WHERE main_industry  =  'Banking' INTERSECT SELECT headquarters FROM company WHERE main_industry  <>  'Banking'
3360
 SELECT avg(T2.Points) FROM club AS T1 JOIN player AS T2 ON T1.Club_ID  =  T2.Club_ID WHERE T1.name  =  "AIB"

SELECT avg(Points) FROM player WHERE Club_ID  =  (SELECT Club_ID FROM club WHERE name  =  'AIB')
6750
 SELECT T1.fname ,  T1.lname FROM Faculty AS T1 JOIN Student AS T2 ON T1.FacID  =  T2.advisor WHERE T2.fname  =  "Linda" AND T2.lname  =  "Smith"

SELECT T1.Fname ,  T1.Lname FROM Student AS T1 JOIN Faculty AS T2 ON T1.advisor  =  T2.FacID WHERE T1.Lname  =  'Smith' AND T1.Fname  =  'Linda'
5254
 SELECT TYPE FROM vocals AS T1 JOIN band AS T2 ON T1.bandmate  =  T2.id WHERE firstname  =  "Solveig" GROUP BY TYPE ORDER BY count(*) DESC LIMIT 1

SELECT T1.Type FROM Vocals AS T1 JOIN Band AS T2 ON T1.Bandmate  =  T2.id JOIN Songs AS T3 ON T3.SongId  =  T1.SongId WHERE T2.Firstname  =  "Solveig" GROUP BY T1.Type
4577
 SELECT Industry FROM Companies WHERE Headquarters  =  "USA" INTERSECT SELECT Industry FROM Companies WHERE Headquarters  =  "China"

SELECT T1.Industry FROM Companies AS T1 JOIN Companies AS T2 ON T1.Headquarters  =  "USA" AND T2.Headquarters  =  "China" WHERE T1.id  =  T2.id
4859
 SELECT DISTINCT date_moved_in FROM residents

SELECT DISTINCT date_moved_in FROM Residents
3182
 SELECT count(*) FROM employee AS T1 JOIN CLASS AS T2 ON T1.EMP_NUM  =  T2.PROF_NUM WHERE T1.EMP_LNAME  =  'Graztevski'

RateLimitError
RateLimitError
SELECT count(*) FROM CLASS AS T1 JOIN professor AS T2 ON T1.prof_num  =  T2.emp_num WHERE T2.emp_lname  =  'Graztevski'
97
 SELECT first_name FROM people ORDER BY first_name

SELECT first_name FROM people ORDER BY first_name
6611
 SELECT name ,  service FROM train ORDER BY TIME

SELECT T2.name ,  T2.service FROM train_station AS T1 JOIN train AS T2 ON T1.train_id  =  T2.train_id ORDER BY T2.time
2774
 SELECT T1.County_name ,  COUNT(*) FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District GROUP BY T1.County_id

SELECT County_name,Delegate FROM county ORDER BY Delegate DESC
4584
 SELECT Product_Name FROM Products ORDER BY Product_Price ASC

SELECT Product_Name FROM Products ORDER BY Product_Price ASC
1997
 SELECT company ,  main_industry FROM company WHERE headquarters != 'USA'

RateLimitError
RateLimitError
SELECT company ,  main_industry FROM company WHERE headquarters <> 'USA'
5097
 SELECT count(*) FROM CUSTOMERS

SELECT COUNT(*) FROM Customers
6664
 SELECT customer_status_code ,  cell_mobile_phone_number ,  email_address FROM Customers WHERE first_name = "Marina" OR last_name  =  "Kohler"

SELECT T1.customer_status_code , T2.cell_mobile_phone_number , T3.email_address FROM Customers AS T1 JOIN Customers AS T2 ON T1.customer_id = T2.customer_id JOIN Customers AS T3 ON T1.customer_id = T3.customer_id WHERE T1.last_name = "Kohler" OR T2.first_name = "Marina";
2022
 SELECT headquarters FROM company EXCEPT SELECT headquarters FROM company WHERE main_industry  =  'Banking'

SELECT headquarters FROM company WHERE company_id NOT IN (SELECT company_id FROM station_company WHERE main_industry = 'Banking')
3910
 SELECT T2.name FROM appointment AS T1 JOIN physician AS T2 ON T1.Physician  =  T2.EmployeeID

SELECT DISTINCT T2.name FROM appointment AS T1 JOIN physician AS T2 ON T1.physician  =  T2.employeeid
679
 SELECT customer_id ,  count(*) FROM Accounts GROUP BY customer_id ORDER BY count(*) DESC LIMIT 1

SELECT customer_id ,  COUNT(*) AS num_accounts FROM Accounts GROUP BY customer_id ORDER BY num_accounts DESC LIMIT 1
4474
 SELECT T1.name ,  T1.age ,  T1.job FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T2.friend =  'Alice' AND T2.year  =  (SELECT max(YEAR) FROM PersonFriend WHERE friend =  'Alice')

RateLimitError
SELECT T2.name, T2.age, T2.job FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.name WHERE T1.name  =  'Alice' AND T2.YEAR  =  (SELECT max(YEAR) FROM PersonFriend WHERE name  =  'Alice')
4265
 SELECT count(*) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t1.clubname  =  "Pen and Paper Gaming"

SELECT count(*) FROM member_of_club WHERE clubid = 1
3014
 SELECT avg(no_of_customers) FROM bank

SELECT avg(no_of_customers) FROM bank
4703
 SELECT CName FROM COURSE WHERE Credits  =  3 UNION SELECT CName FROM COURSE WHERE Credits  =  1 AND Hours  =  4

SELECT CName FROM COURSE WHERE Credits  =  3 OR Credits  =  1 AND Hours  =  4
1264
 SELECT apt_type_code ,  max(room_count) ,  min(room_count) FROM Apartments GROUP BY apt_type_code

SELECT apt_type_code ,  min(room_count) ,  max(room_count) FROM Apartments GROUP BY apt_type_code
2356
 SELECT T1.campus ,  sum(T2.degrees) FROM campuses AS T1 JOIN degrees AS T2 ON T1.id  =  T2.campus WHERE T2.year  >=  1998 AND T2.year  <=  2002 GROUP BY T1.campus

RateLimitError
SELECT SUM(degrees) FROM degrees WHERE year  BETWEEN  1998 AND  2002
4846
 SELECT T1.service_id ,  T1.service_details ,  count(*) FROM Services AS T1 JOIN Residents_Services AS T2 ON T1.service_id  =  T2.service_id GROUP BY T1.service_id ORDER BY count(*) DESC LIMIT 1

RateLimitError
SELECT T1.service_id ,  T1.service_details ,  count(*) AS Number_of_Service_Provided FROM Services AS T1 JOIN Residents_Services AS T2 ON T1.service_id  =  T2.service_id GROUP BY T1.service_id ORDER BY Number_of_Service_Provided  DESC LIMIT 1
2327
 SELECT campus FROM campuses WHERE LOCATION  =  "Chico"

RateLimitError
SELECT campus FROM campuses WHERE LOCATION  =  "Chico"
6128
 SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id ORDER BY t2.order_date DESC LIMIT 1

SELECT customer_name FROM customers JOIN customer_orders ON customers.customer_id = customer_orders.customer_id ORDER BY order_date DESC LIMIT 1
1058
 SELECT DISTINCT POSITION FROM match_season

RateLimitError
SELECT DISTINCT Position FROM match_season
4742
 SELECT dept_store_chain_id FROM department_stores GROUP BY dept_store_chain_id ORDER BY count(*) DESC LIMIT 2

SELECT dept_store_chain_id FROM dept_stores GROUP BY dept_store_chain_id ORDER BY count(*) DESC LIMIT 2
5664
 SELECT T2.customer_name ,  T3.city ,  T1.date_from ,  T1.date_to FROM customer_address_history AS T1 JOIN customers AS T2 ON T1.customer_id  =  T2.customer_id JOIN addresses AS T3 ON T1.address_id  =  T3.address_id

SELECT customer_name ,  customer_address ,  city ,  date_from ,  date_to FROM customers ,  customer_address_history WHERE customers.customer_id  =  customer_address_history.customer_id
1240
 SELECT sum(T2.room_count) FROM Apartment_Facilities AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.facility_code  =  "Gym"

SELECT SUM(room_count) FROM Apartments WHERE facility_code  =  "Gym"
5108
 SELECT DISTINCT Product_Name FROM PRODUCTS WHERE Product_Price  >  (SELECT avg(Product_Price) FROM PRODUCTS)

SELECT DISTINCT Product_Name FROM Products WHERE Product_Price > (SELECT AVG(Product_Price) FROM Products)
5776
 SELECT t1.email_address FROM customers AS t1 JOIN complaints AS t2 ON t1.customer_id  =  t2.customer_id GROUP BY t1.customer_id ORDER BY count(*) LIMIT 1

RateLimitError
RateLimitError
SELECT t1.email_address FROM customers AS t1 JOIN complaints AS t2 ON t1.customer_id  =  t2.customer_id JOIN products AS t3 ON t2.product_id  =  t3.product_id GROUP BY t2.product_id ORDER BY count(*) DESC LIMIT 1
5973
 SELECT DISTINCT gtype FROM Video_games

SELECT DISTINCT gtype FROM Video_games
2127
 SELECT Employees.employee_name FROM Employees JOIN Circulation_History ON Circulation_History.employee_id = Employees.employee_id WHERE Circulation_History.document_id = 1;

SELECT employee_name FROM Circulation_History JOIN Employees ON Circulation_History.employee_id = Employees.employee_id WHERE document_id = 1;
3959
 SELECT T1.name FROM physician AS T1 JOIN prescribes AS T2 ON T1.employeeid = T2.physician ORDER BY T2.dose DESC LIMIT 1

SELECT T1.name FROM prescribes AS T1 JOIN procedures AS T2 ON T1.Medication  =  T2.Code JOIN procedures AS T3 ON T3.Code  =  T1.Medication WHERE T3.cost  =  (SELECT max(T4.cost) FROM procedures AS T4)
2269
 SELECT avg(Money_Requested) FROM entrepreneur

RateLimitError
RateLimitError
SELECT avg(Money_Requested) FROM entrepreneur

In [483]:
df_code_davinci[~(df_code_davinci['model_response'] == '')].shape

(100, 17)

In [484]:
df_code_davinci[~(df_code_davinci['model_response'].isna())].shape

(100, 17)

In [485]:
df_code_davinci['open_ai_execution'] = df_code_davinci.apply(lambda x: execution(x, 'open_ai_completion'), axis=1)
df_code_davinci['model_response_execution'] = df_code_davinci.apply(lambda x: execution(x, 'model_response'), axis=1)
df_code_davinci['execution_accuracy'] = np.where(df_code_davinci['open_ai_execution'] == df_code_davinci['model_response_execution'], 1, 0)
df_code_davinci[~(df_code_davinci['model_response'] == '') & ~(df_code_davinci['model_response'].isna())]['execution_accuracy'].mean()

0.57

In [494]:
i = 40
print(df_code_davinci[df_code_davinci['execution_accuracy'] == 0].iloc[i]['open_ai_prompt'])
print(df_code_davinci[df_code_davinci['execution_accuracy'] == 0].iloc[i]['open_ai_completion'])
print(df_code_davinci[df_code_davinci['execution_accuracy'] == 0].iloc[i]['model_response'])

Convert text to SQL.

DDL:
```
CREATE TABLE Apartment_Buildings (building_id INTEGER ,building_short_name CHAR(15),building_full_name VARCHAR(80),building_description VARCHAR(255),building_address VARCHAR(255),building_manager VARCHAR(50),building_phone VARCHAR(80));CREATE TABLE Apartments (apt_id INTEGER  ,building_id INTEGER ,apt_type_code CHAR(15),apt_number CHAR(10),bathroom_count INTEGER,bedroom_count INTEGER,room_count CHAR(5));CREATE TABLE Apartment_Facilities (apt_id INTEGER ,facility_code CHAR(15) );CREATE TABLE Guests (guest_id INTEGER  ,gender_code CHAR(1),guest_first_name VARCHAR(80),guest_last_name VARCHAR(80),date_of_birth DATETIME);CREATE TABLE Apartment_Bookings (apt_booking_id INTEGER ,apt_id INTEGER,guest_id INTEGER ,booking_status_code CHAR(15) ,booking_start_date DATETIME,booking_end_date DATETIME);CREATE TABLE View_Unit_Status (apt_id INTEGER,apt_booking_id INTEGER,status_date DATETIME ,available_yn BOOLEAN);
```

Question:
"""Which apartments have bookings with status code "Confirmed"? Return their apartment numbers."""
Answer:
SELECT DISTINCT T2.apt_number FROM Apartment_Bookings AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.booking_status_code  =  "Confirmed"

Question:
"""Return the apartment number and the number of rooms for each apartment."""
Answer:
SELECT apt_number ,  room_count FROM Apartments

Question:
"""Return all the apartment numbers sorted by the room count in ascending order."""
Answer:
SELECT apt_number FROM Apartments ORDER BY room_count ASC

Question:
"""Show the total number of rooms of all apartments with facility code "Gym"."""
Answer:

 SELECT sum(T2.room_count) FROM Apartment_Facilities AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.facility_code  =  "Gym"

SELECT SUM(room_count) FROM Apartments WHERE facility_code  =  "Gym"

In [495]:
df_code_davinci2 = df.sample(100).copy()
df_code_davinci2['model_response'] = ''

data = []
for idx, row in df_code_davinci2.iterrows():
    print(idx)
    if row['model_response'] != '':
        print('already completed')
        data.append(row['model_response'])
        continue
    
    print(row['open_ai_completion'])
    new_response = call_raw_model(row, engine="code-davinci-002", stop='\n', max_tokens=128)
    data.append(new_response)
    df_code_davinci2.loc[idx,'model_response'] = new_response

6973
 SELECT publisher FROM book_club GROUP BY publisher ORDER BY count(*) DESC LIMIT 1

SELECT publisher FROM book_club GROUP BY publisher ORDER BY COUNT(*) DESC LIMIT 1
6436
 SELECT T1.project_id ,  T1.project_details FROM Projects AS T1 JOIN Documents AS T2 ON T1.project_id  =  T2.project_id GROUP BY T1.project_id HAVING count(*)  >  2

SELECT T1.project_id ,  T1.project_details FROM Projects AS T1 JOIN Documents AS T2 ON T1.project_id  =  T2.project_id GROUP BY T1.project_id ,  T1.project_details HAVING COUNT(T2.document_id)  >  2
5046
 SELECT count(DISTINCT state) FROM college WHERE enr  >  (SELECT avg(enr) FROM college)

SELECT count(DISTINCT state) FROM college WHERE enr > (SELECT avg(enr) FROM college)
3325
 SELECT T1.stu_lname FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num WHERE T2.enroll_grade  =  'A' AND T2.class_code  =  10018

SELECT stu_lname FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num WHERE T2.class_code  =  '10018' AND T2.enroll_grade  =  'A'
4127
 SELECT Country FROM market ORDER BY Country ASC

SELECT Country FROM market ORDER BY Country ASC
3241
 SELECT count(*) FROM CLASS AS T1 JOIN enroll AS T2 ON T1.class_code  =  T2.class_code WHERE T1.crs_code  =  'ACCT-211'

SELECT COUNT(*) FROM enroll WHERE class_code  =  'ACCT-211'
20
 SELECT Hosts FROM farm_competition WHERE Theme !=  'Aliens'

SELECT Hosts FROM farm_competition WHERE Theme  !=  "Aliens"
4750
 SELECT T1.staff_id ,  T1.staff_name FROM staff AS T1 JOIN Staff_Department_Assignments AS T2 ON T1.staff_id  =  T2.staff_id ORDER BY date_assigned_to - date_assigned_from LIMIT 1

SELECT T1.staff_id, T1.staff_name FROM staff AS T1 JOIN staff_department_assignments AS T2 ON T1.staff_id  =  T2.staff_id WHERE T2.date_assigned_from  =  (SELECT MIN(T3.date_assigned_from) FROM staff_department_assignments AS T3)
3173
 SELECT count(*) FROM professor AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code WHERE DEPT_NAME  =  "Accounting"

SELECT count(*) FROM professor WHERE dept_code  =  "ACCT"
6717
 SELECT DISTINCT rank FROM Faculty

SELECT DISTINCT rank FROM Faculty
1102
 SELECT College FROM match_season GROUP BY College HAVING count(*)  >=  2 ORDER BY College DESC

RateLimitError
SELECT College, COUNT(*) FROM match_season GROUP BY College HAVING COUNT(*)  >=  2 ORDER BY College DESC
1985
 SELECT Carrier FROM phone GROUP BY Carrier ORDER BY COUNT(*) DESC LIMIT 1

SELECT Carrier, count(*) as c FROM phone GROUP BY Carrier ORDER BY c DESC LIMIT 1
4746
 SELECT product_type_code ,  max(product_price) ,  min(product_price) FROM products GROUP BY product_type_code

RateLimitError
SELECT product_type_code , MAX(product_price) , MIN(product_price) FROM products GROUP BY product_type_code
6799
 SELECT T1.lname FROM Faculty AS T1 JOIN Faculty_participates_in AS T2 ON T1.facID  =  T2.facID JOIN activity AS T3 ON T2.actid  =  T2.actid WHERE T3.activity_name  =  'Canoeing' INTERSECT SELECT T1.lname FROM Faculty AS T1 JOIN Faculty_participates_in AS T2 ON T1.facID  =  T2.facID JOIN activity AS T3 ON T2.actid  =  T2.actid WHERE T3.activity_name  =  'Kayaking'

RateLimitError
RateLimitError
SELECT Fname FROM Faculty WHERE FacID IN (SELECT FacID FROM Faculty_Participates_in WHERE actid  =  (SELECT actid FROM Activity WHERE activity_name  =  "Canoeing and Kayaking"))
2212
 SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN results AS T2 ON T1.driverid  =  T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid WHERE T3.year > 2010 GROUP BY T1.driverid ORDER BY count(*) DESC LIMIT 1

SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN results AS T2 ON T1.driverid = T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid GROUP BY T1.driverid HAVING count(*)  =  (SELECT max(count) FROM (SELECT count(*) FROM results AS T1 JOIN races AS T2 ON T1.raceid = T2.raceid GROUP BY T1.driverid HAVING T2.year > 2010))
3826
 SELECT T1.course_name ,  COUNT(*) FROM Courses AS T1 JOIN Student_Course_Enrolment AS T2 ON T1.course_id  =  T2.course_id GROUP BY T1.course_name

SELECT course_name ,  COUNT(*) FROM Courses JOIN Student_Course_Enrolment ON Courses.course_id = Student_Course_Enrolment.course_id GROUP BY course_name
715
 SELECT T1.customer_id ,  T2.customer_first_name ,  T2.customer_last_name FROM Customers_cards AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id HAVING count(*)  >=  2

RateLimitError
SELECT T1.customer_id ,  T1.customer_first_name ,  T1.customer_last_name FROM Customers AS T1 JOIN Customers_Cards AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id ,  T1.customer_first_name ,  T1.customer_last_name HAVING count(*)  >=  2
2916
 SELECT lname FROM authors WHERE fname  =  "Amal"

RateLimitError
SELECT lname FROM authors WHERE fname  =  "Amal"
1421
 SELECT title FROM course WHERE course_id NOT IN (SELECT course_id FROM prereq)

SELECT title FROM course WHERE course_id NOT IN (SELECT course_id FROM prereq)
1731
 SELECT T3.Player_name ,  T2.coach_name FROM player_coach AS T1 JOIN coach AS T2 ON T1.Coach_ID  =  T2.Coach_ID JOIN player AS T3 ON T1.Player_ID  =  T3.Player_ID ORDER BY T3.Votes DESC

SELECT T1.player_name, T2.coach_name FROM player AS T1 JOIN player_coach AS T3 ON T1.player_id = T3.player_id JOIN coach AS T2 ON T3.coach_id = T2.coach_id ORDER BY T1.votes DESC
4230
 SELECT location_code FROM Document_locations GROUP BY location_code HAVING count(*)  >=  3

RateLimitError
SELECT location_code FROM Document_locations GROUP BY location_code HAVING COUNT(*) >= 3
1232
 SELECT T2.guest_first_name ,  T1.booking_start_date ,  T1.booking_start_date FROM Apartment_Bookings AS T1 JOIN Guests AS T2 ON T1.guest_id  =  T2.guest_id

SELECT guest_first_name, booking_start_date, booking_end_date FROM Guests AS T1 JOIN Apartment_Bookings AS T2 ON T1.guest_id  =  T2.guest_id
2821
 SELECT Address FROM Restaurant WHERE ResName = "Subway";

SELECT Address FROM Restaurant WHERE ResName = "Subway";
1518
 SELECT sum(t1.amount_claimed) FROM claim_headers AS t1 JOIN claims_documents AS t2 ON t1.claim_header_id  =  t2.claim_id WHERE t2.created_date  =  (SELECT created_date FROM claims_documents ORDER BY created_date LIMIT 1)

SELECT sum(amount_claimed) FROM claim_headers WHERE claim_id  =  (SELECT claim_id FROM claims_documents ORDER BY created_date DESC LIMIT 1)
1730
 SELECT T3.Player_name ,  T3.gender FROM player_coach AS T1 JOIN coach AS T2 ON T1.Coach_ID  =  T2.Coach_ID JOIN player AS T3 ON T1.Player_ID  =  T3.Player_ID WHERE T1.Starting_year  >  2011

SELECT T3.Player_name ,  T3.gender FROM player_coach AS T1 JOIN coach AS T2 ON T1.Coach_ID  =  T2.Coach_ID JOIN player AS T3 ON T1.Player_ID  =  T3.Player_ID WHERE T1.Starting_year  >  2011
4603
 SELECT LOCATION FROM festival_detail ORDER BY Num_of_Audience DESC LIMIT 1

RateLimitError
SELECT T1.Location FROM festival_detail AS T1 JOIN (SELECT Festival_ID, MAX(Num_of_Audience) AS Num_of_Audience FROM festival_detail) AS T2 ON T1.Festival_ID  =  T2.Festival_ID AND T1.Num_of_Audience  =  T2.Num_of_Audience
423
 SELECT T3.name FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid JOIN Aircraft AS T3 ON T3.aid  =  T2.aid WHERE T1.name  =  "John Williams"

SELECT T2.name FROM Aircraft AS T2 JOIN Certificate AS T1 ON T1.aid  =  T2.aid JOIN Employee AS T3 ON T1.eid  =  T3.eid WHERE T3.name  =  "John Williams"
739
 SELECT T2.card_type_code ,  count(*) FROM Financial_transactions AS T1 JOIN Customers_cards AS T2 ON T1.card_id  =  T2.card_id GROUP BY T2.card_type_code

RateLimitError
SELECT T1.card_type_code, count(*) FROM Customers_cards AS T1 JOIN Financial_Transactions AS T2 ON T1.card_id  =  T2.card_id GROUP BY T1.card_type_code
2491
 SELECT director FROM Movie GROUP BY director HAVING count(*)  =  1

RateLimitError
RateLimitError
SELECT T1.director FROM Movie AS T1 JOIN Rating AS T2 ON T1.mID  =  T2.mID GROUP BY T1.director HAVING count(*)  =  1
3845
 SELECT count(*) FROM Students WHERE student_id NOT IN (SELECT student_id FROM Student_Course_Enrolment)

SELECT COUNT(*) FROM Students WHERE student_id  NOT IN (SELECT T1.student_id FROM Student_Course_Enrolment AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id)
2919
 SELECT fname FROM authors ORDER BY fname

RateLimitError

SELECT fname FROM authors ORDER BY fname ASC
4225
 SELECT T1.date_in_location_from ,  T1.date_in_locaton_to FROM Document_locations AS T1 JOIN All_documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.document_name  =  "Robin CV"

SELECT Date_in_Location_From ,  Date_in_Locaton_To FROM Document_locations AS T1 JOIN All_documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.document_name  =  "Robin CV"
761
 SELECT count(*) FROM race

SELECT count(*) FROM race
6146
 SELECT Age FROM artist

SELECT Age FROM artist
6660
 SELECT email_address ,  date_of_birth FROM Customers WHERE first_name = "Carole"

RateLimitError
SELECT email_address, date_of_birth FROM Customers WHERE first_name = "Carole";
2221
 SELECT max(T2.fastestlapspeed) FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year = 2008 AND T1.name = "Monaco Grand Prix"

SELECT MAX(T2.fastestlapspeed) FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.name = "Monaco Grand Prix" AND T1.year = 2008
5781
 SELECT t1.phone_number FROM customers AS t1 JOIN complaints AS t2 ON t1.customer_id  =  t2.customer_id ORDER BY t2.date_complaint_raised DESC LIMIT 1

SELECT phone_number FROM customers JOIN complaints ON customers.customer_id  =  complaints.customer_id ORDER BY date_complaint_raised DESC LIMIT 1
2103
 SELECT shipping_agent_code FROM Ref_Shipping_Agents WHERE shipping_agent_name = "UPS";

RateLimitError
SELECT shipping_agent_code FROM Ref_Shipping_Agents WHERE shipping_agent_name = "UPS";
597
 SELECT phone FROM employees WHERE first_name = "Nancy" AND last_name = "Edwards";

SELECT phone FROM employees WHERE first_name  =  "Nancy" AND last_name  =  "Edwards";
2903
 SELECT t1.name FROM inst AS t1 JOIN authorship AS t2 ON t1.instid  =  t2.instid JOIN papers AS t3 ON t2.paperid  =  t3.paperid GROUP BY t1.name ORDER BY count(*) DESC LIMIT 1

SELECT t2.name FROM authorship AS t1 JOIN inst AS t2 ON t1.instid  =  t2.instid GROUP BY t2.name ORDER BY count(*) DESC LIMIT 1
4007
 SELECT Name FROM ship WHERE Nationality  =  "United States" OR Nationality  =  "United Kingdom"

SELECT Name FROM ship WHERE Nationality = 'US' OR Nationality = 'UK'
1569
 SELECT T1.customer_id ,  T2.customer_first_name ,  T2.customer_last_name ,  count(*) FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id GROUP BY T1.customer_id

SELECT Customers.customer_id ,  Customers.customer_first_name ,  Customers.customer_last_name ,  count(Accounts.account_id) FROM Customers LEFT JOIN Accounts ON Customers.customer_id = Accounts.customer_id GROUP BY Customers.customer_id
3429
 SELECT job_id ,  hire_date FROM employees WHERE hire_date BETWEEN '2007-11-05' AND '2009-07-05'

RateLimitError
SELECT job_id, hire_date FROM employees WHERE hire_date BETWEEN '2007-11-05' AND '2009-07-05'
4782
 SELECT max(product_price) ,  min(product_price) ,  product_type_code FROM products GROUP BY product_type_code ORDER BY product_type_code

RateLimitError
RateLimitError
RateLimitError
SELECT product_type_code ,  max(product_price) ,  min(product_price) FROM products GROUP BY product_type_code ORDER BY product_type_code
948
 SELECT T1.name FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T1.id  =  T2.enzyme_id JOIN medicine AS T3 ON T2.medicine_id  =  T3.id WHERE T3.name  =  'Amisulpride' AND T2.interaction_type  =  'inhibitor'

SELECT T1.name FROM enzyme AS T1 JOIN medicine_enzyme_interaction AS T2 ON T2.enzyme_id  =  T1.id JOIN medicine AS T3 ON T3.id  =  T2.medicine_id WHERE T3.name  =  'Amisulpride' AND T2.interaction_type  =  'inhibitor'
142
 SELECT id FROM station WHERE city  =  "San Francisco" INTERSECT SELECT station_id FROM status GROUP BY station_id HAVING avg(bikes_available)  >  10

SELECT station_id FROM status WHERE bikes_available  >  10 EXCEPT SELECT id FROM station WHERE city  <>  "San Francisco"
1427
 SELECT name FROM student WHERE id IN (SELECT id FROM takes WHERE semester  =  'Fall' AND YEAR  =  2003)

SELECT name FROM student AS T1 JOIN takes AS T2 ON T1.ID  =  T2.ID WHERE semester  =  'Fall' AND year  =  2003
2718
 SELECT name FROM storm WHERE storm_id NOT IN (SELECT storm_id FROM affected_region)

SELECT name FROM storm WHERE storm_id NOT IN (SELECT storm_id FROM affected_region)
4093
 SELECT T2.firstname ,  T2.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom GROUP BY T2.firstname ,  T2.lastname ORDER BY count(*) DESC LIMIT 1

SELECT T2.firstname ,  T2.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom GROUP BY T2.firstname ,  T2.lastname ORDER BY count(*) DESC LIMIT 1
6913
 SELECT T1.date_order_placed FROM orders AS T1 JOIN shipments AS T2 ON T1.order_id = T2.order_id WHERE T2.shipment_tracking_number = 3452

SELECT date_order_placed FROM shipments JOIN orders ON shipments.order_id = orders.order_id WHERE shipment_tracking_number = "3452"
5854
 SELECT min(amount_of_transaction) FROM TRANSACTIONS WHERE transaction_type_code  =  "PUR" AND share_count  >  50

SELECT MIN(amount_of_transaction) FROM TRANSACTIONS WHERE transaction_type_code  =  'PUR' AND share_count  >  50
616
 SELECT name FROM playlists;

SELECT name FROM playlists;
1565
 SELECT count(*) ,  customer_id FROM Accounts GROUP BY customer_id

SELECT customer_id ,  count(*) FROM Accounts GROUP BY customer_id
3333
 SELECT T2.dept_name FROM course AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code WHERE T1.crs_description LIKE '%Statistics%'

SELECT T2.dept_name FROM course AS T1 JOIN department AS T2 ON T1.dept_code  =  T2.dept_code WHERE T1.crs_description  LIKE  '%Statistics%'
1228
 SELECT DISTINCT T2.apt_number FROM Apartment_Bookings AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.booking_status_code  =  "Confirmed"

SELECT DISTINCT T2.apt_number FROM Apartment_Bookings AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.booking_status_code  =  "Confirmed"
5495
 SELECT DISTINCT T1.Fname FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.VICE_PRESIDENT_Vote EXCEPT SELECT DISTINCT Fname FROM STUDENT WHERE city_code  =  "PIT"

SELECT DISTINCT T1.Fname FROM STUDENT AS T1 JOIN VOTING_RECORD AS T2 ON T1.StuID  =  T2.VICE_President_Vote WHERE T1.city_code  !=  "PIT"
1561
 SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name ,  T1.phone_number FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id

RateLimitError
SELECT DISTINCT T2.customer_first_name ,  T2.customer_last_name ,  T2.phone_number FROM Accounts AS T1 JOIN Customers AS T2 ON T1.customer_id  =  T2.customer_id
4851
 SELECT DISTINCT T2.thing_id ,  T2.Type_of_Thing_Code FROM Timed_Status_of_Things AS T1 JOIN Things AS T2 ON T1.thing_id  =  T2.thing_id WHERE T1.Status_of_Thing_Code  =  'Close' OR T1.Date_and_Date  <  '2017-06-19 02:59:21'

SELECT DISTINCT T1.thing_id ,  T1.Type_of_Thing_Code FROM Things AS T1 JOIN Timed_Status_of_Things AS T2 ON T1.thing_id  =  T2.thing_id WHERE T2.Status_of_Thing_Code  =  'Close' OR T2.Date_and_Date  <  '2017-06-19 02:59:21'
3268
 SELECT DISTINCT stu_fname FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num WHERE enroll_grade  =  'C'

RateLimitError
SELECT T1.stu_fname FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num WHERE T2.enroll_grade  =  'C'
2324
 SELECT campus FROM campuses WHERE county  =  "Los Angeles"

RateLimitError
SELECT campus FROM campuses WHERE county  =  "Los Angeles"
2070
 SELECT count(*) FROM party_events

SELECT count(*) FROM party_events
5053
 SELECT Carrier FROM device ORDER BY Carrier ASC

SELECT DISTINCT Carrier FROM device ORDER BY Carrier
1135
 SELECT DISTINCT T2.Name FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID WHERE T1.Country  =  "West Germany"

SELECT DISTINCT T2.Name FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID WHERE T1.Country  =  'West Germany'
1206
 SELECT min(bathroom_count) ,  max(bathroom_count) FROM Apartments

SELECT MIN(bathroom_count), MAX(bathroom_count) FROM Apartments
3162
 SELECT origin ,  count(*) FROM train GROUP BY origin

RateLimitError
SELECT origin ,  count(*) FROM train GROUP BY origin
1686
 SELECT count(*) FROM exhibition_record AS T1 JOIN exhibition AS T2 ON T1.exhibition_id  =  T2.exhibition_id WHERE T1.attendance  >  100 OR T2.ticket_price  <  10

SELECT count(*) FROM exhibition WHERE exhibition_id IN (SELECT exhibition_id FROM exhibition_record WHERE attendance  >  100) OR exhibition_id IN (SELECT exhibition_id FROM exhibition WHERE ticket_price  <  10)
5771
 SELECT email_address ,  phone_number FROM customers ORDER BY email_address ,  phone_number

RateLimitError
SELECT email_address ,  phone_number FROM customers ORDER BY email_address ,  phone_number
6013
 SELECT StuID ,  count(*) ,  sum(gamesplayed) FROM Sportsinfo GROUP BY StuID

SELECT StuID, count(SportName), sum(GamesPlayed) FROM SportsInfo GROUP BY StuID
5984
 SELECT gtype ,  count(*) FROM Video_games GROUP BY gtype

SELECT gtype, count(*) FROM Video_games GROUP BY gtype
4650
 SELECT max(gradepoint) ,  min(gradepoint) FROM GRADECONVERSION

SELECT max(gradepoint) ,  min(gradepoint) FROM GRADECONVERSION
260
 SELECT Nominee ,  COUNT(*) FROM musical GROUP BY Nominee

RateLimitError
SELECT Nominee, COUNT(Nominee) FROM musical GROUP BY Nominee
4752
 SELECT product_name ,  product_id FROM products WHERE product_price BETWEEN 600 AND 700

RateLimitError
SELECT product_name ,  product_id FROM products WHERE product_price  >  600 AND product_price  <  700
6375
 SELECT T1.id ,  T1.name ,  T1.IATA FROM airport AS T1 JOIN flight AS T2 ON T1.id  =  T2.airport_id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1

RateLimitError
RateLimitError
SELECT airport.id, airport.name, airport.IATA FROM airport, flight WHERE airport.id = flight.airport_id GROUP BY airport.id ORDER BY count(*) DESC LIMIT 1
1030
 SELECT Hardware_Model_name ,  Company_name FROM phone WHERE Accreditation_type LIKE 'Full';

SELECT Hardware_Model_name, Company_name FROM phone WHERE Accreditation_type LIKE '%Full%';
4566
 SELECT T2.name FROM Office_locations AS T1 JOIN buildings AS T2 ON T1.building_id  =  T2.id JOIN Companies AS T3 ON T1.company_id  =  T3.id GROUP BY T1.building_id ORDER BY COUNT(*) DESC LIMIT 1

SELECT name FROM buildings WHERE id  =  (SELECT building_id FROM Office_locations GROUP BY building_id ORDER BY COUNT(*) DESC LIMIT 1)
4777
 SELECT DISTINCT T1.customer_name FROM customers AS T1 JOIN customer_orders AS T2 ON T1.customer_id  =  T2.customer_id JOIN order_items AS T3 ON T2.order_id  =  T3.order_id JOIN products AS T4 ON T3.product_id  =  T4.product_id WHERE T4.product_name  =  "keyboard"

SELECT DISTINCT T1.customer_name FROM customers AS T1 JOIN customer_orders AS T2 ON T1.customer_id  =  T2.customer_id JOIN order_items AS T3 ON T2.order_id  =  T3.order_id JOIN products AS T4 ON T3.product_id  =  T4.product_id WHERE T4.product_name  =  'Keyboard'
5931
 SELECT T1.Name FROM Tourist_Attractions AS T1 JOIN VISITS AS T2 ON T1.Tourist_Attraction_ID  =  T2.Tourist_Attraction_ID JOIN VISITORS AS T3 ON T2.Tourist_ID  =  T3.Tourist_ID WHERE T3.Tourist_Details  =  "Vincent"

SELECT T1.Name FROM Tourist_Attractions AS T1 JOIN VISITORS AS T2 JOIN VISITS AS T3 ON T1.Tourist_Attraction_ID  =  T3.Tourist_Attraction_ID AND T2.Tourist_ID  =  T3.Tourist_ID WHERE T2.Tourist_Details  =  "Vincent"
208
 SELECT name FROM station WHERE city  =  "Palo Alto" EXCEPT SELECT end_station_name FROM trip GROUP BY end_station_name HAVING count(*)  >  100

SELECT name FROM station WHERE city = 'Palo Alto' AND id NOT IN (SELECT end_station_id FROM trip)
1870
 SELECT Name FROM wrestler WHERE Days_held  <  100

RateLimitError
SELECT Name FROM wrestler WHERE Days_held < 100
6404
 SELECT document_id ,  document_name FROM Documents

SELECT document_id, document_name FROM Documents
289
 SELECT T2.f1 FROM user_profiles AS T1 JOIN follows AS T2 ON T1.uid  =  T2.f2 WHERE T1.name  =  "Mary" OR T1.name  =  "Susan"

SELECT T2.f1 FROM user_profiles AS T1 JOIN follows AS T2 ON T1.uid  =  T2.f2 WHERE T1.name  =  "Mary" OR T1.name  =  "Susan"
639
 SELECT T1.name FROM tracks AS T1 JOIN invoice_lines AS T2 ON T1.id = T2.track_id JOIN invoices AS T3 ON T3.id = T2.invoice_id JOIN customers AS T4 ON T4.id = T3.customer_id WHERE T4.first_name = "Daan" AND T4.last_name = "Peeters";

SELECT T1.name FROM tracks AS T1 JOIN invoice_lines AS T2 ON T1.id = T2.track_id JOIN invoices AS T3 ON T2.invoice_id = T3.id JOIN customers AS T4 ON T3.customer_id = T4.id WHERE T4.first_name = "Daan" AND T4.last_name = "Peeters";
2800
 SELECT T1.Committee FROM election AS T1 JOIN party AS T2 ON T1.Party  =  T2.Party_ID WHERE T2.Party  =  "Democratic" INTERSECT SELECT T1.Committee FROM election AS T1 JOIN party AS T2 ON T1.Party  =  T2.Party_ID WHERE T2.Party  =  "Liberal"

SELECT T1.Committee FROM election AS T1 JOIN party AS T2 ON T1.Party  =  T2.Party_ID WHERE T2.Party  =  'democratic party' OR T2.Party  =  'liberal party' GROUP BY T1.Committee HAVING COUNT(*)  =  2
5523
 SELECT product_name ,  typical_buying_price FROM products

SELECT t1.product_name ,  t1.typical_buying_price FROM products AS t1
884
 SELECT BirthDate FROM EMPLOYEE WHERE City  =  "Edmonton"

SELECT T1.BirthDate FROM EMPLOYEE AS T1 JOIN CUSTOMER AS T2 ON T1.EmployeeId  =  T2.SupportRepId WHERE T2.City  =  "Edmonton"
1349
 SELECT title FROM course WHERE course_id NOT IN (SELECT course_id FROM prereq)

SELECT title FROM course EXCEPT SELECT title FROM course WHERE course_id IN (SELECT course_id FROM prereq)
129
 SELECT COUNT(*) FROM station WHERE city  =  "Mountain View"

SELECT count(*) FROM station WHERE city = 'Mountain View'
5752
 SELECT T3.amenity_name FROM dorm AS T1 JOIN has_amenity AS T2 ON T1.dormid  =  T2.dormid JOIN dorm_amenity AS T3 ON T2.amenid  =  T3.amenid WHERE T1.dorm_name  =  'Smith Hall' ORDER BY T3.amenity_name

RateLimitError
RateLimitError
RateLimitError
SELECT amenity_name FROM has_amenity AS T1 JOIN dorm_amenity AS T2 ON T1.amenid  =  T2.amenid JOIN dorm AS T3 ON T1.dormid  =  T3.dormid WHERE T3.dorm_name  =  'Smith Hall' ORDER BY amenity_name
4281
 SELECT clubdesc FROM club WHERE clubname  =  "Tennis Club"

SELECT t1.clubdesc FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t1.clubname  =  "Tennis Club"
4063
 SELECT T2.firstname ,  T2.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.firstname  =  "EVELINA" AND T1.lastname  =  "BROMLEY"

SELECT T2.firstname ,  T2.lastname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.firstname  =  'EVELINA' AND T1.lastname  =  'BROMLEY'
2667
 SELECT First_year ,  Last_year FROM party WHERE Party_Theme  =  "Spring" OR Party_Theme  =  "Teqnology"

SELECT First_year , Last_year FROM party WHERE Party_Theme = "Spring" OR Party_Theme = "Teqnology"
2838
 SELECT count(*) FROM Student JOIN Visits_Restaurant ON Student.StuID = Visits_Restaurant.StuID JOIN Restaurant ON Visits_Restaurant.ResID = Restaurant.ResID WHERE Student.Fname = "Linda" AND Student.Lname = "Smith" AND Restaurant.ResName = "Subway";

SELECT COUNT(*) FROM Visits_Restaurant WHERE StuID = (SELECT StuID FROM Student WHERE Fname = "Linda" AND Lname = "Smith") AND ResID = (SELECT ResID FROM Restaurant WHERE ResName = "Subway");
3889
 SELECT count(*) FROM Settlements

SELECT count(*) FROM Settlements
5536
 SELECT product_category_code ,  typical_buying_price FROM products WHERE product_name  =  "cumin"

SELECT t2.product_category_description, t1.typical_buying_price FROM products AS t1 JOIN ref_product_categories AS t2 ON t1.product_category_code  =  t2.product_category_code WHERE t1.product_name  =  "cumin"
5198
 SELECT T2.lastname FROM Performance AS T1 JOIN Band AS T2 ON T1.bandmate  =  T2.id WHERE stageposition  =  "back" GROUP BY lastname ORDER BY count(*) DESC LIMIT 1

SELECT T2.lastname FROM performance AS T1 JOIN band AS T2 ON T1.bandmate  =  T2.id WHERE T1.stageposition  =  "back" GROUP BY T2.lastname ORDER BY count(*) DESC LIMIT 1
3884
 SELECT DISTINCT customer_details FROM Customers

SELECT DISTINCT Customer_Details FROM Customers
4576
 SELECT name FROM buildings WHERE id NOT IN (SELECT building_id FROM Office_locations)

SELECT name FROM Buildings WHERE id NOT IN (SELECT building_id FROM Office_locations)
5211
 SELECT instrument FROM instruments AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE title  =  "Le Pop"

SELECT DISTINCT instrument FROM instruments AS T1 JOIN songs AS T2 ON T1.songid  =  T2.songid WHERE T2.title  =  "Le Pop"
3506
 SELECT employee_id ,  first_name ,  last_name ,  salary FROM employees WHERE salary  >  ( SELECT AVG (salary) FROM employees ) AND department_id IN ( SELECT department_id FROM employees WHERE first_name LIKE '%J%')

SELECT T1.employee_id ,  T1.first_name ,  T1.last_name ,  T1.salary FROM employees AS T1 JOIN departments AS T2 ON T1.department_id  =  T2.department_id JOIN employees AS T3 ON T2.department_id  =  T3.department_id WHERE T1.salary  >  (SELECT AVG(salary) FROM employees) AND T3.first_name LIKE '%J%'
981
 SELECT founded FROM university ORDER BY enrollment DESC LIMIT 1

SELECT founded FROM university WHERE enrollment  =  ( SELECT MAX ( enrollment ) FROM university )

In [496]:
df_code_davinci2[~(df_code_davinci2['model_response'] == '')].shape

(100, 17)

In [497]:
df_code_davinci2[~(df_code_davinci2['model_response'].isna())].shape

(100, 17)

In [499]:
df_code_davinci2['open_ai_execution'] = df_code_davinci2.apply(lambda x: execution(x, 'open_ai_completion'), axis=1)
df_code_davinci2['model_response_execution'] = df_code_davinci2.apply(lambda x: execution(x, 'model_response'), axis=1)
df_code_davinci2['execution_accuracy'] = np.where(df_code_davinci2['open_ai_execution'] == 
                                                  df_code_davinci2['model_response_execution'], 1, 0)
df_code_davinci2[~(df_code_davinci2['model_response'] == '') & 
                 ~(df_code_davinci2['model_response'].isna())]['execution_accuracy'].mean()

0.76

In [502]:
i = 1
print(df_code_davinci2[df_code_davinci2['execution_accuracy'] == 0].iloc[i]['open_ai_prompt'])
print(df_code_davinci2[df_code_davinci2['execution_accuracy'] == 0].iloc[i]['open_ai_completion'])
print(df_code_davinci2[df_code_davinci2['execution_accuracy'] == 0].iloc[i]['model_response'])

Convert text to SQL.

DDL:
```
CREATE TABLE Addresses (address_id INTEGER ,address_details VARCHAR(255));CREATE TABLE Staff (staff_id INTEGER ,staff_gender VARCHAR(1),staff_name VARCHAR(80));CREATE TABLE Suppliers (supplier_id INTEGER ,supplier_name VARCHAR(80),supplier_phone VARCHAR(80));CREATE TABLE Department_Store_Chain (dept_store_chain_id INTEGER ,dept_store_chain_name VARCHAR(80));CREATE TABLE Customers (customer_id INTEGER ,payment_method_code VARCHAR(10) ,customer_code VARCHAR(20),customer_name VARCHAR(80),customer_address VARCHAR(255),customer_phone VARCHAR(80),customer_email VARCHAR(80));CREATE TABLE Products (product_id INTEGER ,product_type_code VARCHAR(10) ,product_name VARCHAR(80),product_price DECIMAL(19,4));CREATE TABLE Supplier_Addresses (supplier_id INTEGER ,address_id INTEGER ,date_from DATETIME ,date_to DATETIME);CREATE TABLE Customer_Addresses (customer_id INTEGER ,address_id INTEGER ,date_from DATETIME ,date_to DATETIME);CREATE TABLE Customer_Orders (order_id INTEGER ,customer_id INTEGER ,order_status_code VARCHAR(10) ,order_date DATETIME );CREATE TABLE Department_Stores (dept_store_id INTEGER ,dept_store_chain_id INTEGER,store_name VARCHAR(80),store_address VARCHAR(255),store_phone VARCHAR(80),store_email VARCHAR(80));CREATE TABLE Departments (department_id INTEGER ,dept_store_id INTEGER ,department_name VARCHAR(80));CREATE TABLE Order_Items (order_item_id INTEGER ,order_id INTEGER ,product_id INTEGER );CREATE TABLE Product_Suppliers (product_id INTEGER ,supplier_id INTEGER ,date_supplied_from DATETIME ,date_supplied_to DATETIME,total_amount_purchased VARCHAR(80),total_value_purchased DECIMAL(19,4));CREATE TABLE Staff_Department_Assignments (staff_id INTEGER ,department_id INTEGER ,date_assigned_from DATETIME ,job_title_code VARCHAR(10) ,date_assigned_to DATETIME);
```

Question:
"""What are the distinct names of products purchased by at least two different customers?"""
Answer:
SELECT DISTINCT T3.product_name FROM customer_orders AS T1 JOIN order_items AS T2 ON T1.order_id  =  T2.order_id JOIN products AS T3 ON T2.product_id  =  T3.product_id GROUP BY T3.product_id HAVING COUNT (DISTINCT T1.customer_id)  >=  2

Question:
"""What is the address for the customer with id 10?"""
Answer:
SELECT T1.address_details FROM addresses AS T1 JOIN customer_addresses AS T2 ON T1.address_id  =  T2.address_id WHERE T2.customer_id  =  10

Question:
"""Return the distinct name of customers whose order status is Pending, in the order of customer id."""
Answer:
SELECT DISTINCT T1.customer_name FROM customers AS T1 JOIN customer_orders AS T2 ON T1.customer_id  =  T2.customer_id WHERE T2.order_status_code  =  "Pending" ORDER BY T2.customer_id

Question:
"""What is the id and name of the staff who has been assigned for the least amount of time?"""
Answer:

 SELECT T1.staff_id ,  T1.staff_name FROM staff AS T1 JOIN Staff_Department_Assignments AS T2 ON T1.staff_id  =  T2.staff_id ORDER BY date_assigned_to - date_assigned_from LIMIT 1

SELECT T1.staff_id, T1.staff_name FROM staff AS T1 JOIN staff_department_assignments AS T2 ON T1.staff_id  =  T2.staff_id WHERE T2.date_assigned_from  =  (SELECT MIN(T3.date_assigned_from) FROM staff_department_assignments AS T3)

In [503]:
df_code_cushman = df.sample(100).copy()
df_code_cushman['model_response'] = ''

data = []
for idx, row in df_code_cushman.iterrows():
    print(idx)
    if row['model_response'] != '':
        print('already completed')
        data.append(row['model_response'])
        continue
    
    print(row['open_ai_completion'])
    new_response = call_raw_model(row, engine="code-cushman-001", stop='\n', max_tokens=128)
    data.append(new_response)
    df_code_cushman.loc[idx,'model_response'] = new_response

6174
 SELECT avg(T2.Weeks_on_Top) FROM artist AS T1 JOIN volume AS T2 ON T1.Artist_ID  =  T2.Artist_ID WHERE T1.age  <=  25

SELECT avg(T2.Weeks_on_Top) FROM artist AS T1 JOIN volume AS T2 ON T1.Artist_ID  =  T2.Artist_ID WHERE T1.age  <=  25
5694
 SELECT count(DISTINCT gender) FROM dorm

SELECT count(DISTINCT gender) FROM dorm
2760
 SELECT T2.Delegate FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District WHERE T1.Population  <  100000

SELECT T2.Delegate FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District WHERE T1.Population  <  100000
3799
 SELECT personal_name ,  family_name FROM Students ORDER BY family_name

SELECT T1.personal_name ,  T1.family_name FROM Students AS T1 ORDER BY T1.family_name
1261
 SELECT apt_type_code FROM Apartments GROUP BY apt_type_code ORDER BY count(*) DESC LIMIT 1

SELECT apt_type_code FROM Apartments GROUP BY apt_type_code ORDER BY count(apt_type_code) DESC
6452
 SELECT T1.document_id FROM Documents_with_expenses AS T1 JOIN Ref_Budget_Codes AS T2 ON T1.Budget_Type_code  =  T2.Budget_Type_code WHERE T2.budget_type_Description  =  "Government"

SELECT document_id FROM Documents_with_expenses WHERE budget_type_code IN (SELECT budget_type_code FROM Ref_Budget_Codes WHERE budget_type_description = "Government")
2787
 SELECT T1.County_name FROM county AS T1 JOIN election AS T2 ON T1.County_id  =  T2.District GROUP BY T1.County_id HAVING COUNT(*)  >=  2

RateLimitError
SELECT T1.County_name FROM election AS T1 JOIN party AS T2 ON T1.Party  =  T2.Party_ID WHERE T1.District  =  1 GROUP BY T1.County_name HAVING COUNT(*)  >  1
3924
 SELECT patient FROM stay WHERE room  =  111 ORDER BY staystart DESC LIMIT 1

SELECT T1.name FROM patient AS T1 JOIN stay AS T2 ON T1.ssn  =  T2.patient GROUP BY T1.ssn ORDER BY T2.stayend DESC LIMIT 1
4415
 SELECT age FROM Person WHERE job  =  'doctor' AND name  =  'Zach'

RateLimitError
RateLimitError
RateLimitError
SELECT age FROM Person WHERE name  =  'Zach' AND job  =  'doctor'
868
 SELECT AVG(Milliseconds) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Latin" OR T1.Name  =  "Pop"

SELECT avg(Milliseconds) FROM GENRE AS T1 JOIN TRACK AS T2 ON T1.GenreId  =  T2.GenreId WHERE T1.Name  =  "Latin" OR T1.Name  =  "Pop"
5427
 SELECT name ,  city FROM branch WHERE branch_id NOT IN (SELECT branch_id FROM membership_register_branch)

SELECT name ,  city FROM branch WHERE branch_id NOT IN (SELECT branch_id FROM membership_register_branch)
4694
 SELECT T1.Fname ,  T1.Lname FROM FACULTY AS T1 JOIN MEMBER_OF AS T2 ON T1.FacID  =  T2.FacID WHERE T2.DNO  =  520

SELECT T1.Fname, T1.Lname FROM FACULTY AS T1 JOIN MEMBER_OF AS T2 ON T1.FacID  =  T2.FacID WHERE T2.DNO  =  520
3983
 SELECT name FROM procedures WHERE cost  >  1000 EXCEPT SELECT T3.name FROM physician AS T1 JOIN trained_in AS T2 ON T1.employeeid  =  T2.physician JOIN procedures AS T3 ON T3.code  =  T2.treatment WHERE T1.name  =  "John Wen"

SELECT DISTINCT T1.Name FROM Procedures AS T1 JOIN Trained_In AS T2 ON T1.Code = T2.Treatment JOIN Physician AS T3 ON T2.Physician = T3.EmployeeID WHERE T1.Cost > 1000 AND T3.Name  =  'John Wen'
2109
 SELECT T1.role_description ,  T2.role_code ,  count(*) FROM ROLES AS T1 JOIN Employees AS T2 ON T1.role_code = T2.role_code GROUP BY T2.role_code;

SELECT T1.role_description, T1.role_code, COUNT(T2.employee_id) AS employee_count FROM ROLES AS T1 JOIN Employees AS T2 ON T1.role_code = T2.role_code GROUP BY T1.role_description, T1.role_code;
1732
 SELECT Player_name FROM player WHERE Player_ID NOT IN (SELECT Player_ID FROM player_coach)

SELECT player_name FROM player WHERE coach_id  IS  NULL
2575
 SELECT roomName ,  RoomId FROM Rooms WHERE basePrice  >  160 AND maxOccupancy  >  2;

SELECT roomName ,  RoomId FROM Rooms WHERE basePrice  >  160 AND maxOccupancy  >  2;
6005
 SELECT T2.Lname FROM Sportsinfo AS T1 JOIN Student AS T2 ON T1.StuID  =  T2.StuID WHERE T1.onscholarship  =  'Y'

RateLimitError
SELECT lname FROM Student WHERE onscholarship = 'Y'
4994
 SELECT DISTINCT state FROM college AS T1 JOIN tryout AS T2 ON T1.cName  =  T2.cName

RateLimitError
RateLimitError
SELECT DISTINCT state FROM college AS T1 JOIN tryout AS T2 ON T1.cName  =  T2.cName
1796
 SELECT name FROM accounts ORDER BY name

SELECT name FROM accounts ORDER BY name
1838
 SELECT DISTINCT T1.name FROM web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_id  =  T1.id JOIN browser AS T3 ON T2.browser_id  =  T3.id WHERE T3.market_share  >  15;

SELECT T1.name FROM web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_id  =  T1.id JOIN browser AS T3 ON T2.browser_id  =  T3.id WHERE T3.market_share  >=  15 GROUP BY T1.name
687
 SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id

RateLimitError
SELECT DISTINCT T1.customer_first_name ,  T1.customer_last_name FROM Customers AS T1 JOIN Accounts AS T2 ON T1.customer_id  =  T2.customer_id
338
 SELECT date_of_latest_revision FROM Catalogs GROUP BY date_of_latest_revision HAVING count(*)  >  1

SELECT date_of_latest_revision FROM Catalogs GROUP BY date_of_latest_revision HAVING count(*)  >  1
1287
 SELECT count(DISTINCT T1.injury) FROM injury_accident AS T1 JOIN game AS T2 ON T1.game_id  =  T2.id WHERE T2.season  >  2010

SELECT count(distinct injury) FROM injury_accident WHERE season  >  2010
4987
 SELECT count(*) ,  cName FROM tryout GROUP BY cName ORDER BY count(*) DESC

SELECT T1.cName, COUNT(T2.pID) FROM college AS T1 JOIN tryout AS T2 ON T1.cName  =  T2.cName GROUP BY T1.cName ORDER BY COUNT(T2.pID) DESC
3297
 SELECT stu_gpa ,  stu_phone ,  stu_fname FROM student ORDER BY stu_gpa DESC LIMIT 5

SELECT stu_fname ,  stu_gpa ,  stu_phone FROM student WHERE stu_gpa  =  (SELECT max(stu_gpa) FROM student) LIMIT 5
6366
 SELECT count(*) FROM flight WHERE velocity  >  200

SELECT count(*) FROM flight WHERE velocity > 200
3013
 SELECT avg(no_of_customers) FROM bank WHERE state  =  'Utah'

RateLimitError
SELECT AVG(no_of_customers) FROM bank WHERE state = 'Utah'
558
 SELECT T1.first_name ,  T1.last_name FROM customers AS T1 JOIN invoices AS T2 ON T2.customer_id  =  T1.id ORDER BY total LIMIT 10;

SELECT T1.first_name, T1.last_name FROM customers AS T1 JOIN invoices AS T2 ON T1.id = T2.customer_id GROUP BY T1.id ORDER BY T2.total ASC LIMIT 10;
2562
 SELECT LOCATION FROM county_public_safety GROUP BY LOCATION ORDER BY COUNT(*) DESC LIMIT 1

SELECT Location FROM county_public_safety GROUP BY Location ORDER BY COUNT(*) DESC LIMIT 1
1216
 SELECT guest_first_name ,  guest_last_name FROM Guests

SELECT guest_first_name , guest_last_name FROM Guests
3219
 SELECT sum(stu_hrs) ,  dept_code FROM student GROUP BY dept_code

RateLimitError
SELECT T1.dept_name,sum(T2.stu_hrs) FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num GROUP BY T1.dept_code
6367
 SELECT vehicle_flight_number ,  date ,  pilot FROM flight ORDER BY altitude ASC

RateLimitError
SELECT T1.Vehicle_Flight_number ,  T1.Date ,  T1.pilot ,  T1.Altitude FROM flight AS T1 ORDER BY T1.Altitude
14
 SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1

RateLimitError
SELECT department_id, name, count(head_id) FROM management GROUP BY department_id HAVING count(head_id) > 1
5371
 SELECT T1.problem_id FROM problems AS T1 JOIN staff AS T2 ON T1.reported_by_staff_id = T2.staff_id WHERE T2.staff_last_name = "Bosco"

SELECT T1.problem_id FROM problems AS T1 JOIN staff AS T2 ON T1.reported_by_staff_id = T2.staff_id WHERE T2.staff_last_name = "Bosco"
1068
 SELECT Player ,  Years_Played FROM player

SELECT Player, Years_Played FROM player
6739
 SELECT building FROM Faculty WHERE rank  =  "Professor" GROUP BY building HAVING count(*)  >=  10

RateLimitError
RateLimitError
SELECT building FROM Faculty GROUP BY building HAVING count(*) >= 10
6532
 SELECT Name FROM WINE WHERE score  >  90

RateLimitError
RateLimitError
SELECT Name FROM WINE WHERE Score > 90
1895
 SELECT school_name FROM school WHERE school_id NOT IN (SELECT school_id FROM endowment)

SELECT T2.school_name FROM school AS T2 LEFT JOIN endowment AS T1 ON T2.school_id  =  T1.school_id WHERE T1.endowment_id  IS  NULL
4832
 SELECT Aircraft FROM aircraft WHERE Aircraft_ID NOT IN (SELECT Winning_Aircraft FROM MATCH)

SELECT Aircraft FROM aircraft WHERE Aircraft NOT IN (SELECT Winning_Aircraft FROM match)
5956
 SELECT T1.Name ,  T1.Tourist_Attraction_ID FROM Tourist_Attractions AS T1 JOIN VISITS AS T2 ON T1.Tourist_Attraction_ID  =  T2.Tourist_Attraction_ID GROUP BY T2.Tourist_Attraction_ID HAVING count(*)  <=  1

SELECT T1.Name ,  T1.Tourist_Attraction_ID FROM TOURIST_ATTRACTIONS AS T1 JOIN ( SELECT Tourist_Attraction_ID ,  count(*) AS cnt FROM Visits GROUP BY Tourist_Attraction_ID HAVING cnt = 1 ) AS T2 ON T1.Tourist_Attraction_ID  =  T2.Tourist_Attraction_ID
6601
 SELECT DISTINCT LOCATION FROM station

SELECT LOCATION FROM station
3838
 SELECT T1.student_id ,  T2.personal_name FROM Student_Course_Enrolment AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id HAVING COUNT(*)  >=  2

SELECT T1.student_id ,  T1.personal_name FROM Students AS T1 JOIN Student_Course_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T2.student_id HAVING Count(*)  >=  2
4264
 SELECT count(*) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t1.clubname  =  "Pen and Paper Gaming"

SELECT count(*) FROM club AS t1 JOIN member_of_club AS t2 ON t1.clubid  =  t2.clubid JOIN student AS t3 ON t2.stuid  =  t3.stuid WHERE t1.clubname  =  "Pen and Paper Gaming"
1707
 SELECT T1.title ,  T1.i_id FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id GROUP BY T2.i_id ORDER BY avg(T2.rating) DESC LIMIT 1

RateLimitError
SELECT name, i_id FROM item WHERE i_id IN (SELECT i_id FROM review GROUP BY i_id ORDER BY AVG(rating) DESC LIMIT 1)
5972
 SELECT count(DISTINCT gtype) FROM Video_games

SELECT count(distinct gtype) FROM Video_Games
611
 SELECT name FROM media_types;

RateLimitError
RateLimitError
RateLimitError
SELECT * FROM media_types;
385
 SELECT flno FROM Flight WHERE origin  =  "Los Angeles"

SELECT flno FROM Flight WHERE origin  =  'Los Angeles'
3627
 SELECT DISTINCT artist_name FROM artist WHERE country  =  "Bangladesh" EXCEPT SELECT DISTINCT artist_name FROM song WHERE rating  >  7

SELECT artist_name FROM artist WHERE country = "Bangladesh" AND NOT EXISTS (SELECT * FROM song WHERE rating > 7 AND artist_name = artist.artist_name)
5017
 SELECT T1.cName FROM  tryout AS T1 JOIN player AS T2 ON T1.pID  =  T2.pID WHERE T2.pName LIKE 'D%'

SELECT DISTINCT T1.cName FROM college AS T1 JOIN tryout AS T2 ON T1.cName  =  T2.cName WHERE T2.pName  LIKE  'D%'
1444
 SELECT name FROM instructor WHERE id NOT IN (SELECT id FROM teaches WHERE semester  =  'Spring')

SELECT T1.name FROM instructor AS T1 LEFT JOIN teaches AS T2 ON T1.ID  =  T2.ID WHERE T2.semester  =  'Spring' GROUP BY T1.name HAVING count(T2.course_id)  =  0
5443
 SELECT card_number FROM member WHERE Hometown LIKE "%Kentucky%"

SELECT card_number FROM member WHERE hometown  =  Kentucky
594
 SELECT T1.first_name , T1.last_name FROM employees AS T1 JOIN customers AS T2 ON T1.id  =  T2.support_rep_id GROUP BY T1.id ORDER BY count(*) DESC LIMIT 1

RateLimitError
SELECT T1.first_name , T1.last_name FROM employees AS T1 JOIN customers AS T2 ON T1.id  =  T2.support_rep_id GROUP BY T1.id ORDER BY count(*) DESC LIMIT 1
3221
 SELECT max(stu_gpa) ,  avg(stu_gpa) ,  min(stu_gpa) ,  dept_code FROM student GROUP BY dept_code

SELECT T1.dept_code ,  MAX(T1.stu_gpa) AS max_gpa ,  AVG(T1.stu_gpa) AS avg_gpa ,  MIN(T1.stu_gpa) AS min_gpa FROM student AS T1 JOIN enroll AS T2 ON T1.stu_num  =  T2.stu_num JOIN class AS T3 ON T2.class_code  =  T3.class_code GROUP BY T1.dept_code
4483
 SELECT DISTINCT T4.name FROM PersonFriend AS T1 JOIN Person AS T2 ON T1.name  =  T2.name JOIN PersonFriend AS T3 ON T1.friend  =  T3.name JOIN PersonFriend AS T4 ON T3.friend  =  T4.name WHERE T2.name  =  'Alice' AND T4.name != 'Alice'

RateLimitError
SELECT T1.name FROM Person AS T1 JOIN PersonFriend AS T2 ON T1.name  =  T2.friend JOIN PersonFriend AS T3 ON T1.name  =  T3.friend WHERE T2.friend  =  'Alice'
1636
 SELECT count(*) FROM people WHERE is_male  =  'F' AND age  >  30

SELECT count(*) FROM people WHERE age > 30 AND is_male = 'F'
3328
 SELECT T2.emp_fname ,  T1.prof_office FROM professor AS T1 JOIN employee AS T2 ON T1.emp_num  =  T2.emp_num JOIN department AS T3 ON T1.dept_code  =  T3.dept_code WHERE T3.dept_name  =  'History' AND T1.prof_high_degree != 'Ph.D.'

SELECT T2.emp_fname ,  T1.prof_office FROM professor AS T1 JOIN employee AS T2 ON T1.emp_num  =  T2.emp_num WHERE T1.prof_high_degree  =  'N' AND T1.prof_degree  =  'Ph.D.'
3846
 SELECT login_name FROM Course_Authors_and_Tutors INTERSECT SELECT login_name FROM Students

SELECT login_name FROM Course_Authors_and_Tutors AS T1 JOIN Students AS T2 ON T1.author_id  =  T2.author_id
6357
 SELECT name FROM driver WHERE driver_id NOT IN (SELECT driver_id FROM school_bus)

SELECT name FROM driver WHERE driver_id NOT IN (SELECT driver_id FROM school_bus)
4068
 SELECT count(*) FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T2.firstname  =  "KAWA" AND T2.lastname  =  "GORDON"

RateLimitError
RateLimitError
SELECT count(*) FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T2.firstname  =  "KAWA" AND T2.lastname  =  "GORDON"
3138
 SELECT DISTINCT last_name FROM Maintenance_Engineers

SELECT DISTINCT last_name FROM Staff
9
 SELECT T1.name ,  T1.num_employees FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id WHERE T2.temporary_acting  =  'Yes'

SELECT department.name,count(*) FROM department JOIN management ON department.department_id = management.department_id JOIN head ON management.head_id = head.head_id WHERE head.temporary_acting = 'Yes' GROUP BY department.name;
2451
 SELECT max(stars) ,  min(stars) FROM Rating

SELECT MAX(stars) AS maxStars, MIN(stars) AS minStars FROM Rating
4343
 SELECT date_from ,  date_to FROM Project_Staff WHERE role_code  =  'researcher'

SELECT date_from,date_to FROM Project_Staff WHERE staff_id IN ( SELECT staff_id FROM Research_Staff WHERE employer_organisation_id IN ( SELECT organisation_id FROM Organisations WHERE organisation_type = 'Academic' ) )
4043
 SELECT DISTINCT classroom FROM list WHERE grade  =  4

SELECT DISTINCT classroom FROM list WHERE grade  =  4
4050
 SELECT firstname FROM teachers WHERE classroom  =  110

RateLimitError
RateLimitError
RateLimitError
SELECT DISTINCT T2.firstname FROM list AS T1 JOIN teachers AS T2 ON T1.classroom  =  T2.classroom WHERE T1.classroom  =  110
3412
 SELECT * FROM employees WHERE department_id  =  "null"

SELECT first_name ,  last_name FROM employees WHERE department_id  IS NULL
4963
 SELECT count(*) FROM tryout WHERE decision  =  'yes'

SELECT count(*) FROM Tryout WHERE decision = "yes"
3394
 SELECT t1.name FROM furniture AS t1 JOIN furniture_manufacte AS t2 ON t1.Furniture_ID  =  t2.Furniture_ID WHERE t2.Price_in_Dollar  <  (SELECT max(Price_in_Dollar) FROM furniture_manufacte)

RateLimitError
SELECT t1.name FROM furniture AS t1 JOIN furniture_manufacte AS t2 ON t1.Furniture_ID  =  t2.Furniture_ID WHERE t2.Price_in_Dollar  <  (SELECT max(Price_in_Dollar) FROM furniture_manufacte)
3169
 SELECT t2.id ,  t2.local_authority FROM weekly_weather AS t1 JOIN station AS t2 ON t1.station_id  =  t2.id GROUP BY t1.station_id ORDER BY avg(high_temperature) DESC LIMIT 1

SELECT t1.id ,  t1.local_authority FROM weekly_weather AS t1 JOIN station AS t2 ON t1.station_id  =  t2.id WHERE avg(t1.high_temperature)  =  (SELECT max(t3.avg_high_temperature) FROM weekly_weather AS t3 JOIN station AS t4 ON t3.station_id  =  t4.id)
6795
 SELECT DISTINCT T1.lname FROM Faculty AS T1 JOIN Faculty_participates_in AS T2 ON T1.facID  =  T2.facID JOIN activity AS T3 ON T2.actid  =  T2.actid WHERE T3.activity_name  =  'Canoeing' OR T3.activity_name  =  'Kayaking'

SELECT T1.fname FROM Faculty AS T1 JOIN Faculty_participates_in AS T2 ON T1.facID  =  T2.facID JOIN Activity AS T3 ON T3.actid  =  T2.actid WHERE T3.activity_name  =  "Canoeing" OR T3.activity_name  =  "Kayaking"
6233
 SELECT CLASS FROM captain GROUP BY CLASS HAVING count(*)  >  2

RateLimitError

SELECT class FROM captain GROUP BY class HAVING count(*) > 2
419
 SELECT count(DISTINCT eid) FROM Certificate

SELECT count(*) FROM Employee AS T1 JOIN Certificate AS T2 ON T1.eid  =  T2.eid
2566
 SELECT Police_force FROM county_public_safety WHERE LOCATION  =  "East" INTERSECT SELECT Police_force FROM county_public_safety WHERE LOCATION  =  "West"

RateLimitError
SELECT Police_force FROM county_public_safety WHERE LOCATION = 'EAST' OR LOCATION = 'WEST' GROUP BY Police_force ORDER BY COUNT(*) DESC LIMIT 1
1218
 SELECT date_of_birth FROM Guests WHERE gender_code  =  "Male"

SELECT date_of_birth FROM Guests WHERE gender_code = "M"
6144
 SELECT count(*) FROM artist

SELECT COUNT(*) FROM artist
4981
 SELECT pName FROM Player WHERE yCard  =  'yes' ORDER BY HS DESC

SELECT pName FROM Player WHERE yCard  =  'yes' ORDER BY HS DESC
1228
 SELECT DISTINCT T2.apt_number FROM Apartment_Bookings AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.booking_status_code  =  "Confirmed"

SELECT DISTINCT T2.apt_number FROM Apartment_Bookings AS T1 JOIN Apartments AS T2 ON T1.apt_id  =  T2.apt_id WHERE T1.booking_status_code  =  "Confirmed"
1935
 SELECT name ,  LOCATION FROM cinema WHERE capacity  >  (SELECT avg(capacity) FROM cinema)

SELECT name ,  location FROM cinema WHERE capacity  >  (SELECT AVG(capacity) FROM cinema)
2138
 SELECT T1.event_details FROM EVENTS AS T1 JOIN Services AS T2 ON T1.Service_ID  =  T2.Service_ID WHERE T2.Service_Type_Code  =  'Marriage'

SELECT Event_Details FROM Events WHERE Service_ID IN (SELECT Service_ID FROM Services WHERE Service_Type_Code = 'Marriage')
6978
 SELECT publisher FROM book_club WHERE YEAR  =  1989 INTERSECT SELECT publisher FROM book_club WHERE YEAR  =  1990

RateLimitError
RateLimitError
SELECT publisher FROM book_club WHERE YEAR  =  1989 INTERSECT SELECT publisher FROM book_club WHERE YEAR  =  1990
291
 SELECT name ,  email FROM user_profiles ORDER BY followers LIMIT 1

SELECT T1.name, T1.email FROM user_profiles AS T1 JOIN follows AS T2 ON T1.uid  =  T2.f1 GROUP BY T2.f1 HAVING count(*)  =  (SELECT min(count(*) FROM user_profiles AS T3 JOIN follows AS T4 ON T3.uid  =  T4.f1 GROUP BY T4.f1)
1706
 SELECT T1.name FROM useracct AS T1 JOIN review AS T2 ON T1.u_id  =  T2.u_id GROUP BY T2.u_id ORDER BY count(*) DESC LIMIT 1

SELECT name FROM useracct WHERE u_id IN (SELECT u_id FROM review GROUP BY u_id ORDER BY count(*) DESC LIMIT 1)
5098
 SELECT Customer_Phone ,  Customer_Email_Address FROM CUSTOMERS WHERE Customer_Name  =  "Harold"

SELECT Customer_Phone,Customer_Email_Address FROM Customers WHERE Customer_Name  =  "Harold"
1210
 SELECT apt_number ,  room_count FROM Apartments

RateLimitError
RateLimitError
SELECT apt_number,room_count FROM Apartments
2495
 SELECT count(*) ,  T1.director FROM Movie AS T1 JOIN Rating AS T2 ON T1.mID  =  T2.mID GROUP BY T1.director

SELECT director, COUNT(rID) FROM Reviewer GROUP BY director
5874
 SELECT investor_id ,  COUNT(*) FROM TRANSACTIONS GROUP BY investor_id

SELECT investor_id, count(transaction_id) FROM Transactions GROUP BY investor_id
6160
 SELECT Song FROM volume WHERE Weeks_on_Top  >  1

RateLimitError
SELECT Song FROM volume WHERE Weeks_on_Top > 1
6667
 SELECT date_of_birth FROM Customers WHERE customer_status_code  =  'Good Customer'

SELECT date_of_birth FROM Customers WHERE customer_status_code = "Good Customer";
1728
 SELECT T3.Player_name ,  T2.coach_name FROM player_coach AS T1 JOIN coach AS T2 ON T1.Coach_ID  =  T2.Coach_ID JOIN player AS T3 ON T1.Player_ID  =  T3.Player_ID

SELECT Player_name, Coach_name FROM player JOIN player_coach ON player.Player_ID  =  player_coach.Player_ID JOIN coach ON player_coach.Coach_ID  =  coach.Coach_ID
5606
 SELECT name FROM stadium ORDER BY capacity DESC LIMIT 1

SELECT name FROM stadium WHERE capacity = (SELECT max(capacity) FROM stadium)
4035
 SELECT DISTINCT firstname FROM list WHERE classroom  =  107

SELECT firstname FROM list WHERE classroom  =  107
581
 SELECT country FROM customers WHERE first_name = "Roberto" AND last_name = "Almeida";

SELECT country FROM employees WHERE first_name  =  'Roberto' AND last_name  =  'Almeida'
5821
 SELECT Author FROM submission WHERE College  =  "Florida" OR College  =  "Temple"

SELECT Author FROM submission WHERE College  =  "Florida" OR College  =  "Temple"
2185
 SELECT DISTINCT T1.forename FROM drivers AS T1 JOIN driverstandings AS T2 ON T1.driverid = T2.driverid WHERE T2.position = 1 AND T2.wins = 1 AND T2.points > 20

SELECT DISTINCT T1.forename FROM drivers AS T1 JOIN driverstandings AS T2 ON T1.driverid = T2.driverid WHERE T2.position = 1 AND T2.wins = 1 AND T2.points > 20
182
 SELECT zip_code FROM weather GROUP BY zip_code HAVING avg(mean_visibility_miles)  <  10

RateLimitError
SELECT zip_code FROM weather WHERE mean_visibility_miles  <  10
1540
 SELECT t2.customer_details FROM policies AS t1 JOIN customers AS t2 ON t1.customer_id  =  t2.customer_id GROUP BY t2.customer_details ORDER BY count(*) DESC LIMIT 1

RateLimitError
SELECT customer_details FROM customers WHERE customer_id IN (SELECT customer_id FROM policies GROUP BY customer_id ORDER BY count(*) DESC LIMIT 1)
3193
 SELECT crs_credit ,  crs_description FROM course WHERE crs_code  =  'QM-261'

SELECT T1.crs_description ,  T1.crs_credit FROM course AS T1 WHERE T1.crs_code  =  'QM-261'
1863
 SELECT T1.Time FROM elimination AS T1 JOIN wrestler AS T2 ON T1.Wrestler_ID  =  T2.Wrestler_ID WHERE T2.Days_held  >  50

SELECT T1.Time FROM elimination AS T1 JOIN wrestler AS T2 ON T1.Wrestler_ID  =  T2.Wrestler_ID WHERE T2.Days_held  >  50
5962
 SELECT T2.Name FROM Locations AS T1 JOIN Tourist_Attractions AS T2 ON T1.Location_ID  =  T2.Location_ID WHERE T1.Address  =  "254 Ottilie Junction" OR T2.How_to_Get_There  =  "bus"

RateLimitError
SELECT Name FROM TOURIST_ATTRACTIONS WHERE (How_to_Get_There LIKE "%bus%") OR (Address LIKE "%254 Ottilie Junction%")
6715
 SELECT count(*) FROM Faculty

SELECT COUNT(*) FROM Faculty

In [505]:
df_code_cushman['open_ai_execution'] = df_code_cushman.apply(lambda x: execution(x, 'open_ai_completion'), axis=1)
df_code_cushman['model_response_execution'] = df_code_cushman.apply(lambda x: execution(x, 'model_response'), axis=1)
df_code_cushman['execution_accuracy'] = np.where(df_code_cushman['open_ai_execution'] == 
                                                  df_code_cushman['model_response_execution'], 1, 0)
df_code_cushman[~(df_code_cushman['model_response'] == '') & 
                 ~(df_code_cushman['model_response'].isna())]['execution_accuracy'].mean()

0.59

# SQLglot cleanup

In [176]:
a ="""CREATE TABLE trip (
    id INTEGER PRIMARY KEY,
    duration INTEGER,
    start_date TEXT,
    start_station_name TEXT, -- this should be removed
    start_station_id INTEGER,
    end_date TEXT,
    end_station_name TEXT, -- this should be removed
    end_station_id INTEGER,
    bike_id INTEGER,
    subscription_type TEXT,
    zip_code INTEGER);
"""

def remove_quotes_and_lower_case(node):
    if isinstance(node, sqlglot.exp.Identifier):
        return sqlglot.exp.Identifier(**{**node.args, 'this': node.this.lower(), "quoted": False})
        if ' ' in str(node):
            raise Exception("Whitespace found in column name, cannot strip quotes without causing syntax errors")
    return node

def remove_reference_nodes(node):
    if isinstance(node, sqlglot.exp.Anonymous):
        return
    return node

parsed = sqlglot.parse_one(a)
parsed.transform(remove_quotes_and_lower_case).transform(remove_reference_nodes).sql()
# Output: CREATE TABLE IF NOT EXISTS department (department_id INT, name TEXT, creation TEXT, ranking INT, budget_in_billions FLOAT, num_employees FLOAT)

'CREATE TABLE trip (id INT PRIMARY KEY, duration INT, start_date TEXT, start_station_name TEXT /* this should be removed */, start_station_id INT, end_date TEXT, end_station_name TEXT /* this should be removed */, end_station_id INT, bike_id INT, subscription_type TEXT, zip_code INT)'